Repository: tara-45/tabby8
Catalog: docs/locale/*/LC_MESSAGES/install/docker.po
Languages: id_id

source: Installing Locally using Docker
id_id: Menginstal secara loval mengunakan Docker

source: Is this the best install method for you?
id_id: Apa ini cara menginstal yang terbaik untuk anda?

source: In most cases, we recommend doing an :ref:`internet-based installation on Heroku <install-heroku>` instead. If you decide to do a local installation, be sure to read our page on :ref:`local installations <install-local>` to help you understand what's going on, particularly this section: :ref:`install-decision`
id_id: Dalam kebanyakan kasus, kami merekomendasikan melakukan: ref: `penginstalan berbasis internet di Heroku <install-heroku>` sebagai gantinya. Jika Anda memutuskan untuk melakukan instalasi lokal, pastikan untuk membaca halaman kami di: ref: `local installations <install-local>` untuk membantu Anda memahami apa yang terjadi, khususnya bagian ini:: ref: `install-decision`

source: If you need an offline copy of Tabbycat, installing using Docker should be simpler and quicker than using the "Install Locally on…" instructions for your operating system. However if a Docker installation doesn't work as outlined below, it's harder to address what isn't working. If you encounter any problems with Docker, we recommend using the "Install Locally on…" option as a fallback, but if you need to do so, `please also report the issue you're having on GitHub <https://github.com/TabbycatDebate/tabbycat/issues/new?labels=installation-docker&title=Docker%20installation%20problem&body=Please%20be%20sure%20to%20include%20your%20operating%20system%20and%20version,%20and%20please%20be%20as%20specific%20as%20you%20can%20about%20the%20problem%20you%20encountered%3A%0D%0D>`_ or :ref:`contact the developers <authors>`.
id_id: Jika Anda memerlukan salinan Tabbycat offline, menginstal menggunakan Docker seharusnya lebih sederhana dan lebih cepat daripada menggunakan petunjuk "Install Locally on…" untuk sistem operasi Anda. Namun jika instalasi Docker tidak berfungsi seperti yang diuraikan di bawah ini, lebih sulit untuk mengatasi apa yang tidak berfungsi. Jika Anda mengalami masalah apa pun dengan Docker, sebaiknya gunakan opsi "Install Locally on…" sebagai fallback, tetapi jika Anda perlu melakukannya, `harap laporkan juga masalah yang Anda alami di GitHub <https://github.com/TabbycatDebate/tabbycat/issues/new?labels=installation-docker&title=Docker%20installation%20problem&body=Please%20be%20sure%20to%20include%20your%20operating%20system%20and%20version,%20and%20please%20be%20as%20specific%20as%20you%20can%20about%20the%20problem%20you%20encountered%3A%0D%0D>`_ or :ref:`contact the developers <authors>`.

source: Docker is an application that makes it very easy to load and run a specific collection of software. It allows us to bundle everything necessary to run Tabbycat into a single package rather than have users install everything needed step-by-step. Once set up, Docker will allow you to start and stop a webserver (that in turn runs Tabbycat) on your computer whenever you want and without the need for internet access.
id_id: Docker adalah aplikasi yang memudahkan untuk memuat dan menjalankan kumpulan perangkat lunak tertentu. Ini memungkinkan kita untuk menggabungkan semua yang diperlukan untuk menjalankan Tabbycat ke dalam satu paket daripada meminta pengguna menginstal semua yang diperlukan selangkah demi selangkah. Setelah diatur, Docker akan memungkinkan Anda untuk memulai dan menghentikan server web (yang menjalankan Tabbycat) di komputer Anda kapan pun Anda mau dan tanpa memerlukan akses internet.

source: 1. Download Tabbycat
id_id: 1. Mengunduh Tabbycat

source: `Go to the page for our latest release <https://github.com/TabbycatDebate/tabbycat/releases/latest>`_.
id_id: Buka halaman untuk rilis terbaru kami <https://github.com/TabbycatDebate/tabbycat/releases/latest>`_.

source: Download the zip or tar.gz file.
id_id: Unduh file zip atau berkas tar.gz.

source: Extract all files in it to a folder of your choice.
id_id: Ekstrak semua berkas ke dalam sebuah folder pilihan anda.

source: 2. Install Docker
id_id: 2. Instal Docker

source: If using macOS or Linux
id_id: Jika Mengunakan macOS atau Linux

source: Install the **Docker Community Edition (stable)** from the `Docker store page <https://store.docker.com/search?type=edition&offering=community>`_.
id_id: Instal **Docker Community Edition (stable)**dari halaman Docker store <https://store.docker.com/search?type=edition&offering=community>`_.

source: If using Windows 10 Pro, Enterprise, or Education Edition
id_id: Jika menggunakan Windows 10 Pro, Enterprose, or Education Edition

source: Install the ****Docker Community Edition (stable)*** from the `Docker store page <https://store.docker.com/search?type=edition&offering=community>`_.
id_id: Instal **** Docker Community Edition (stabil) *** dari halaman penyimpanan `Docker <https://store.docker.com/search?type=edition&offering=community>`_.

source: Before or shortly after installing it, Docker may ask you to enable hypervisor and restart your PC. If it asks you this follow the prompts and restart as asked.
id_id: Sebelum atau segera setelah menginstalnya, Docker mungkin meminta Anda untuk mengaktifkan hypervisor dan melakukan restart pada PC Anda. Jika diminta, ikuti petunjuknya dan mulai ulang seperti yang diminta.

source: Once Docker has finished installing, open up the newly-installed Docker application, then right-click the app's icon (the whale) in the Taskbar.
id_id: Setelah Docker selesai diinstal, buka aplikasi Docker yang baru diinstal, lalu klik kanan ikon aplikasi (bergambar ikan paus) di Taskbar.

source: From there, hit *Settings* in the menu and *Shared Drives* in the sidebar. Tick the checkbox next to your hardrive and then click *Apply*. After that has applied exit and reopen the docker app (ie right-click the taskbar icon and hit exit) and verify that the checkbox is still there.
id_id: Dari sana, tekan *Setting* di menu dan *Shared Drive* di sisi bar. Centang kotak di samping hardrive Anda, lalu klik *Apply*. Setelah itu telah diterapkan keluar dan buka kembali aplikasi Docker (yaitu klik kanan ikon taskbar dan tekan keluar) dan verifikasi bahwa kotak centang masih ada.

source: If using Windows 7, Windows 8, or Windows 10 Home Edition
id_id: Jika menggunakan Windows 7, Windows 8, atau Windows 10 Home Edition

source: Install the **Docker Toolbox** from the `Docker Toolbox downloads page <https://www.docker.com/products/docker-toolbox>`_.
id_id: Instal **Docker Toolbox** dari `halaman unduhan Docker Toolbox <https://www.docker.com/products/docker-toolbox>`_.

source: Not sure which edition of Windows you have? Click Start, search for "System", and open the Control Panel item "System".
id_id: Tidak yakin edisi Windows mana yang Anda miliki? Klik Start, cari "System", dan buka item Panel Kontrol "System".

source: If using the Docker App
id_id: Jika Menggunakan aplikasi Docker

source: *These instructions apply if you installed the Docker App, i.e., if you are using macOS, Linux or Windows Pro/Enterprise/Education.*
id_id: *Instruksi ini berlaku jika Anda menginstal Aplikasi Docker, yaitu jika Anda menggunakan macOS, Linux, atau Windows Pro / Enterprise / Education.*

source: Ensure that Docker application is open (there should be a whale icon in your menu/task bar) and that it says that Docker is running.
id_id: Pastikan bahwa aplikasi Docker terbuka (harus ada ikon ikan paus di menu / bilah tugas Anda) dan dikatakan bahwa Docker sedang berjalan.

source: Browse to the location where you extracted Tabbycat to. Open up the **bin** folder there. Within that folder:
id_id: Jelajahi lokasi tempat Anda mengekstrak Tabbycat. Buka folder **bin** di sana. Di dalam folder itu:

source: If you're on macOS, press the Control key, click the icon for **osx_docker_start.command**, then choose Open from the shortcut menu.
id_id: Jika Anda menggunakan macOS, tekan tombol Ctrl, klik ikon untuk **osx docker start.command**, lalu pilih Buka dari menu pintasan.

source: If you're on Windows, open **windows_docker_start.bat**.
id_id: Jika Anda menggunakan Windows, buka **windows_docker_start.bat**.

source: If you're on Linux, open up a terminal in the Tabbycat folder (*i.e.* the folder containing ``README.md``) and run ``docker-compose up``.
id_id: Jika Anda menggunakan Linux, buka terminal di folder Tabbycat (*yaitu* folder yang berisi ``README.md'') dan jalankan ``docker-compose up''.

source: A terminal window should popup and bunch of text scroll by. If this is your first time running Docker it may take a while (30 minutes or more) to download the virtual machine. When the text has stopped scrolling by you should see a `Finished building Tabbycat!` message.
id_id: Jendela terminal akan muncul dan sekelompok teks bergulir. Jika ini adalah pertama kalinya Anda menjalankan Docker, mungkin perlu beberapa saat (30 menit atau lebih) untuk mengunduh mesin virtual. Ketika teks telah berhenti bergulir, Anda akan melihat pesan ``Finished building Tabbycat!''.

source: Open up http://localhost:8000/ (Windows) or http://0.0.0.0:8000 (OSX/Linux) in a browser of your choice!
id_id: Buka http://localhost:8000/(Windows)atau http://0.0.0.0:8000 (OSX / Linux) di browser pilihan Anda!

source: If you want to reopen Tabbycat at a later time (say after restarting) repeat steps 1 through 4 here.
id_id: Jika Anda ingin membuka kembali Tabbycat di lain waktu (katakanlah setelah memulai ulang) ulangi langkah 1 hingga 4 di sini.

source: If using the Docker Toolbox
id_id: Jika Menggunakan Docker Toolbox

source: *These instructions apply if you installed the Docker Toolbox, i.e., if you are using Windows 7, Windows 8 or Windows 10 Home.*
id_id: *Instruksi ini berlaku jika Anda menginstal Docker Toolbox, yaitu jika Anda menggunakan Windows 7, Windows 8, atau Windows 10 Home.*

source: Start the **Docker Quickstart Terminal**.
id_id: Mulai **Docker Quickstart Terminal**.

source: Run the command ``docker-machine ip``. Take note of the IP address it shows, for example::
id_id: Jalankan pada cmd ``docker-machine ip``, catat alamat IP yang di tunjukan, untuk contoh nya::

source: Open a browser and go to http://192.168.99.100:8000/, replacing "192.168.99.100" with whatever IP address was shown in step 2.
id_id: Buka browser dan buka http://192.168.99.100:8000/, ganti "192.168.99.100" dengan alamat IP apa pun yang ditunjukkan pada langkah 2.

source: Once you're done and want to stop the Tabbycat server, press Ctrl+C, wait until the next prompt appears, and then run ``docker-machine stop``.
id_id: Setelah Anda selesai dan ingin menghentikan server Tabbycat, tekan Ctrl + C, tunggu hingga prompt berikutnya muncul, lalu jalankan `` docker machine stop ''.
