Repository: tara-45/tabby8
Catalog: docs/locale/*/LC_MESSAGES/install/local.po
Languages: id_id

source: Local Installations
id_id: Instalasi Lokal

source: What is a local installation?
id_id: Apa itu instalasi local?

source: Tabbycat is a web-based system: it's designed to run as a web site. However, instead of installing it on a web server, you can install it on your computer, serving web pages to yourself. This is called a local installation.
id_id: Tabbycat adalah sistem berbasis web: ini dirancang untuk dijalankan sebagai situs web. Namun, daripada menginstalnya di server web, Anda dapat menginstalnya di komputer Anda, menyajikan halaman web untuk Anda sendiri. Ini disebut instalasi lokal.

source: Then, when you open your browser, you can use Tabbycat like any other web site. The only difference is that this one is on **your** computer, not some computer in a data centre in a far-away land. In effect, you are getting your computer to behave like a web server.
id_id: Kemudian, saat Anda membuka browser, Anda dapat menggunakan Tabbycat seperti situs web lainnya. Satu-satunya perbedaan adalah bahwa ini ada di **komputer Anda**, bukan komputer di pusat data di tempat yang jauh. Akibatnya, Anda membuat komputer Anda berperilaku seperti server web.

source: Should I use a local installation?
id_id: Haruskah saya menggunakan instalasi lokal?

source: In most cases, you should make an online Tabbycat installation by :ref:`setting up an instance on Heroku <install-heroku>`. This has a number of major advantages:
id_id: Dalam kebanyakan kasus, Anda harus membuat instalasi Tabbycat online dengan :ref:`mengatur sebuah instance di Heroku <install-heroku>`. Ini memiliki sejumlah keuntungan utama:

source: The installation process is easier.
id_id: Proses instalasinya lebih mudah.

source: You can enter ballots and manage your tournament from multiple computers.
id_id: Anda dapat memasukkan balot dan mengelola turnamen Anda dari banyak komputer.

source: Participants can access the draw, motions, results and more online.
id_id: Peserta dapat mengakses undian, gerakan, hasil, dan lainnya secara online.

source: Heroku's data centers are less likely to fail than your computer is.
id_id: Pusat data Heroku kecil kemungkinannya untuk gagal dibandingkan komputer Anda.

source: Heroku e-mails Tabbycat's developers error reports to help us fix bugs.
id_id: Heroku mengirim email laporan kesalahan pengembang Tabbycat untuk membantu kami memperbaiki bug.

source: In some cases, you might have a good reason to use a local installation. We can think of just one such reason: If you won't have access to the internet at your tournament, or if internet access will be flaky, then you should use a local installation.
id_id: Dalam beberapa kasus, Anda mungkin memiliki alasan bagus untuk menggunakan penginstalan lokal. Kami hanya dapat memikirkan satu alasan berikut: Jika Anda tidak memiliki akses ke internet di turnamen, atau jika akses internet tidak stabil, maka Anda harus menggunakan instalasi lokal.

source: You'll need internet access to download dependencies during the local installation process. So if you're not expecting to have reliable internet access at your tournament, be sure to have Tabbycat installed *before* you get there!
id_id: Anda memerlukan akses internet untuk mengunduh dependensi selama proses instalasi lokal. Jadi jika Anda tidak berharap memiliki akses internet yang andal di turnamen Anda, pastikan untuk menginstal Tabbycat *sebelum* Anda sampai di sana!

source: Advanced users
id_id: Pengguna tingkat lanjut

source: Tabbycat is a `Django <https://www.djangoproject.com/>`_ project, so if you have your own preferred method of running Django projects, you can also do that. Just be aware that we haven't tried it.
id_id: Tabbycat adalah proyek `Django <https://www.djangoproject.com/>` _, jadi jika Anda memiliki metode pilihan Anda sendiri untuk menjalankan proyek Django, Anda juga dapat melakukannya. Sadarilah bahwa kami belum mencobanya.

source: Okay, so how do I do it?
id_id: Oke, jadi bagaimana cara melakukannya?

source: The easiest option is to :ref:`install Tabbycat using Docker <install-docker>`. This method should work across all operating systems and is by far the easiest way to get a local copy running.
id_id: Opsi termudah adalah :ref:`menginstal Tabbycat menggunakan Docker <install-docker>`. Metode ini harus bekerja di semua sistem operasi dan sejauh ini merupakan cara termudah untuk menjalankan salinan lokal.

source: If installing using Docker does not work, or if you want to be able to modify Tabbycat's code we also have a number of instructions for manually setting up a copy of Tabbycat. There instructions are here:
id_id: Jika menginstal menggunakan Docker tidak berhasil, atau jika Anda ingin dapat mengubah kode Tabbycat, kami juga memiliki sejumlah instruksi untuk mengatur salinan Tabbycat secara manual. Ada instruksi di sini:

source: Advanced uses
id_id: Pengguna tingkat lanjut

source: Can others access my local install?
id_id: Bisakah orang lain mengakses instalasi lokal saya?

source: Local installations can also take advantage of multiple-computer site access, including data entry---it's just takes more work than a Heroku installation to set up.
id_id: Penginstalan lokal juga dapat memanfaatkan akses situs multi-komputer, termasuk entri data --- hanya perlu lebih banyak pekerjaan daripada penginstalan Heroku untuk menyiapkannya.

source: Since a local installation is just having your computer run a web server, it can serve other computers too. You can make this work even if you don't have internet access: all you need is a router that you can use to connect a few computers together. Then other computers on your local network can access the Tabbycat site hosted on your computer. We did this at Victoria Australs 2012.
id_id: Karena penginstalan lokal hanya membuat komputer Anda menjalankan server web, ia juga dapat melayani komputer lain. Anda dapat membuat ini berfungsi bahkan jika Anda tidak memiliki akses internet: yang Anda butuhkan hanyalah router yang dapat Anda gunakan untuk menghubungkan beberapa komputer secara bersamaan. Kemudian komputer lain di jaringan lokal Anda dapat mengakses situs Tabbycat yang dihosting di komputer Anda. Kami melakukan ini di Victoria Australs 2012.

source: We don't provide detailed instructions for this; we leave it for advanced users to set up themselves. As a rough guide:
id_id: Kami tidak memberikan instruksi rinci untuk ini; kami menyerahkannya kepada pengguna tingkat lanjut untuk menyiapkan sendiri. Sebagai panduan kasar:

source: You need to pass in your computer's IP address and port to the `runserver` command, for example, if your computer (the one acting as a server) is 196.168.0.2 and you want to run it on port 8000: ``dj runserver 192.168.0.2:8000``
id_id: Anda harus memasukkan alamat IP dan port komputer Anda ke perintah `runserver`, misalnya, jika komputer Anda (yang bertindak sebagai server) adalah 196.168.0.2 dan Anda ingin menjalankannya di port 8000: ``dj runserver 192.168.0.2:8000''

source: You need to configure your firewall settings to allow incoming connections on the IP address and port you specified in that command.
id_id: Anda perlu mengkonfigurasi pengaturan firewall Anda untuk mengizinkan koneksi masuk pada alamat IP dan port yang Anda tentukan dalam perintah itu.

source: Be aware that local installs use the Django development server, whose **security is not tested**. Therefore, it's a good idea to make sure your firewall **only lets in computers on your local network** (or, if you're really paranoid, isolate the network from the internet completely).
id_id: Ketahuilah bahwa pemasangan lokal menggunakan server pengembangan Django, yang ** keamanannya belum diuji **. Oleh karena itu, sebaiknya pastikan firewall **hanya mengizinkan masuk komputer di jaringan lokal Anda** (atau, jika Anda benar-benar paranoid, isolasi jaringan dari internet sepenuhnya).

source: Can I run an internet-accessible website from a local installation?
id_id: Dapatkah saya menjalankan situs web yang dapat diakses internet dari instalasi lokal?

source: Probably not. Even if you disable your firewall, chances are your home router (or university router) will block any connections from the outside world to you. Even if you can though, **you really shouldn't**. The local installation uses the *Django development server*, which is a lightweight server designed for developers. Specifically, Django **does not test the security of its development server** in the way that proper web servers do. That is: It's a security risk to run a local installation as an internet-accessible site. Don't do it. `Install Tabbycat on Heroku <install-heroku>`_ instead.
id_id: Mungkin tidak. Meskipun Anda menonaktifkan firewall, kemungkinan besar router rumah (atau router universitas) akan memblokir koneksi apa pun dari dunia luar ke Anda. Meskipun Anda bisa, **Anda seharusnya tidak**. Instalasi lokal menggunakan *server pengembangan Django*, yang merupakan server ringan yang dirancang untuk pengembang. Secara khusus, Django **tidak menguji keamanan server pengembangannya** dengan cara yang dilakukan server web yang tepat. Yaitu: Merupakan risiko keamanan untuk menjalankan instalasi lokal sebagai situs yang dapat diakses internet. Jangan lakukan itu. `Instal Tabbycat di Heroku <install-heroku>` _ sebagai gantinya.

source: Alternatively, if you have a background in web development, you might choose to install Tabbycat on your own production server. It's a Django project, so any means of supporting Django projects should work fine.
id_id: Atau, jika Anda memiliki latar belakang pengembangan web, Anda dapat memilih untuk menginstal Tabbycat di server produksi Anda sendiri. Ini adalah proyek Django, jadi segala cara untuk mendukung proyek Django akan bekerja dengan baik.

source: It's safe to run on a small, isolated network (see above) with your firewall correctly configured because you presumably trust everyone you let on the network!
id_id: Aman untuk dijalankan di jaringan kecil yang terisolasi (lihat di atas) dengan firewall Anda dikonfigurasi dengan benar karena Anda mungkin mempercayai semua orang yang Anda biarkan di jaringan!
