Repository: tara-45/tabby8
Catalog: tabbycat/printing/locale/*/LC_MESSAGES/django.po
Languages: tr

source: Feedback Forms
tr: Geri Bildirim Formları

source: Printable Feedback Forms for %(round)s
tr: %(round)s için yazdırılabilir geri bildirim formları

source: No feedback questions have been added for either teams or adjudicators to answer.
tr: Ne takımların ne de jürilerin yanıtlaması için herhangi bir geri bildirim sorusu eklenmemiştir.

source: No feedback questions have been added for teams to answer.
tr: Takımların yanıtlaması için herhangi bir geri bildirim sorusu eklenmemiştir.

source: No feedback questions have been added for adjudicators to answer.
tr: Jürilerin yanıtlaması için herhangi bir geri bildirim sorusu eklenmemiştir.

source: %(first_sentence)s Check the <a href="https://tabbycat.readthedocs.io/en/stable/features/adjudicator-feedback.html" target="_blank">documentation</a> for information on how to add these (otherwise these forms will be quite bare).
tr: %(first_sentence)s Bunların nasıl ekleneceği hakkında bilgi için <a href="https://tabbycat.readthedocs.io/en/stable/features/adjudicator-feedback.html" target="_blank">belgeleri</a> kontrol edin (aksi takdirde bu formlar oldukça boş kalır).

source: There are no feedback sheets available — perhaps adjudicators have not been allocated?
tr: Geri bildirim sayfası yok - belki de jüriler tahsis edilmedi?

source: Use Ctrl+P for printing or saving to PDF. Be sure to set the appropriate <strong>page orientation</strong>, to turn off <strong>headers/footers</strong> and turn on <strong>background graphics</strong>. Works best in Chrome.
tr: PDF'ye yazdırmak veya kaydetmek için Ctrl+P tuşlarını kullanın. <strong>üstbilgiler/altbilgiler'i</strong> kapatmak ve <strong>arka plan grafikleri'ni</strong> açmak için uygun <strong>sayfa yönü</strong> ayarladığınızdan emin olun. En iyi Chrome'da çalışır.

source: Printable %(sheet)s URLs
tr: Yazdırılabilir %(sheet)s URL'leri

source: This page is designed to be printed as double-sided A4 sheets, with the outside facing side showing the participant name and the inside facing side showing the URL. Use CTRL-P to print; for best results use Chrome.
tr: Bu sayfa, dışa bakan tarafı katılımcı adını, iç tarafı URL'yi gösterecek şekilde çift taraflı A4 sayfaları olarak yazdırılacak şekilde tasarlanmıştır. Yazdırmak için CTRL-P tuşlarını kullanın; en iyi sonuçlar için Chrome'u kullanın.

source: Private URL for %(name)s (%(group)s)
tr: %(name)s (%(group)s) için özel URL

source: Please bookmark the following URL, you will use it to submit forms throughout the tournament:
tr: Lütfen aşağıdaki URL'yi yer imlerine ekleyin, turnuva boyunca form göndermek için kullanacaksınız:

source: Printable Scoresheets
tr: Yazdırılabilir Sonuç Kağıtları

source: for %(round)s
tr: %(round)s için

source: Edit Motion(s)
tr: Önergeleri Düzenle

source: There are no scoresheets available — perhaps the round has not been drawn?
tr: Mevcut sonuç kağıdı yok - belki de kura çekilmedi?

source: Edit Ballot Motions
tr: Ballot Önergelerini Düzenle

source: Editing motions here will not save them permanently — it will only update the text used in the printed ballots below. This can be useful if using placeholder motions (to ensure confidentiality) in Tabbycat, but you still want to print ballots with correct motions.
tr: Burada önergeleri düzenlemek onları kalıcı olarak kaydetmez - yalnızca aşağıdaki basılı ballotlarda kullanılan metni günceller. Bu, Tabbycat'te yer tutucu önergeler (gizliliği sağlamak için) kullanıyorsanız, ancak yine de doğru önergelerle ballotları yazdırmak istiyorsanız yararlı olabilir.

source: Motion
tr: Önerge

source: Changes to motions will update in the displayed ballots automatically
tr: Önergelerdeki değişiklikler, görüntülenen ballotlarda otomatik olarak güncellenecektir

source: Speeches are x minutes, the speaker score range is from x to x. You have x minutes to form an adjudication.
tr: Konuşmalar x dakikadır, konuşmacı puan aralığı x'ten x'e kadardır. Bir karar oluşturmak için x dakikanız var.

source: Overall Score
tr: Genel Skor

source: Unaffiliated
tr: Bağımsız

source: Team
tr: Takım
