Repository: tara-45/tabby8
Catalog: docs/locale/*/LC_MESSAGES/about/authors.po
Languages: id_id

source: Authors & Acknowledgements
id_id: Penulis dan Ucapan Terimakasih

source: Authors
id_id: Penulis

source: Tabbycat was authored by Qi-Shan Lim for Auckland Australs 2010. The current active maintainers are:
id_id: Tabbycat awalnya dibuat oleh Qi-Shan Lim untuk Auckland Australs 2010. Pengelola aktif pada saat ini adalah:

source: Please don't hesitate to contact us with any suggestions, expressions of interest or generally anything relating to Tabbycat.
id_id: Harap jangan sungkan untuk menghubungi kami untuk memberitahukan saran, mengungkapkan ketertarikan atau apapun yang berhubungan dengan Tabbycat.

source: Contributors
id_id: Kontributor

source: Étienne Beaulé has contributed many features, fixes, and suggestions across many aspects of Tabbycat.
id_id: Étienne Beaulé sudah memberikan kontribusi banyak fitur, perbaikan, dan saran dalam banyak hal untuk Tabbycat.

source: Thevesh Theva contributed the algorithm for calculating the liveness of teams within a particular break category.
id_id: Thevesh Theva berkontribusi dalam pembuatan algoritma untuk menghitung keaktifan tim dalam kategori istirahat tertentu.

source: Viran Weerasekera contributed the statistical tests used to estimate the degree to which a motion's results and vetoes are balanced.
id_id: Viran Weerasekera berkontribusi dalam pembuatan tes statistik yang digunakan untuk mengestimasi setiap arah pergerakan hasil mosi dan veto agar seimbang.

source: Viran Weerasekera, Valerie Tierney, Molly Dale, Madeline Schultz, and Vail Bromberger contributed to the "Tournament Logistics" section of our documentation.
id_id: Viran Weerasekera, Valerie Tierney, Molly Dale, Madeline Schultz, dan Vail Bromberger sudah berkontribusi pada bagian "Logistik Turnamen" pada dokumentasi kami.

source: Sponsors
id_id: Sponsor

source: Thanks to the Western Australian Debating League for sponsoring various features related to organising division-based tournaments and round-robin based draw methods.
id_id: Terimakasih kami tujukan kepada Western Australian Debating League yang telah mensponsori berbagai fitur yang terkait dengan penyelenggaraan turnamen berbasis divisi dan metode undian berbasis round-robin.
