Repository: tara-45/tabby8
Catalog: tabbycat/venues/locale/*/LC_MESSAGES/django.po
Languages: ar, fr, tr

source: Rooms
ar: قاعات المناظرة
fr: Salles
tr: Odalar

source: Draw is already released, unrelease draw to assign rooms.
fr: Le tirage est déjà publié, retire-le pour attribuer les salles.
tr: Kura zaten yayınlandı, odaları atamak için kurayı yayından kaldırın.

source: Draw is not confirmed, confirm draw to assign rooms.
fr: Le tirage n'est pas confirmé, confirme-le pour attribuer les salles.
tr: Kura onaylanmadı, oda atamak için kurayı onaylayın.

source: Successfully auto-allocated rooms to debates.
fr: Les salles ont été attribués automatiquement aux débats avec succès.
tr: Maçlara odalar başarıyla otomatik tahsis edidi.

source: name
ar: الاسم
fr: nom
tr: isim

source: priority
ar: الأولوية
fr: priorité
tr: öncelik

source: Rooms with a higher priority number will be preferred when allocating rooms to debates
ar: ستفضل أرقام القاعات التي لها أولوية أعلى عند تخصيص مكان التناظر
fr: Les salles ayant un nombre plus élevé de priorité seront privilégiées lors de l’attribution de salles de débats
tr: Tartışmalara oda tahsis edilirken öncelik numarası daha yüksek olan odalar tercih edilecektir

source: tournament
ar: البطولة
fr: tournoi
tr: turnuva

source: A URL that contains extra information about this room, e.g. a map or a meeting link (for online tournaments)
fr: Un URL qui donne plus d'information sur la salle, comme une carte ou lien de rencontre (pour tournois en ligne)
tr: Bu oda hakkında ek bilgi içeren bir URL, ör. harita veya toplantı bağlantısı (çevrimiçi turnuvalar için)

source: room
ar: قاعة
fr: salle
tr: oda

source: rooms
ar: قاعات المناظرة
fr: salles
tr: odalar

source: Don't display in room name
fr: Ne pas afficher dans le nom de la salle
tr: Oda adında gösterme

source: Display as prefix
ar: العرض كبادئة
fr: Afficher sous forme de préfixe
tr: Önek olarak görüntüle

source: Display as suffix
ar: العرض كبادئة
fr: Afficher sous forme de suffixe
tr: Son ek olarak görüntüle

source: Name of category, e.g., "Purple", "Step-free access", "Close to tab room". This name is shown when the category is prefixed or suffixed to a room name in the draw, e.g., "Purple – G05".
ar: اسم الفئة، على سبيل المثال، "أرجواني"، "وصول مجاني"، "قريب من غرفة الإدخال". يظهر هذا الاسم عندما تكون الفئة مسبوقة أو ملحقة باسم المكان في القرعة، على سبيل المثال، "أرجواني - G05".
fr: Nom de la catégorie, par exemple, « Violet », « sans marches », « près de la salle de tab ». Ce nom est affiché lorsque la catégorie est le préfixe ou suffixe d’un nom de salle dans le tirage, par exemple, « Violet – G05 ».
tr: Kategorinin adı, örneğin, "Mor", "Adımsız erişim", "Sekme odasına yakın". Bu ad, kategori kuradaki bir oda adının önüne veya sonekine eklendiğinde gösterilir, örneğin, "Mor – G05".

source: description
ar: الوصف
tr: açıklama

source: Description, as the predicate of a sentence, e.g. "has step-free access", "is close to the briefing hall". This description follows "This room" when shown in tooltips, e.g., "This room is close to the briefing hall.".
ar: الوصف، كمسند جملة، على سبيل المثال. "لديه حرية الوصول"، "على مقربة من قاعة المؤتمرات". هذا الوصف يتبع "هذا المكان" عندما يظهر في تلميحات الأدوات ، على سبيل المثال، "هذا المكان قريب من قاعة المؤتمرات".
fr: Description, comme le prédicat d’une phrase, par exemple « a accès sans étape », « est à proximité de la salle de réunion d’information ». Cette description fait suite à « Cette salle » lorsque affiché dans les info-bulles, par exemple, « cette salle est à proximité de la salle de réunion d’information. ».
tr: Bir cümlenin yüklemi olarak açıklama, örneğin "adımsız erişime sahip", "brifing salonuna yakın". Bu açıklama, araç ipuçlarında gösterildiğinde "Bu oda"yı izler, örneğin, "Bu oda brifing salonuna yakındır."

source: display in room name
fr: afficher dans le nom de la salle
tr: oda adında görüntüle

source: Prefix: "Purple – G05", Suffix: "G05 – Purple"
fr: Préfixe : « Violet – G05 », suffixe : « G05 – Violet »
tr: Önek: "Mor – G05", Son Ek: "G05 – Mor"

source: display in public tooltip
ar: تلميح عام
fr: afficher dans l’info-bulle public
tr: genel araç ipucunda görüntüle

source: Displays the description in the tooltip for the room on public pages. The description, if not blank, will always show on admin pages.
ar: يعرض الوصف في تلميح الأدوات للمكان على الصفحات العامة. سيظهر الوصف، إن لم يكن فارغا، دائما على صفحات المشرف.
fr: Montre la description dans l’info-bulle décrivant la salle sur les pages publiques. La description, si non vide, s'affiche toujours sur les pages administratives.
tr: Genel sayfalarda odanın araç ipucundaki açıklamayı görüntüler. Açıklama, boş değilse, her zaman yönetici sayfalarında gösterilir.

source: room category
ar: فئة المكان
fr: catégorie de salle
tr: oda kategorisi

source: room categories
ar: فئات المكان
fr: catégories de salle
tr: oda kategorileri

source: category
ar: الفئة
fr: catégorie
tr: kategori

source: subject content type
ar: نوع محتوى الموضوع
fr: type de contenu du sujet
tr: konu içerik türü

source: subject ID
ar: معرف الموضوع
fr: identifiant de sujet
tr: konu kimliği

source: room constraint
ar: القاعة المقيدة
fr: contrainte de salle
tr: oda kısıtlaması

source: room constraints
ar: القاعات المقيدة
fr: contraintes de salle
tr: oda kısıtlamaları

source: Room Categories
ar: فئات المكان
fr: Catégories de salle
tr: oda kategorileri

source: Room categories allow you to group rooms together into "zones" to display in the draw and make navigation easier for participants, and/or specify constraints on room allocation that require teams, adjudicators or institutions to be put in a room in a particular category.
ar: تسمح لك فئات القاعات بتجميع الأماكن معا في "مناطق" لعرضها في السحب وجعل التنقل أسهل للمشاركين و / أو تحديد القيود المفروضة على تخصيص المكان التي تتطلب فرقا أو محكمين أو مؤسسات يتم وضعها في مكان في فئة معينة.
fr: En utilisant les catégories de salles, vous pouvez grouper les salles dans les « zones » pour les afficher dans le tirage et pour rendre la navigation plus facile pour les participants, et/ou spécifier les contraintes sur l'attribution des salles, pour que les équipes, juges ou institutions doivent être attribué une salle qui est dans une catégorie particulière.
tr: Oda kategorileri, kurada görüntülemek ve katılımcılar için gezinmeyi kolaylaştırmak için odaları birlikte "bölgeler" halinde gruplandırmanıza ve/veya takımların, jürilerin veya kurumların belirli bir kategorideki bir odaya yerleştirilmesini gerektiren oda tahsisi kısıtlamalarını belirtmenize olanak tanır.

source: If you want to delete room categories, use the <a href="%(edit_db_url)s" class="alert-link">Edit Database</a> area.
ar: اذا كنت تريد حذف القاعة ، <a href="%(edit_db_url)s" class="alert-link">تعديل قاعدة البيانات </a>المنطقة
fr: Si vous souhaitez supprimer des catégories de salles, utilisez la zone pour <a href="%(edit_db_url)s" class="alert-link">modifier la base de données</a>.
tr: Oda kategorilerini silmek istiyorsanız, <a href="%(edit_db_url)s" class="alert-link">veritabanı düzenle</a> alanını kullanın.

source: Save Room Categories
ar: حفظ فئات القاعات
fr: Enregistrer les catégories de salles
tr: Oda Kategorilerini Kaydet

source: Room Constraints
ar: القاعات المقيدة
fr: Contraintes de salle
tr: oda kısıtlamaları

source: Room constraints tell the room allocator to try to keep the specified team or adjudicator, or all teams (but not adjudicators) from the specified institution, in a room in the given category. The "priority" field resolves conflicting constraints: the higher priority takes precedence. You can also use the priority field to specify "lower-preference" constraints, which are taken if a higher-priority constraint couldn't be met.
ar: تفرض قيود المكان على مقدم المكان محاولة إبقاء الفريق أو المحكم المحدد، أو جميع الفرق (ليس المحكمين) من المؤسسة المحددة، في مكان في الفئة المعينة. يحل مجال "الأولوية" القيود المتعارضة: الأولوية العليا لها الأسبقية. يمكنك أيضا استخدام حقل الأولوية لتحديد قيود "التفضيل الأقل"، والتي يتم اتخاذها إذا كان لا يمكن تلبية قيود ذات أولوية أعلى.
fr: En spécifier des contraintes de salle, vous pouvez demander à l'allocateur des salles d'essayer de mettre l'équipe indiquée ou le juge indiqué, ou tous les équipes (mais pas les juges) de l'institution indiquée, dans une salle de la catégorie indiquée. Le champ « priorité » résout les contraintes contradictoires : le nombre plus élevé a la priorité. Vous pouvez aussi utiliser le champ de priorité pour spécifier des contraintes « d'ordre inférieur », qui sont prises si aucune contrainte de priorité plus élevé ne pouvais été satisfaite.
tr: Oda kısıtlamaları, oda tahsis edene, belirtilen takımı veya jüriyi veya belirtilen kurumdaki tüm takımları (ancak jürileri değil) verilen kategorideki bir odada tutmaya çalışmasını söyler. "Öncelik" alanı çakışan conflictleri çözer: daha yüksek öncelik önceliklidir. Öncelik alanını, daha yüksek öncelikli bir kısıtlama karşılanamadığında alınan "düşük tercihli" kısıtlamaları belirtmek için de kullanabilirsiniz.

source: Save Room Constraints
ar: حفظ القاعة المقيدة
fr: Enregistrer les contraintes de salle
tr: Oda Kısıtlamalarını Kaydet

source: Room constraint of %(name)s met (%(category)s)
fr: Contrainte de salle de %(name)s est satisfaite (%(category)s)
tr: %(name)s'nin oda kısıtlaması karşılandı. (%(category)s)

source: Room does not meet any constraint of %(name)s
fr: Cette salle ne satisfait aucune contrainte de %(name)s
tr: Oda %(name)s'nın herhangi bir kısıtlamasını karşılamıyor

source: Room constraint of %(team)s met (%(category)s, via institution %(institution)s)
fr: Contrainte de salle de %(team)s est satisfaite (%(category)s, via institution %(institution)s)
tr: %(team)s'nin oda kısıtlaması karşılandı. (%(institution)s kurumunundan %(category)s)

source: Room does not meet any constraint of institution %(institution)s (%(team)s)
fr: Cette salle ne satisfait aucune contrainte de l'institution %(institution)s (%(team)s)
tr: Oda %(institution)s kurumunun herhangi bir kısıtlamasını karşılamıyor. (%(team)s)

source: Edit Rooms
fr: Modifier Salles
tr: Odaları Düzenle

source: Saved room category: %(list)s
fr: Sauvegardé catégorie de salle : %(list)s
tr: Oda kategorisi kaydedildi: %(list)s

source: No changes were made to the room categories.
ar: لا يتم إجراء تغييرات على فئات القاعات
fr: Aucune catégorie de salle a été modifiée.
tr: Oda kategorilerinde herhangi bir değişiklik yapılmamıştır.

source: %s (Adjudicator)
fr: %s (Juge)
tr: %s (Jüri)

source: %s (Team)
fr: %s (Équipe)
tr: %s (Takım)

source: %s (Institution)
tr: %s (Kurum)

source: Saved %(count)d room constraint.
fr: %(count)d contrainte de salle a été enregistrée.
tr: %(count)d oda kısıtlaması kaydedildi.
