Repository: tara-45/tabby8
Catalog: docs/locale/*/LC_MESSAGES/use/finishing-a-tournament.po
Languages: bn_bd

source: Finishing a Tournament
bn_bd: একটি টুর্নামেন্ট সমাপ্তি

source: This page outlines some final steps to take after the conclusion of outrounds.
bn_bd: এই পৃষ্ঠাটি আউটগ্রাউন্ডের সমাপ্তির পরে নেওয়া কিছু চূড়ান্ত পদক্ষেপের রূপরেখা দেয়।

source: Tab Release
bn_bd: ট্যাব রিলিজ

source: Tabs can be released using the *Tab released* option under **Setup** > **Configuration**. Tabbycat offers the following system tabs:
bn_bd: **সেটআপ** > **কনফিগারেশন** এর অধীনে *ট্যাব রিলিজ* বিকল্প ব্যবহার করে ট্যাবগুলি প্রকাশ করা যেতে পারে। Tabbycat নিম্নলিখিত সিস্টেম ট্যাব অফার করে:

source: Team Tab
bn_bd: দলসমূহ

source: Speakers Tab
bn_bd: স্পিকার ট্যাব

source: Replies Tab
bn_bd: যুক্তি খন্ডন ট্যাব

source: Motions Tab
bn_bd: প্রস্তাব ট্যাব

source: You can configure the team, speakers and replies tab to display only a certain number of speakers, *e.g.*, to show only a "Top 10 Speakers" tab.
bn_bd: আপনি শুধুমাত্র একটি নির্দিষ্ট সংখ্যক স্পিকার প্রদর্শন করতে দল, স্পিকার এবং উত্তর ট্যাব কনফিগার করতে পারেন, *যেমন*, শুধুমাত্র একটি "শীর্ষ 10টি স্পিকার" ট্যাব দেখাতে।.

source: If you defined any speaker categories (for example, Novice, ESL or EFL), a tab for each category marked "public" can also be released using the **Release speaker category tabs to public**. You can similarly limit each of these tabs to display just the top few speakers, in the definition of the speaker categories. The speaker categories not marked public are *not* released by this option.
bn_bd: আপনি যদি কোনো স্পিকারের বিভাগ সংজ্ঞায়িত করেন (উদাহরণস্বরূপ, Novice, ESL বা EFL), "সর্বজনীন" চিহ্নিত প্রতিটি বিভাগের জন্য একটি ট্যাবও **জনসাধারণের জন্য স্পীকার বিভাগ ট্যাব প্রকাশ করুন** ব্যবহার করে প্রকাশ করা যেতে পারে। আপনি একইভাবে স্পিকার বিভাগের সংজ্ঞায় শুধুমাত্র শীর্ষ কয়েকটি স্পিকার প্রদর্শন করতে এই ট্যাবগুলির প্রতিটিকে সীমাবদ্ধ করতে পারেন। স্পীকার বিভাগগুলিকে সর্বজনীন হিসাবে চিহ্নিত করা হয়নি এই বিকল্প দ্বারা *নট* প্রকাশিত হয়।.

source: Wrapping Up
bn_bd: মোড়ক উম্মচন

source: You probably want to turn off the *Public ballots*, *Public feedback*, *Feedback progress*, and *Public draw* features under **Configuration** at this stage as they no longer have any use.
bn_bd: আপনি সম্ভবত এই পর্যায়ে **কনফিগারেশন** এর অধীনে *পাবলিক ব্যালট*, *পাবলিক ফিডব্যাক*, *ফিডব্যাক প্রগতি*, এবং *পাবলিক ড্র* বৈশিষ্ট্যগুলি বন্ধ করতে চান কারণ সেগুলির আর কোনও ব্যবহার নেই৷.
