Repository: tara-45/tabby8
Catalog: docs/locale/*/LC_MESSAGES/guide/comparisons.po
Languages: id_id

source: **Adjudicator allocation algorithm**. Both Tabbie2 and Tabbycat use an algorithm to recommend an initial allocation of adjudicators to debates. In principle, they both work by assigning "costs" to allocations, and trying to find the minimum-cost assignment. Some notable differences:
id_id: **Algoritma alokasi juri**. Tabbie2 dan Tabbycat sama-sama menggunakan sebuah algoritma untuk merekomendasikan alokasi awal dari juri untuk debat. Pada dasarnya, mereka sama-sama dengan menetapkan "biaya" untuk alokasi, dan mencoba untuk mencari penugasan biaya-terkecil. Beberapa perbedaan penting:

source: Tabbie2 uses simulated annealing, which is not guaranteed to be optimal and technically needs to be tuned to be effective (which you're probably not doing). Tabbycat uses the Hungarian algorithm, which guarantees an optimal solution.
id_id: Tabbie2 memakai simulasi proses anil, yang tidak menjamin jadi optimal dan secara teknis perlu disetel jadi efektif (yang mungkin anda tidak lakukan). Tabbycat memakai algoritma hungarian yang menjamin solusi optimal.

source: On the other hand, the Hungarian algorithm can't account for relationships between adjudicators on a panel, so adjudicator-adjudicator conflicts aren't considered by Tabbycat's algorithm (though they are highlighted in the interface).
id_id: Di sisi lain, algoritma Hungarian tidak bisa menjelaskan hubungan antar juri pada panel, jadi konflik juri-juri tidak dipertimbangkan dengan algoritma Tabbycat (walau mereka disoroti di antarmuka).

source: Tabbycat's cost function is simpler and more naive. On the other hand, Tabbie2's is more complicated and can be rather opaque (even if you read its source code).
id_id: Biaya fungsi Tabbycat lebih sederhana dan lebih naif. Di sisi lain, Tabbie2 lebih rumit dan bisa agak buram (walaupun anda melihat kode asalnya).

source: Tabbie2 allows for single-gender panels to be charged an additional cost. Tabbycat's algorithm doesn't, but the interface does provide a way to easily check for this visually.
id_id: Tabbie2 memungkinkan untuk panel jenis kelamin-tunggal untuk dibebankan biaya tambahan. Algoritma Tabbycat tidak, tapi antarmukanya menyediakan cara untuk mengecek ini secara visual dengan mudah.

source: Tabbie2 automatically calculates the importance of a room based on its bracket (team points). In Tabbycat, debate importance can be assigned for all debates automatically based on on a room's bracket or the quantity of live break categories inside it. Instead of — or subsequent to — automatic classification any importance value can be manually tweaked as desired. These options mean there is a greater flexibility in determining which debates the allocation algorithm should prioritise.
id_id: Tabbie2 secara otomatis mengalkulasi kepentingan dari sebuah ruang berdasarkan bracket nya (poin tim). Di Tabbycat, kepentingan debat bisa ditetapkan untuk semua debat secara otomatis berdasarkan pada bracket ruang atau kuantitas dari kategori break berlangsung di dalamnya. Sebagai gantinya - atau setelahnya - klasifikasi otomatis nilai kepentingan lainnya bisa disetel secara manual sesuka hati. Pilihan-pilihan ini berarti ada fleksibilitas yang lebih besar dalam menentukan debat mana yang harus diprioritaskan algoritma alokasinya.

source: **Adjudicator allocation interface**. While both interfaces use drag and drop interactions, and allow for color highlights to help identify adjudicators by gender, region, and feedback rating, Tabbycat's allocation interface was designed to be usable on both small screens and projectors, and has a number of extra features that can help inform allocations. These features include:
id_id: **Antarmuka alokasi juri**. Selama kedua antarmuka menggunakan interaksi seret dan lepas, dan memungkinkan sorotan warna membantu mengenali juri dari jenis kelamin, wilayah, dan rating umpan balik, antarmuka alokasi Tabbycat didesain agar dapat digunakan pada layar kecil dan juga proyektor, dan mempunyai beberapa fitur tambahan yang dapat membantu memberitahukan alokasi. Fitur tersebut berupa:

source: Clashes are shown directly in the interface when they apply, but dragging an adjudicator will also show you the potential conflicts that would occur if they were relocated in a new panel. This can make it much easier to avoid creating new clashes when shifting adjudicators around the draw.
id_id: Bentrokan diperlihatkan secara langsung di antarmuka saat mereka diterapkan, tapi menyeret sebuah juri juga akan menunjukkan anda potensi konflik yang mungkin terjadi bila mereka direlokasi di panel baru. Ini bisa membuat menghindari pembuatan bentrokan jadi lebih mudah saat menggeser juri sekitar pengundian.

source: An inline display of an estimate of whether a team is 'live' for each of their break categories — i.e. whether they are 'safe' (have enough points to break); 'dead' (cannot gain enough points to break); or 'live' (still in contention).
id_id: Sebuah tampilan sebaris dari sebuah estimasi dari apakah sebuah tim 'hidup' untuk tiap kategori break mereka - misalkan apakah mereka 'aman' (punya poin cukup untuk break); 'mati' (tidak bisa mendapatkan poin cukup untuk break); atau 'hidup' (masih dalam anggapan).

source: 'History' conflicts (where an adjudicator has seen a team before, or previously was on a panel with another judge) are displayed so they can be avoided.
id_id: 'Riwayat' konflik (dimana sebuah juri telah melihat tim sebelumnya, atau sebelumnya sedang di panel dengan juri lain) ditampilkan agar mereka bisa dihindari.

source: Each adjudicator is present as occupying a particular position (chair, panellist, trainee) rather than having those positions calculated automatically.
id_id: Tiap juri tersedia sebagai menempati posisi tertentu (ketua, panelis, trainee) daripada hanya punya posisi itu terhitung secara otomatis.

source: Chairs can be 'swapped' by dragging adjudicators on top of each other, and an 'unallocated' area can be used to view and store adjudicators that have not been allocated.
id_id: Ketua dapat 'menukarkan' dengan menyeret juri di atas satu sama lain, dan area 'tidak teralokasikan' bisa dipakai untuk melihat dan menyimpan juri yang belum dialokasikan.

source: **Adjudicator feedback customisation**. Both Tabbie2 and Tabbycat have built-in adjudicator feedback forms, and allow you to specify the questions on the feedback form. Notable differences:
id_id: **Kustomasi umpan balik juri**. Tabbie2 dan Tabbycat sama-sama punya formulir umpan balik juri bawaan, dan memungkinkan anda untuk menentukan pertanyaan pada formulir umpan balik. Perbedaan penting:

source: Setting up questions is painless on neither system. Tabbycat requires you to use the Edit Database area; Tabbie2 makes you click through a slightly more opaque maze of pages and forms.
id_id: Memasang pertanyaan ialah mudah untuk tidak kedua system. Tabbycat butuh anda untuk menggunakan area Edit Basisdata; Tabbie2 membuat anda mengeklik melewati lebih banyak labirin halaman dan formulir yang buram.

source: Tabbycat allows for a richer range of types of questions than Tabbie2 does.
id_id: Tabbycat memungkinkan jarak tipe pertanyaan yang lebih kaya dari Tabbie2.

source: Tabbie2 allows you to specify different questionnaires for team-on-chair, chair-on-panellist and panellist-on-chair. Tabbycat only differentiates between team-on-adjudicator and adjudicator-on-adjudicator.
id_id: Tabbie2 memungkinkan anda untuk menentukan kuesioner berbeda untuk tim-pada-ketua, ketua-pada-panelis dan panelis-pada-ketua. Tabbycat hanya membedakan antar tim-pada-juri dan juri-pada-juri.

source: Tabbycat gives you more control over who is expected to submit feedback on whom; e.g. whether teams submit on panellists, and whether panellists submit on each other. In Tabbie2, you can effect this with blank questionnaires, but only for the three options listed above.
id_id: Tabbycat memberi anda lebih banyak kontrol terhadap siapa yang terduga untuk menyerahkan umpan balik pada siapa; misalkan apakah tim menyampaikan pada panelis, dan apakah panel menyampaikan pada satu sama lain. Di Tabbie2, anda bisa mempengaruhi ini dengan kuesioner kosong, tapi hanya untuk tiga pilihan yang terdaftar diatas.

source: Tabbycat can, optionally, automatically incorporate feedback into adjudicator scores using a naive weighted average with the adjudicator base score. This can be disabled by simply setting feedback weight to zero, as some adjudication cores prefer. Tabbie2 has no ability to automatically incorporate feedback.
id_id: Tabbycat bisa, dengan opsional, menggabungkan umpan balik dengan nilai juri secara otomatis menggunakan rata-rata tertimbang naif dengan nilai dasar juri. Ini bisa dimatikan dengan mengatur berat umpan balik ke nol, sesuai dengan yang diinginkan beberapa juri inti. Tabbie2 tidak memiliki kemampuan untuk menggabungkan umpan balik secara otomatis.

source: Tabbycat produces a "shame list" of unsubmitted feedback, which you can optionally publish on the public-facing site to try to incentivise submission.
id_id: Tabbycat membuat "daftar malu" dari umpan balik yang tidak terkirim, yang anda bisa terbitkan secara opsional pada halaman yang dilihat publik untuk mencoba mendorong penyerahan.

source: (How participants access adjudicator feedback submission is discussed in *User identification* above.)
id_id: (Bagaimana peserta mengakses masukan umpan balik juri didiskusikan pada identificasi Pengguna diatas.)

source: Other considerations
id_id: Pertimbangan lainnya

source: **Offline availability**. If you like, you can also install Tabbycat on your own computer, rather than host it as website on a server. This means that you can use it offline. However installing Tabbycat in this manner will require the (at least brief) use of a command line interface.
id_id: **Ketersediaan Luring**. Bila anda mau, anda dapat juga menginstall Tabbycat di komputer sendiri, dibandingkan mengehost situs web pada sebuah server. Ini berarti anda dapat menggunakannya di luar jaringan. Akan tetapi menginstall Tabbycat dengan cara ini akan membutuhkan (pada saat terakhir) penggunaan antarmuka command line.

source: **Cost**. Tabbie2 is free to use. Tabbycat is free to use for not-for-profit, not-for-fundraising tournaments; tournaments for profit or fundraising must make a donation of A$1 per team. In addition, larger tournaments that run on Tabbycat's recommended web host (Heroku) may need to purchase an upgraded database service (the free tier has storage limits) which will cost around ~US$3 to use for the duration of a week-long tournament.
id_id: **Biaya**. Tabbie2 gratis digunakan. Tabbycat gratis digunakan untuk turnamen nirlaba, turnamen bukan-penanggalangan-dana; turnamen untuk profit atau penanggalangan-dana mesti membuat donasi sebanyak A$1 per tim. Sebagai tambahan, turnamen yang lebih besar yang dijalankan di situs host rekomendasi Tabbycat (Heroku) mungkin perlu membeli layanan basisdata yang telah ditingkatkan (tingkat gratis punya batas penyimpanan) yang mungkin sekitar ~US$3 untuk digunakan selama durasi turnamen seminggu.

source: **Documentation**. Tabbycat has `relatively extensive documentation <http://tabbycat.readthedocs.io/en/stable/>`_ that can be useful for learning how to use a particular feature or understanding what is happening at a technical level.
id_id: **Dokumentasi**. Tabbycat punya `dokumentasi yang relatif luas <http://tabbycat.readthedocs.io/en/stable/>`_ yang bisa berguna untuk belajar bagaimana cara sebuah fitur tertentu atau untuk memahami apa yang terjadi di tingkat teknis.

source: **Hosting location**. Tabbycat recommends using Heroku, an established cloud platform service for deploying web applications. Heroku is in turn hosted on Amazon Web Services (AWS). Both Heroku and AWS are highly reliable and widely used; downtime for both has historically been (at worst) less than 0.05% over an annual period. Tabbie2 is hosted on `Uberspace <https://uberspace.de/>`_; a pay-what-you-want web hosting service. To the best of our knowledge, uptime statistics are not available.
id_id: **Lokasi Hosting**. Tabbycat merekomendasikan memakai Heroku, sebuah layanan platform cloud yang mapan untuk menyebarkan aplikasi web. Heroku pada gilirannya dihosting pada Layanan Web Amazon (LWA). Heroku dan LWA sangat terandalkan dan banyak digunakan; downtime untuk keduanya secara historis (paling buruknya) kurang dari 0,05% dalam periode tahunan. Tabbie2 dihosting pada `Uberspace <https://uberspace.de/>`_; sebuah layanan hosting web bayar-sesuai-keinginan-anda. Sepengetahuan kami, statistik uptime tidak tersedia.

source: **Multi-format support**. If you are interested in tabbing both four- and two- team formats there may be some value in using and learning Tabbycat as it will let you use the same software in both settings.
id_id: **Dukungan multi-format**. Jika anda tertarik dalam menabulasi baik empat- dan dua- format tim yang mungkin ada nilai dalam menggunakan dan mempelajari Tabbycat karena akan memungkinkan anda menggunakan perangkat lunak di kedua pengaturan.

source: Comparison with Tournaman
id_id: Perbandingan dengan Turnamen

source: Native app vs web app
id_id: Aplikasi asli vs aplikasi web

source: The crucial strength — and limitation — of Tournaman is that it is a Windows desktop application. Naturally, being a desktop app limits the features it can offer, relative to web apps like Tabbycat or Tabbie2, since it can't offer any online access. On the other hand, working with a desktop app can often be simpler than a web app.
id_id: Kekuatan penting - dan limitasi - dari Turnamen ialah itu sendiri merupakan aplikasi desktop Windows. Secara alamiah, menjadi aplikasi desktop membatasi fitur yang dapat dibagikan, relatif dengan aplikasi web seperti Tabbycat atau Tabbie2, karna tak bisa menawarkan akses daring apapun. Di sisi lain, menggunakan aplikasi desktop bisa jadi lebih simpel daripada aplikasi web.

source: **Installation**. You'll need to run (or emulate) a Windows machine to run Tournaman. Assuming you're using Windows, Tournaman's installation process is easy and familiar.
id_id: **Instalasi**. Anda akan perlu menjalankan (atau mengemulasi) sebuah mesin Windows dan menjalankan Turnamen. Mengasumsikan anda memakai Windows, proses instalasi Turnamen mudah dan familier.

source: Tabbycat has a simple one-click installation process if you're deploying online (:ref:`to Heroku <install-heroku>`). However, if you want to run Tabbycat on your own computer rather than a website, this is substantially more complicated. Local installations of Tabbycat work by having your computer emulate a web server, and while we've tried to make this as accessible as possible, a technical background is definitely helpful for this. Using our :ref:`Docker-based method <install-docker>` should be simple, but it's not 100% reliable, and if it fails it can be difficult to figure out why. If internet access is available, we recommend running Tabbycat on Heroku.
id_id: Tabbycat punya proses instalasi klik-sekali yang simpel bila anda mendeploy secara dari (:ref:`to Heroku <install-heroku>`). Akan tetapi, bila anda ingin menjalankan Tabbycat di komputermu sendiri daripada di situs web, ini akan lebih rumit pada pokoknya. Instalasi Tabbycat lokal akan bekerja dengan cara komputer anda mengemulasi sebuah server web, dan selama kita telah mencoba membuat ini dapat diakses semudah mungkin, latar belakang teknis akan sangat membantu tahap ini. Menggunakan :ref:`Metode berbasis-Docker <install-docker>` kami seharusnya simpel, tapi tidak 100% dapat diandalkan, dan bila gagal bisa jadi sulit untuk mengetahui alasannya. Jika akses internet tersedia, kami merekomendasikan menjalankan Tabbycat di Heroku.

source: **Online features**. Because Tournaman runs fully offline, it naturally can't support many internet-based features: electronic ballots, online publication of draws and live team standings, and integrated tab release. Typically, if you wanted to publish anything online from Tournaman, you'd do so by publishing the files that Tournaman generates locally. In Tabbycat, all of these are built in, so there's a single website for all tab information.
id_id: **Fitur daring**. Karena turnamen beroperasi sepenuhnya luring, maka ia tak bisa mendukung fitur berbasis-internet yang banyak: kertas suara elektronik, publikasi pengundian daring dan urutan tim secara langsung. Biasanya, bila anda ingin menerbitkan apapun daring dari Turnamen, anda akan melakukannya dengan menerbitkan berkas yang dihasilkan Turnamen itu secara lokal. Di Tabbycat, ini semua sudah ada di dalamnya, jadi situs web tunggal untuk semua informasi tabulasi.

source: **Multi-user access**. Tournaman can be configured to allow networked ballot entry, but in order to set it up, you need to be comfortable with basic computer networking. This works best on small isolated networks that you control directly, e.g. a dedicated router set up in the tab room. It's not a great idea to set this up on computers connected to a university-wide network: many IT departments won't permit it, and even if they do, it's insecure, since anyone on the network can access it.
id_id: **Akses pengguna-ganda**. Turnamen dapat dikonfigurasikan untuk memungkinkan masukan jaringan kertas suara, tapi untuk mengaturnya, anda harus sudah terbiasa dengan jaringan komputer dasar. Ini akan bekerja dengan baik pada jaringan tersendiri yang anda kontrol secara langsung, misalkan ruter khusus yang disiapkan dalam ruang tabulasi. Menyiapkannya pada komputer yang terhubung ke jaringan seluas-universitas bukanlah ide yang bagus; banyak departemen TI tidak mengizinkannya, dan bahkan jika ya, akan tidak aman, sejak siapapun pada jaringan dapat mengaksesnya.

source: Tournaman's multi-user access is designed primarily to allow tab assistants to enter data. Key administrative tasks, such as draw generation and adjudicator allocation, must still be done on the computer on which Tournaman is installed. In contrast, web-based systems like Tabbycat and Tabbie2 allow users to login from any internet-connected device to access the functionality permitted by their account. This is often extremely useful if, say, you want to log in to a lectern computer, or have tab assistants work on mobile devices that they have with them.
id_id: Akses pengguna-ganda turnamen dirancang terutama untuk memungkinkan asisten tabulasi untuk memasukkan data. Kunci tugas administrasi, seperti pembentukan pengundian dan alokasi juri, mesti tetap diselesaikan pada komputer yang turnamennya telah terinstall. Sebaliknya, sistem berbasis-web seperti Tabbycat dan Tabbie2 memungkinkan pengguna untuk masuk dari perangkat terhubung-internet untuk mengakses fungsionalitas yang telah diizinkan oleh penggunanya. Ini biasanya berguna bila, misalkan, anda ingin masuk ke komputer podium, atau punya asisten tabulasi berkerja pada perangkat mobile yang ada pada mereka.

source: If you choose to install Tabbycat offline (rather than on Heroku), it's also possible to have the computer on which the local installation resides serve the website to other computers on the same network. This then permits anyone on the same network to access the "local" installation as if it were hosted on the internet. However, like Tournaman, such a configuration requires at least basic networking experience, and for security reasons is only advisable on small isolated networks that you control.
id_id: Bila anda memilih untuk menginstall Tabbycat secara luring (daripada di Heroku), mungkin juga komputer yang dimana tempat instalasi lokal terletak menyiapkan situs web ke komputer lain pada jaringan yang sama. Ini kemudian mengizinkan siapapun pada jaringan yang sama untuk mengakses instalasi "lokal" seakan dari internet. Akan tetapi, seperti Turnamen, konfigurasi semacam itu membutuhkan setidaknya pengalaman jaringan dasar, dan untuk alasan keamanan disarankan hanya pada jaringan tersendiri yang anda kendalikan.

source: **Backups and portability**. Both Tournaman and Tabbycat (unlike Tabbie2) store data in a way that is completely accessible to you. Tournaman does this by saving files on your computer's hard drive, while Tabbycat stores data in a SQL database that belongs to you.
id_id: **Cadangan dan portabilitas**. Tournaman dan Tabbycat (tidak seperti Tabbie2) menyimpan data dengan cara yang dapat anda akses sepenuhnya. Tournaman dapat melakukan ini dengan menyimpan berkas pada hard drive komputer, sedangkan Tabbycat menyimpan data pada basisdata SQL milik anda sendiri.

source: It should be emphasized that in both Tournaman and Tabbycat, actually needing to revert to a backup is extremely rare. Almost always, any glitch or error that breaks the tab can be resolved by editing data directly, without needing to "roll back" to a previous state. In Tournaman, this is done by editing the files that it writes to your hard drive (they're just XML files). In Tabbycat, this is done through the "Edit Database" area.
id_id: Perlu ditekankan bahwa pada Tournaman dan Tabbycat, sangat jarang mengharuskan untuk kembali ke sebuah cadangan. Hampir selalu, tiap glitch atau kesalahan lain yang merusak tabulasinya dapat diselesaikan dengan mengedit datanya secara langsung, tanpa harus "kembali" ke keadaan sebelumnya. Di Tournaman, ini dilakukan dengan mengedit berkas yang ditulisnya ke hard drive anda (hanyalah berkas XML). Di Tabbycat, ini dilakukan dengan area "Edit Basisdata".

source: Tournaman's storage of data as XML files makes backups easy, although effort should be made to have backups stored on other computers or the cloud (e.g. on Dropbox) in case the tab computer breaks or is lost. Restoring data from those backups (or transferring the tab to a different computer) is typically a simple process of copying the files back to the original location.
id_id: Penyimpanan data Tournaman sebagai berkas XML membuat penyimpanan jadi mudah, walaupun usaha harus dilakukan agar cadangan tersimpan pada komputer lain atau cloud (misalkan pada Dropbox) jikalau tabulasi komputernya rusak atau hilang. Memulihkan data dari cadangan tersebut (atau mentransfer tabulasinya ke komputer yang berbeda) biasanya proses penyalinan simpel terhadap berkas-berkas kembali ke lokasinya yang awal.

source: As for Tabbycat, in online installations, backups can be taken easily using Heroku's `database backup capability <http://tabbycat.readthedocs.io/en/stable/features/backups.html>`_. However, restoring backups requires you to have the Heroku command line interface installed. In offline installations, PostgreSQL's "dump" and "restore" commands are recommended, and may require some perseverance to get going reliability, particularly if you don't have prior SQL experience.
id_id: Seperti untuk Tabbycat, pada instalasi daring, cadangan dapat dijalankan dengan mudah menggunakan `kapabilitas cadangan basisdata Heroku <http://tabbycat.readthedocs.io/en/stable/features/backups.html>`_. Akan tetapi, memulihkan cadangan mengharuskan anda untuk menginstall antarmuka baris kode. Pada instalasi luring, perintah "buang" dan "pulih" PostgreSQL direkomendasikan, dan mungkin membutuhkan beberapa ketekunan untuk mewujudkannya, terutama bila anda tidak punya pengalaman SQL sebelumnya.
