Repository: tara-45/tabby8
Catalog: docs/locale/*/LC_MESSAGES/guide/comparisons.po
Languages: id_id

source: Tab Software Comparisons
id_id: Tabulasi Perbandingan Perangkat Lunak

source: If you're reading this, you're probably interested in using Tabbycat, and wondering how it compares to other options. Perhaps you're a long-time user of another tab system, and wondering what Tabbycat can do better. This page is our effort to help answer this. Tabbycat's been around since 2010, but since BP support is a recent addition (2017), we thought it would be useful to outline the differences between Tabbycat and other BP software.
id_id: Bila kamu sedang membaca ini, anda mungkin tertarik menggunakan Tabbycat, dan penasaran bagaimana perbandingannya dengan pilihan lain. Barangkali anda seorang pengguna lama dari sistem tabulasi lain, dan ingin tahu apakah Tabbycat bisa lebih baik. Halaman ini adalah upaya kami untuk membantu menjawabnya. Tabbycat sudah ada sejak 2010, tapi semenjak dukungan BP yang merupakan tambahan baru (2017), kami mengira akan berguna untuk menggaris bawahi perbedaan-perbedaan antar Tabbycat dan perangkat lunak BP lainnya.

source: Obviously, this page is written by the developers of Tabbycat, and naturally, we have our biases. But rarely is there a single best option for everyone and every situation: different tab programs imagine the tabbing process in a different ways and have made unique trade-offs in their development process and design decisions. So we've tried to be as fair and accurate as we can, and we've consulted experienced tab directors (other than us!) and chief adjudicators to help provide a balanced overview.
id_id: Tentunya, halaman ini dibuat oleh developer Tabbycat, and pastinya, kami punya bias sendiri. Namun jarang ada satu pilihan terbaik untuk semua orang dan segala situasi: program tabulasi berbeda andaikan proses menabulasi dengan cara yang berbeda dan membuat pertukaran unik dalam proses pengembangan dan putusan desain. Jadi kami telah mencoba untuk adil sebisa dan seakurat mungkin, dan kami berkonsiltasi pada direktur tabulasi yang berpengalaman (selain kami!) serta kepala juri untuk membantu menyediakan gambaran yang seimbang.

source: At present, this guide just focuses on the major options available for the British Parliamentary format, although we'd like to expand this to incorporate the other formats that Tabbycat supports at some point in the future. As with all of our documentation, the source for this page `is on GitHub <https://github.com/TabbycatDebate/tabbycat/blob/develop/docs/guide/comparisons.rst>`_, and we welcome feedback and contributions.
id_id: Kini, panduan ini hanya berfokus pada pilihan utama yang tersedia untuk format Parlemen Inggris, walau kami ingin memperluasnya agar menggabungkan dengan format lain yang didukung Tabbycat pada waktu tertentu di masa yang akan datang. Seperti layaknya dokumen kami yang lain, sumber untuk halaman ini ada pada GitHub <https://github.com/TabbycatDebate/tabbycat/blob/develop/docs/guide/comparisons.rst>`_, dan kami menerima masukan dan kontribusi.

source: On feature lists
id_id: Pada daftar fitur

source: In the first draft of this document, we had a table that listed every feature we could think of, along with which software does and doesn't support it. This ended up not being a great idea, for a couple of reasons.
id_id: Pada draf pertama di dokumen ini, kami punya tabel dengan daftar tiap fitur yang bisa kami pikirkan, serta perangkat lunak mana yang bisa dan tidak bisa mendukungnya. Ini berakhir tidak menjadi ide yang baik, karna beberapa alasan.

source: Firstly, the largest feature disparities are for relatively niche features. All of the software discussed can do the basics necessary to run a tournament: generate draws, allocate adjudicators, enter results, etc. As a result, we will — like a good whip speech — be comparative and note key feature disparities when discussing each alternative software directly.
id_id: Pertama, disparitas fitur terbesar ialah untuk fitur yang relatif khusus. Semua perangkat lunak yang telah didiskusikan dapat melakukan hal-hal dasar yang penting untuk menjalankan sebuah turnamen: membuat pengundian, mangalokasi juri, memasukkan hasil, dsb. Sebagai hasil, kami akan - seperti "whip speech" yang baik - menjadi komparatif dan mencatat perbedaan fitur kunci saat membahas tiap perangkat lunak alternatif langsung.

source: Secondly, we felt that the 'checklist' approach to comparing tab software would do a disservice to the reasons you would actually choose one software over another. Except where a niche capability is essential, raw technical specifications rarely define the experience of using a product such as a phone, a car, or indeed, tabbing software. With Tabbycat, we've spent eight years continuously refining the tabbing workflow and smoothing out rough edges, and we believe you'll find the result extremely user-friendly and robust. As always, the best way to check this out is by :ref:`setting up a demo site and taking it for a spin <install-heroku>`!
id_id: Kedua, kami merasa pendekatan 'daftar periksa' untuk membandingkan tabulasi perangkat lunak akan bersifat merugikan untuk alasan bahwa kalian akan memilih sebuah perangkat lunak dan tidak yang satunya. Kecuali dimana kapabilitas khusus yang penting, spesifikasi teknis kasar jarang mengartikan pengalaman menggunakan produk seperti telepon, mobil, atau bahkan perangkat lunak tabulasi. Dengan Tabbycat, kami telah menghabiskan delapan tahun terus-menerus menyaring alur kerja dari tabulasi dan menghaluskan sisi-sisi kasar, dan kami percaya hasilnya akan sangat mudah-digunakan dan kuat. Seperti biasa, cara terbaik untuk memeriksa ialah dengan :ref:`memasang situs demo dan mencobanya <install-heroku>`!

source: Comparison with Tabbie2
id_id: Perbandingan dengan Tabbie2

source: Centralised site vs individual sites
id_id: Situs terpusat vs situs individual

source: Tabbie2 and Tabbycat are both internet-based systems. Tabbie2 hosts all tournaments on a single site. However, when using Tabbycat, each tournament or organisation sets up its own site. Each model has its advantages and disadvantages in different areas:
id_id: Tabbie2 dan Tabbycat sama-sama sistem berbasis-internet. Tabbie2 mengurus semua turnamen di sebuah situs tunggal. Akan tetapi, saat menggunakan Tabbycat, tiap turnamen atau organisasi mendirikan situsnya sendiri. Tiap model punya kelebihan dan kekurangannya masing-masing di area yang berbeda:

source: **User identification**. Tabbie2's centralised model allows for site-wide user accounts for all tournament participants. This means that they can use the same login information for all tournaments, and perform tasks such as submitting ballots and feedback through that unified account. If you're in an established circuit, most of your participants probably already have user accounts which are identified and collected (via e-mail addresses) during registration. If you're in a newer circuit, or one where Tabbie2 is rarely used, most of your participants will probably need to create an account — a process which Tabbie2 handles by e-mailing them a request to do so when that person is added to your tournament.
id_id: **Identifikasi pengguna**. Model terpusat milik Tabbie2 memungkinkan akun pengguna site-wide untuk semua peserta turnamen. Ini artinya mereka bisa memakai informasi login sama untuk semua turnamen, dan melakukan perbuatan seperti memasukkan surat suara dan umpan balik lewat akun gabungan itu. Jika anda berada pada sirkuit yang sudah terjalin, kebanyakan peserta kemungkinan sudah memiliki akun pengguna yang teridentifikasi dan sudah dikumpulkan (melalui alamat email) pada pendaftaran. Bila anda dalam sirkuit yang lebih baru, atau di tempat dimana Tabbie2 jarang digunakan, kebanyakan dari pesertamu pasti akan perlu membuat sebuah akun - proses dimana Tabbie2 menangani dengan meng-email mereka permintaan untuk melakukannya saat orang tersebut telah ditambahkan ke turnamenmu.

source: In Tabbycat's decentralised model, there is no persistent 'account' for tournament participants on each tab site or across different tab sites. Indeed, the only people who can log in to the site are those who have been given accounts by the tab director, such as tab staff and members of the adjudication core.
id_id: Pada model Tabbycat yang telah didesentralisasi, tidak ada 'akun' tetap untuk peserta turnamen pada tiap situs tabulasi atau seberang situs tabulasi yang berbeda. Tentu, orang yang hanya dapat login ke situs ialah mereka yang telah diberi akun oleh direktur tabulasi, seperti staf tabulasi dan anggota dari juri inti.

source: For secure e-ballot and e-feedback submissions, Tabbycat assigns a "private URL" to each adjudicator or team. This is essentially a password that allows a participant to only submit data that they should have access to in that specific tournament. This means participants don't need user accounts and you don't need to collect user account information; however if your tournament uses e-ballots or e-feedback you will need to distribute those private URLs to participants. Tabbycat can e-mail these to participants for you, or print them to give them to participants, or you could distribute the URLs using your own means.
id_id: Untuk masukan kertas kertas suara elektronik dan umpan balik-elektronik yang aman, Tabbycat menetapkan "URL privat" untuk tiap peserta. Ini pada dasarnya sebuah kata sandi yang memungkinkan peserta untuk hanya memasukkan data yang mereka punya akses pada turnamen spesifik itu. Ini artinya peserta tidak memerlukan akun pengguna dan anda tidak perlu mengumpulkan informasi akun pengguna; akan tetapi bila turnamen anda memakai kertas kertas suara elektronik atau umpan balik-elektronik anda perlu mendistribusikan URL privat itu ke peserta-peserta. Tabbycat bisa meng-email peserta-peserta ini untuk anda, atau mencetaknya dan memberi ke peserta, atau anda bisa mendistribusikan URL dengan sarana sendiri.

source: **Control over data**. Some participant information in Tabbie2 is shared between tournaments, like their names and conflicts (discussed below). This means participants can manage it directly through their user accounts, without needing to go through you. On the other hand, this requires your participants to co-operate in keeping their accounts up to date, and to provide the correct e-mail address during registration (you'd be surprised how many don't). Furthermore, participants may look to you for assistance, and your ability to help is limited to directing them through Tabbie2 channels—easy enough if they forget their password, but not so much if they forget their account's e-mail address.
id_id: **Kontrol atas data**. Beberapa informasi peserta di Tabbie2 dibagikan antar turnamen, seperti nama dan konflik mereka (didiskusikan di bawah). Ini berarti peserta bisa mengaturnya secara langsung lewat akun pengguna mereka, tanpa perlu lewat anda. Di sisi lain, ini membutuhkan peserta anda untuk berkooperasi dalam mempertahankan akun mereka ke yang terkini, dan untuk menyediakan alamat e-mail yang tepat saat registrasi (anda akan terkejut seberapa banyak yang tidak). Selanjutnya, peserta dapat meminta bantuan dari anda, dan kemampuan anda untuk membantu terbatas pada mengarahkan mereka lewat saluran Tabbie2 - yang cukup mudah bila mereka tidak lupa kata sandi mereka, tapi secukup bila mereka lupa alamat e-mail mereka.

source: Because each Tabbycat site is its own, you'll need to collect and import all participant details yourself. This might seem like more to do, but it also means there's no need to match your data to existing accounts, which can be time-consuming and prone to participant error. It also means you can freely change data, for example, to correct a participant's name or institution, or to add data like conflicts on an ad-hoc basis.
id_id: Karena tiap situs Tabbycat adalah mereka sendiri, anda akan perlu mengumpulkan dan mengimpor semua detil peserta sendiri. Ini mungkin terlihat banyak hal yang mesti dilakukan, tapi ini juga berarti tidak perlu mencocokkan data anda dengan akun yang telah ada, yang mana bisa memakan waktu banyak dan rentan pada kesalahan peserta. Itu juga berarti anda bisa mengubah data dengan bebas, sebagai contoh, untuk mengoreksi nama seorang peserta atau institusi, atau menambahkan data seperti konflik pada basis ad-hoc.

source: **Data privacy**. Conflicts are typically entered into the tab, and are sensitive information. Tabbie2's centralisation allows for conflicts to be self-nominated by users and stored in their user accounts. This, in theory, saves the need for users to report conflicts to tab directors and other tournament staff. In practice, however, only special "super" users on Tabbie2 have access to the stored conflicts of users (otherwise anyone could access a user's conflicts by creating a new tournament and adding that user as a participant), so many tournaments need to collect this information from participants anyway.
id_id: **Privasi data**. Konflik biasanya dimasukkan ke tabulasi, dan ialah informasi yang sensitif. Sentralisasi Tabbie2 memungkinkan sebuah konflik agar bisa dicalonkan-sendiri oleh pengguna dan tersimpan di akun pengguna. Ini, dalam teori, memudahkan pengguna dengan tidak perlu melaporkan konflik ke direktur tabulasi dan staf turnamen. Namun, senyatanya, hanya pengguna "super" spesial di Tabbie2 punya akses untuk menyimpan konflik dari pengguna (kalau tidak siapapun dapat mengakses konflik seorang pengguna dengan membuat turnamen baru dan menambahkan pengguna tersebut sebagai peserta), banyak sekali turnamen yang tetap perlu mengumpulkan informasi ini dari peserta.

source: Tabbycat's decentralised model means that no-one will have access to conflict information except for the tab staff of each individual instance of Tabbycat. Unlike Tabbie2, Tabbycat's developers do not have any access to your tournament's data — conflicts or otherwise. However, to help us continually improve the software, Tabbycat does send error reports to its developers if there is a serious bug or crash in the code, which could potentially contain confidential information depending on which page triggered the report. As a result of Tabbycat's decentralised data storage, each tournament does need to collect and enter conflicts as part of their registration process.
id_id: Model Tabbycat yang didesentralisasi berarti tak seorangpun akan punya akses ke informasi konflik kecuali bagi staf tabulasi untuk tiap instansi individu dari Tabbycat. Tidak seperti Tabbie2, developer Tabbycattidak punya akses ke data turnamen anda - konflik atau sebaliknya. Namun, untuk terus-menerus membantu kami mambaguskan perangkat lunaknya, Tabbycat tidak mengirim laporan kesalahan ke developernya jika ada masalah serius atau crash pada kodenya, yang dapat berpotensi mengandung informasi rahasia bergantung pada halaman mana yang memicu laporannya. Sebagai hasil dari penyimpanan data Tabbycat yang terdesentralisasi, tiap turnamen perlu mengumpulkan dan memasukkan konflik sebagai bagian dari proses registrasi.

source: **When things go wrong**. In our view, this is probably the most important factor. Obviously, we all hope you never have to fix things. But no software is perfect, and software developed by volunteers in their spare time (as both Tabbie2 and Tabbycat are) is especially imperfect. On occasion, glitches or edge cases occur, and fixing them requires you to directly edit the offending data in the database. Being able to do this without assistance can be the difference between a delay of minutes and a delay of hours.
id_id: **Ketika ada yang salah**. Di pandangan kita, ini mungkin faktor yang paling penting. Tentunya, kita semua berharap anda tidak perlu memperbaiki banyak hal. Tapi tidak ada perangkat lunak yang sempurna, dan perangkat lunak terkembang oleh relawan di waktu luang mereka (seperti Tabbie2 dan Tabbycat) sudah tentu tidak sempurna. Kadang kala, glitch atau edge cases terjadi, dan memperbaikinya membutuhkan anda untuk secara langsung mengubah data yang salah di basisdata. Untuk bisa melakukan ini tanpa bantuan dapat menjadi perbedaan antara penundaan beberapa menit dan penundaan berjam-jam.

source: In Tabbycat, because it's your site, you have full control of the database, and can edit it through Tabbycat's "Edit Database" area. This allows you to fix things (or break things, if you're not careful!). Tabbie2's centralisation prevents this—for obvious reasons, only Tabbie2's developers have direct database access, which makes their intervention necessary if direct database access is required to resolve a problem.
id_id: Di Tabbycat, karna situs anda, anda punya kontrol penuh terhadap basisdata, dan bisa mengeditnya lewat area "Edit Basisdata" Tabbycat. Ini memungkinkan anda untuk memperbaiki (atau merusak, bila anda tidak berhati-hati!). Sentralisasi Tabbie2 mencegah ini-karna alasan yang jelas, hanya developer Tabbie2 punya akses langsung ke basisdata, yang membuat campur tangan mereka lebih penting bila akses basisdata langsung dibutuhkan untuk menyelesaikan suatu masalah.

source: Running your tournament
id_id: Menjalankan turnamen mu

source: Tabbie2 and Tabbycat have broadly similar workflows for running rounds; at least on paper. Key differences are discussed below:
id_id: Tabbie2 dan Tabbycat punya alur kerja yang mirip secara luas untuk menjalankan ronde; setidaknya dalam teori. Perbedaan utamanya didiskusikan di bawah ini:

source: **Data import**. Tabbie2 takes CSV files for import. Tabbycat has a CSV file importer, but it's (for now) only accessible through a command-line interface and is only expected to be used for large tournaments by experienced tab directors. As a more user-friendly alternative, Tabbycat also has an import wizard that's designed to make it easy to copy and paste CSV data. This works well for small and medium scale tournaments, but is cumbersome for large ones.
id_id: **Impor data**. Tabbie2 mengambil berkas CSV untuk diimpor. Tabbycat punya pengimpor berkas CSV, tapi itu (untuk sekarang) hanya dapat diakses lewat antarmuka command-line dan hanya terkira dipakai untuk turnamen besar oleh direktur tabulasi yang berpengalaman. Sebagai alternatif yang mudah-digunakan, Tabbycat juga punya wizard impor yang terdesain untuk lebih mudah untuk menyalin dan menempel data CSV. Ini berkerja dengan baik dengan turnamen dengan skala kecil dan sedang, tapi rumit bagi yang besar.

source: **Public interface**. Tabbycat can optionally publish the entire draw, as well as current team point standings and results of previous rounds, online. Tabbie2 shows to a logged-in user information about the debate that user is in for that round, but doesn't allow people to check up on people who are not themselves.
id_id: **Antarmuka publik**. Tabbycat dapat menerbitkan seluruh undian secara opsional, begitu juga dengan urutan poin tim saat ini dan hasil dari ronde sebelumnya, secara daring. Tabbie2 menunjukkan ke pengguna yang telah masuk informasi tentang debat yang pengguna tersebut sedang berada, tapi tidak memperbolehkan seseorang untuk mengecek orang lain yang bukan dirinya sendiri.

source: **Position rotation**. Tabbie2 uses an algorithm known as the "Silver Line algorithm", which keeps swapping pairs of teams until no further improvement is found. Because it stops at any 'local optimum', this method isn't guaranteed to be the best possible distribution of positions, and for large tournaments it often isn't. Tabbycat instead uses the `Hungarian algorithm <https://en.wikipedia.org/wiki/Hungarian_algorithm>`_, an well-known algorithm that finds the (globally) optimal allocation of positions. (One might describe this algorithm, in technical terms, as 'powerful'.) Tabbycat also produces a position balance report, so that in every round you can see which teams have unbalanced position histories.
id_id: **Rotasi posisi**. Tabbie2 memakai algoritma yang dikenal sebagai "Algoritma Silver Line", yang terus menukar pasangan tim sampai tidak ada perbaikan lebih lanjut yang ditemukan. Karena berhenti saat 'optimum lokal' apapun, metode ini tidak terjamin jadi distribusi posisi terbaik, dan untuk turnamen besar biasanya tidak. Tabbycat justru memakai `Algoritna Hungarian <https://en.wikipedia.org/wiki/Hungarian_algorithm>`_, sebuah algoritma terkenal yang mencarikan alokasi posisi optimal (secara global). (algoritma ini bisa dikatakan, dalam istilah teknis, sebagai 'kuat'.) Tabbycat juga membuat laporan posisi seimbang, supaya dalam tiap ronde anda bisa melihat tim mana yang memiliki sejarah posisi tak seimbang.

source: **Venue allocations**. Both Tabbie2 and Tabbycat allow for debate venues to be automatically assigned and manually edited. Tabbycat also allows you to specify 'venue constraints' that can automatically match particular participants with their accessibility requirements, or alternatively allow for tournament staff, such as a convenor or chief adjudicator, to be allocated rooms close to the briefing hall or tab room.
id_id: **Alokasi tempat**. Tabbie2 dan Tabbycat sama-sama memungkinkan tempat debat untuk secara otomatis ditetapkan dan diedit secara manual. Tabbycat juga memungkinkan anda untuk menentukan 'batasan tempat' yang bisa mencocokkan peserta tertentu secara otomatis dengan kebutuhan aksesibilitas, atau kalau tidak memungkinkan staf turnamen, seperti penyelenggara atau ketua juri, untuk dialokasikan ke ruangan yang dekat dengan aula briefing atau ruang tabulasi.

source: **Ballot entry**. Both Tabbie2 and Tabbycat support entering ballots online ('e-ballots') and entering ballots from paper from the tab room. Tabbie2 was built with e-ballots in mind, while Tabbycat was originally built for tab room staff, and the ballot entry paradigms reflect that. Both are flexible, just a little different—the best way to understand the difference is to try a demo of each. Also, Tabbycat takes note of the order in which speakers in a team spoke (i.e. who was PM and who was DPM), whereas Tabbie2 just records scores.
id_id: **Masukan suara**. Tabbie2 dan Tabbycat sama-sama mendukung memasukkan suara secara daring ('kertas suara elektronik') dan memasukkan kertas suara dari kertas dari ruang tabulasi. Tabbie2 dibangun dengan kertas suara elektronik di benak, selama Tabbycat awalnya dikembangkan untuk staf ruang tabulasi, dan paradigma masukan kertas suara mencerminkan itu. Keduanya fleksibel, hanya sedikit berbeda-cara terbaik untuk mengerti perbedaannya ialah dengan mencoba tiap masing-masing demo. Tabbycat juga mengambil catatan dari urutan pembicara dalam sebuah tim berbicara (misalkan, siapa PM dan siapa DPM), sedangkan Tabbie2 hanya menyimpan nilai.

source: As discussed earlier in *User identification*; Tabbie2's e-ballots are tied to unified user accounts, whereas Tabbycat's e-ballots are tied to per-tournament and per-adjudicator 'private URLs'.
id_id: Seperti yang sudah didiskusikan sebelumnya pada Identifikasi Pengguna; kertas suara elektronik Tabbie2 terikat dengan gabungan akun-akun pengguna, dimana kertas suara elektronik Tabbycat terikat dengan 'URL privat' tiap-turnamen dan tiap-juri.

source: **Break and speaker categories**. Tabbie2 has ESL, EFL and novice markers, which you can enable in a tournament's settings. Tabbycat supports user-defined break and speaker categories, so if your tournament has ESL, EFL, novice or any other form of category, you can define and customise those categories as needed.
id_id: **Kategori break dan pembicara**. Tabbie2 punya ESL, EFL dan marker pemula, yang anda bisa aktifkan di pengaturan turnamen. Tabbycat mendukung break yang ditetapkan pengguna dan kategori pembicara, jadi bila turnamen anda punya ESL, EFL, pemula atau bentuk kategori lainnya, anda bisa menetapkan dan merubah kategori itu sesuai kebutuhan.
