Repository: tara-45/tabby8
Catalog: docs/locale/*/LC_MESSAGES/guide/comparisons.po
Languages: id_id

source: Generally there is no need for data portability when working with an online copy of Tabbycat — the website can be accessed anywhere. However if working with an offline/local copy, a tab can be transferred between machines by creating a backup of the database and restoring it to the other machine's database (doing so requires technical knowledge).
id_id: Pada umumnya portabilitas data tidak dibutuhkan saat berurusan dengan jiplakan daring Tabbycat - situs webnya dapat diakses darimanapun. Tetapi bila berurusan dengan jiplakan yang luring, sebuah tabulasi dapat ditransfer antar mesin dengan membuat cadangan basisdata dan memungkinkannya ke basisdata mesin lain (melakukannya membutuhkan pengetahuan teknis).

source: **Adjudicator feedback**. Tournaman lets you assign judges rankings, however it does not directly manage or assist the process of collecting judge feedback. As such tab directors generally need to run a parallel feedback system, and then manually copy over changes to an adjudicator's ranking into Tournaman itself. In contrast, Tabbycat has integrated methods for collecting judge feedback that allow it to be more easily issued, collected, viewed, and automatically translated into modifications to an adjudicator's rank.
id_id: **Umpan balik juri**. Tournaman membiarkan anda menetapkan ranking juri, tetapi tidak mengatur atau membantu proses mengumpulkan umpan balik juri secara langsung. Dengan demikian direktur tabulasi umumnya perlu menjalankan sistem umpan balik paralel, dan kemudian menyalin perubahan secara manual ke ranking juri ke Tournaman itu sendiri. Sebaliknya, Tabbycat punya metode terintegrasi untuk mengumpulkan umpan balik juri yang memungkinkannya jadi lebih mudah dikabarkan, dikumpulkan, dilihat, dan diterjemahkan secara otomatis ke modifikasi peringkat juri.

source: **Adjudicator allocation**. Tournaman has a fixed judge ranking scale and (from what we understand) has a relatively fixed procedure for allocating panels according to their absolute ranks. We are unsure about the exact mechanics of how this works, but broad details are `available here <https://www.facebook.com/notes/harry-mcevansoneya/tournaman-judge-ranking-scale-advice-for-future-cas/10151964404693002/>`_.
id_id: **Alokasi juri**. Tournaman memiliki skala ranking juri yang tetap dan (dari apa yang kita pahami) memiliki prosedur yang relatif tetap untuk mengalokasikan panel berdasarkan peringkat absolut mereka. Kami tidak yakin mengenai mekanisme yang tepat tentang cara kerjanya, namun detail yang luas `tersedia disini <https://www.facebook.com/notes/harry-mcevansoneya/tournaman-judge-ranking-scale-advice-for-future-cas/10151964404693002/>`_.

source: As with the discussion of allocation interfaces vis-à-vis Tabbie2, there are a number of features in the Tabbycat allocation interface that mean it is more easily used in a collaborative setting and can display additional information to inform draws.
id_id: Seperti diskusi mengenai alokasi antarmuka Tabbie2 vis-à-vis, ada sejumlah fitur pada antarmuka alokasi Tabbycat yang berarti lebih mudah digunakan pada pengaturan kolaboratif dan dapat menampilkan informasi tambahan untuk memberitahu pengundian.

source: **Flexibility in draw rules**. As we've said, all major tab systems are WUDC-compliant. But if you want to deviate from WUDC rules, Tournaman has a few more options. Whereas Tabbycat allows you to use intermediate brackets (rather than pull-ups), Tournaman allows you to sacrifice power-pairing integrity for position balance (though this generally isn't necessary to achieve position balance), fold within brackets and avoid teams hitting their own institution. On the other hand, Tabbycat allows you to tune how position balance trades off between teams (which the WUDC constitution doesn't precisely specify).
id_id: **Fleksibilitas pada aturan pengundian**. Seperti yang telah kami katakan, semua sistem tabulasi utama sesuai dengan KDITU. Namun bila anda ingin menyimpang dari aturan KDITU, Tournaman punya beberapa pilihan. Sedangkan Tabbycat memungkinkan anda untuk menggunakan intermediate brackets (dibanding pull-up), Tournaman memungkinkan anda mengorbankan integritas power-pairing untuk keseimbangan posisi (meskipun ini umumnya tidak perlu untuk mencapai keseimbangan posisi), lipatan dalam brackets dan menghindari tim mengenai institusinya sendiri. Di sisi lain, Tabbycat memungkinkan anda menyesuaikan bagaimana keseimbangan posisi saling berkorban antar tim (yang tidak ditentukan dengan tepat oleh konstitusi KDITU).

source: **Stability and development**. Tournaman has been in use for over a decade and is generally considered to be stable and reliable. However, new features are relatively rarely added, and its being a native app means that it doesn't boast as many features as Tabbycat or Tabbie2.
id_id: **Stabilitas dan perkembangan**. Tournaman telah digunakan selama lebih dari satu dekade dan umumnya dianggap stabil dan terandalkan. Namun, fitur baru relatif jarang ditambahkan, dan menjadi aplikasi asli berarti tidak membanggakan fitur sebanyak Tabbycat atau Tabbie2.

source: **Cost**. Tournaman is free to use. Tabbycat is free to use for not-for-profit, not-for-fundraising tournaments; tournaments for profit or fundraising must make a donation of A$1 per team. In addition, larger tournaments that run on Tabbycat's recommended web host (Heroku) may need to purchase an upgraded database service (the free tier has storage limits) which will cost around ~US$3 to use for the duration of a week-long tournament.
id_id: **Biaya**. Tournaman gratis digunakan. Tabbycat gratis digunakan untuk turnamen nirlaba, turnamen bukan-penanggalangan-dana; turnamen untuk profit atau penanggalangan-dana mesti membuat donasi sebanyak A$1 per tim. Sebagai tambahan, turnamen yang lebih besar yang berjalan di situs host rekomendasi Tabbycat (Heroku) mungkin perlu membeli layanan basisdata yang telah ditingkatkan (tingkat gratis punya batas penyimpanan) yang mungkin sekitar ~US$3 untuk digunakan selama durasi turnamen seminggu.

source: **Availability of source code**. Tournaman's code is closed-source, meaning it is not publicly available. If you do not have any coding experience this is probably not relevant to you, but if you do, having access to the source of Tabbycat can help you understand how the program works and customise it as needed.
id_id: **Ketersediaan kode asal**. Kode Tournaman ialah sumber-tertutup, yang berarti tidak tersedia untuk umum. Bila anda tidak memiliki pengalaman koding apapun ini mungkin tidak relevan bagi anda, tapi bila ya, punya akses ke sumber Tabbycat bisa membantu anda memahami bagaimana cara kerja programnya dan menyesuaikannya sesuai kebutuhan.

source: Comparison with hand tabbing
id_id: Perbandingan dengan hand tabbing

source: Hand tabbing is easy, until it isn't. Traditionally, using a spreadsheet has been the go-to option for smallish tournaments because, hey, you're pretty handy with Excel, right? Making draws in spreadsheets (or on paper) seems like a pretty approachable task; ultimately it's all cells and formulae and numbers unlike the more arcane underpinnings of actual tab software.
id_id: Hand Tabbing mudah, sampai tidak. Biasanya, menggunakan spreadsheet telah menjadi opsi paling biasa untuk turnamen yang kecil karena, hei, Anda cukup ahli dengan Excel, bukan? Membuat pengundian di spreadsheet (atau di kertas) seperti tugas yang cukup mudah dilakukan; pada akhirnya itu semua ialah sel-sel dan rumus-rumus dan angka yang tidak seperti perangkat lunak tabulasi yang sebenarnya.

source: However, hand tabbing does require you to have a good working knowledge of how your format's rules work and how your spreadsheet software of choice can be made to work them. That process might be easy for you, or it might not be. But, either way, we'd like to think that Tabbycat offers a better alternative to hand-tabbing; regardless of how well you can actually hand-tab. The setup costs of creating a copy of Tabbycat are pretty low and you can speed through the process of draw creation, adjudicator allocation, and result entry at a pace. It's still not going to be as fast a spreadsheet for a small tournament, but we think it's getting pretty close. And in exchange for a little speed you get a much stronger guarantee of your draws being correct, options for online data entry, a more comprehensive and shareable final tab, and much more. Give it a shot!
id_id: Meskipun demikian, menabulasi dengan tangan memang mengharuskan anda punya pengetahuan kerja yang bagus mengenai bagaimana format Anda bekerja dan bagaimana perangkat lunak spreadsheet pilihan anda dapat dibuat untuk menjalankannya. Itu mungkin proses yang mudah bagi Anda, atau mungkin tidak. Tapi, bagaimanapun juga, kami ingin Tabbycat menawarkan alternatif yang lebih baik untuk menabulasi dengan tangan; terlepas dari seberapa baik anda menabulasi dengan tangan. Biaya penyiapan untuk membuat salinan dari Tabbycat cukup rendah dan anda bisa mempercepat proses pembuatan pengundian, alokasi juri, dan hasil entri dengan cepat. Ini masih tidak akan secepat spreadsheet untuk turnamen kecil, tapi kami pikir itu sudah cukup mendekati. Dan sebagai pengganti sedikit kecepatan, anda dapat jaminan lebih kuat bahwa hasil undian anda akan tepat, pilihan untuk masukan data daring, tabulasi akhir yang lebih komprehensif dan dapat dibagikan, dan banyak lainnya. Silahkan dicoba!
