Repository: tara-45/tabby8
Catalog: docs/locale/*/LC_MESSAGES/guide/scaling.po
Languages: id_id

source: When a page is 'cached' it means that Tabbycat has stored a copy of the final output of the page. It can then send that copy directly to a user who is loading that page without needing to go through the normal process of fetching the data from the database, running any calculations, and formatting the results. Pages that are cached will serve quickly — if a page is taking more than a few seconds to load it usually means that page has not been cached (or your site is having too much traffic to serve pages quickly in general). The downside is that changes to the underlying data won't update until the cache has 'expired' and is regenerated. So, for example, a cached copy of the draw will not immediately reflect change to panels and a newly-release motion or tab page will not show up in the menu immediately.
id_id: Ketika sebuah halaman 'di-cache' itu berarti Tabbycat telah menyimpan salinan hasil akhir halaman. Kemudian bisa mengirim salinan itu langsung ke pengguna yang memuat halaman tersebut tanpa perlu melalui proses normal untuk mengambil data dari database, menjalankan penghitungan apa pun, dan memformat hasil. Halaman yang di-cache akan ditayangkan dengan cepat - jika halaman membutuhkan waktu lebih dari beberapa detik untuk memuat, biasanya itu berarti halaman tersebut belum di-cache (atau situs anda memiliki terlalu banyak lalu lintas untuk menyajikan halaman dengan cepat secara umum). Kelemahannya adalah perubahan pada data yang pokok tidak akan diperbarui hingga cache telah 'kedaluwarsa' dan dibuat ulang. Jadi, misalkan, salinan undian dalam cache tidak akan langsung mencerminkan perubahan pada panel dan mosi yang baru dirilis atau halaman tabulasi tidak akan segera muncul di menu.

source: By default Tabbycat caches public pages according to three levels: a 1-minute timeout, a 3.5-minute timeout, and a 2-hour timeout. The only pages on the 2-hour timeout are those that come with a full tab release — such as speaker standings, the motions tab, etc. Public pages that need to update quickly, such as the draw and homepage, are on the 1-minute timeout to ensure data is up to date. Public pages that update less frequently such as Standings, Results, Participants, and Breaks are on the 3.5-minute timeout.
id_id: Secara bawaan Tabbycat menyimpan halaman publik berdasarkan tiga level: waktu-berhenti 1-menit, waktu-berhenti 3.5-menit, dan waktu-berhenti 2-jam. Satu-satunya halaman pada waktu-berhenti 2-jam adalah yang datang dengan rilis tabulasi penuh - seperti klasemen pembicara, tabulasi mosi, dll. Halaman publik yang perlu diperbarui dengan cepat, seperti undian dan beranda, ada di waktu-berhenti 1-menit untuk memastikan data selalu terbaru. Halaman publik yang lebih jarang diperbarui seperti Klasemen, Hasil, Peserta, dan Istirahat berada pada waktu-berhenti 3.5-menit.

source: Caching means that a Tabbycat site should actually perform *faster* when it is being viewed by many people at once, as the caches are constantly up-to-date and can be used to serve the majority of requests. When there is less traffic the caches are more likely to be regenerated each time someone goes to a page resulting in slower page loads. Most often performance problems come when a popular page, such as a newly-released draw gains a large amount of traffic suddenly (such as by people constantly refreshing the draw). If the page hasn't finished caching it has to do a full page calculation for each of those new loads, which will spike the amount of resource use until the page load queue is cleared.
id_id: Caching berarti sebuah situs Tabbycat seharusnya bekerja *lebih cepat* saat dilihat oleh banyak orang sekaligus, karena cache selalu diperbarui dan dapat digunakan untuk melayani sebagian besar permintaan. Ketika lalu lintas lebih sedikit, cache lebih cenderung dibuat ulang setiap kali seseorang membuka halaman yang mengakibatkan pemuatan halaman lebih lambat. Masalah peforma paling sering muncul ketika halaman populer, seperti undian yang baru dirilis, mendadak mendapatkan banyak lalu lintas (seperti oleh orang-orang yang terus-menerus menyegarkan undian). Jika halaman belum menyelesaikan caching, ia harus melakukan kalkulasi halaman penuh untuk setiap pemuatan baru tersebut, yang akan meningkatkan jumlah penggunaan sumber daya hingga antrian pemuatan halaman dihapus.

source: One way to help mitigate this is to try and load those pages first yourself to ensuring the cache is populated before other people access it. To do so you would generally open a new private browsing tab, and navigate to the specific page(s) immediately after you have enabled them. This may require going to the URL directly rather than relying on the homepage or menu (which may not have been updated to show the new information). In the case of draw releases, this can also be mitigated by not release online draws until they have been first shown on a projector (so that people aren't trying to get draw information ahead of time).
id_id: Salah satu cara untuk membantu mengurangi ini ialah dengan mencoba dan memuat halaman-halaman itu sendiri terlebih dahulu untuk memastikan cache terisi sebelum orang lain mengaksesnya. Untuk melakukannya, anda biasanya akan membuka tab browser pribadi baru, dan menavigasi ke halaman tertentu segera setelah anda mengaktifkannya. Ini mungkin perlu membuka URL secara langsung daripada mengandalkan beranda atau menu (yang mungkin belum diperbarui untuk menampilkan informasi baru). Dalam kasus rilis undian, ini juga dapat dikurangi dengan tidak merilis undian online sampai mereka pertama kali ditampilkan di proyektor (sehingga orang-orang tidak mencoba mendapatkan informasi gambar terlebih dahulu).

source: You can also increase the 1-minute timeout for the pages that are popular during the in-rounds, by going to the **Settings** section of your Heroku dashboard, clicking *Reveal Config Vars*, and creating a new key/value of ``PUBLIC_FAST_CACHE_TIMEOUT`` and ``180`` (to set the timeout to be 3 minutes i.e. 180 seconds). This should only be necessary as a last resort. Turning off public pages is also an option.
id_id: Anda juga dapat menambah waktu-berhenti 1-menit untuk halaman yang populer selama dalam-ronde, dengan membuka bagian **Pengaturan** di dasbor Heroku, mengklik *Tampilkan Vars Konfig*, dan membuat kunci/nilai baru dari ``PUBLIC_FAST_CACHE_TIMEOUT`` dan ``180`` (untuk mengatur waktu-berhenti menjadi 3 menit yaitu 180 detik). Ini seharusnya hanya diperlukan sebagai upaya terakhir. Mematikan halaman publik juga merupakan sebuah pilihan.

source: If you ever need to clear the cache (say to force the site to quickly show an update to the speaker tab) you can install `Heroku's Command Line Interface <https://devcenter.heroku.com/articles/heroku-cli>`_ and run the following command, replacing ``YOUR_APP`` with your site's name in the Heroku dashboard::
id_id: Jika Anda perlu membersihkan cache (misalkan untuk memaksa situs agar segera menampilkan pembaruan ke tab pembicara), Anda dapat menginstal `Antarmuka Command Line Heroku <https://devcenter.heroku.com/articles/heroku-cli>`_ dan jalankan perintah berikut, ganti ``YOUR_APP`` dengan nama situs anda di dasbor Heroku::

source: Postgres Limits
id_id: Batas Postgres

source: The free tier of the Postgres database services has a limit of 20 'connections'. As with Redis, it is rare that a Tabbycat site will exceed this limit; most Australs-sized tournaments will see a maximum of 12 connections at any point in time.
id_id: Tingkat gratis dari layanan database Postgres memiliki batas 20 'koneksi'. Seperti halnya Redis, jarang sekali situs Tabbycat melebihi batas ini; sebagian besar turnamen seukuran-Australia akan mempunyai maksimal 12 koneksi pada titik waktu mana pun.

source: You can monitor this in your Heroku Dashboard by going to the **Resources** tab and clicking on the purple Postgres link. The **Connections** graph here will show you how close you are to the limit. The first tier up from the 'free' Hobby tiers (i.e. ``Standard-0``) has a connection limit of 120 which can be used to overcome these limits if you do encounter them.
id_id: Anda dapat memantau pada dasbor Heroku anda dengan membuka tab **Sumber Daya** dan klik tautan Postgres yang bewarna ungu. Graf **Koneksi** ini akan menunjukkan seberapa dekat anda dengan batas. Tingkat pertama dari tingkatan Hobi 'gratis' (seperti ``Standar-0``) memiliki batas koneksi 120 yang dapat digunakan untuk mengatasi batasan ini jika anda menemukannya.

source: Mirror Admin Sites
id_id: Situs Admin Mirror

source: If you *really* want to be safe, or are unable to resolve traffic issues and unable to quickly complete tasks on the admin site, it is possible to create a 'mirror' of the tab site just for admin use. This site can be configured to share the same database as the primary site — meaning it is in effect always identical — but because it is at a separate URL it won't have to respond to public traffic and so can't be swamped with a large page load queue.
id_id: Jika anda *benar-benar* menginginkan keamanan, atau tidak mampu menyelesaikan masalah lalu lintas dan tidak dapat menyelesaikan tugas dengan cepat di situs admin, anda dapat membuat 'mirror' dari situs tabulasi hanya untuk digunakan admin. Situs ini dapat dikonfigurasi untuk berbagi database yang sama dengan situs utama - artinya situs ini akan berlaku selalu identik - tetapi karena berada di URL yang terpisah, situs ini tidak perlu merespons lalu lintas publik sehingga tidak dibanjiri dengan antrian pemuatan halaman yang banyak.

source: This requires some technical knowledge to setup and hasn't been rigorously tested. It works fine in our experience but we haven't tested it extensively. If using this make sure you backup (and now how to restore backups) before setting one up.
id_id: Ini membutuhkan beberapa pengetahuan teknis untuk menyiapkannya dan belum diuji secara teliti. Ini berfungsi dengan baik dalam pengalaman kami tapi kami belum mengujinya secara ekstensif. Jika menggunakan ini, pastikan anda mencadangkan (dan tau cara memulihkan cadangan) sebelum menyiapkannya.

source: To do so you would deploy a new copy of Tabbycat on Heroku as you normally would. Once the site has been setup, go to it in the Heroku Dashboard, click through to the **Resources** tab and remove the Postgres and Redis Add-ons. Using the `Heroku Command Line Interface <https://devcenter.heroku.com/articles/heroku-cli>`_ run this command, substituting ``YOUR_APP`` with your *primary* tab site's name (i.e. the app that you had initially setup before this)::
id_id: Untuk melakukannya, anda akan menerapkan salinan baru Tabbycat di Heroku seperti biasa. Setelah situs telah disiapkan, buka di Dasbor Heroku, klik ke tab **Sumber Daya** dan hapus tambahan add-on Postgres dan Redis. Menggunakan `Antarmuka Command Line Heroku <https://devcenter.heroku.com/articles/heroku-cli>`_ jalankan perintah ini, gantikan ``YOUR_APP`` dengan nama situs tab *utama* anda (yaitu aplikasi yang anda gunakan awalnya, disiapkan sebelum ini)::

source: Here, make a copy of the ``DATABASE_URL`` and ``REDIS_URL`` values. They should look like ``postgres://`` or ``redis://`` followed by a long set of numbers and characters. Once you have those, go to the *Settings* tab of the Heroku dashboard for your *mirror* tab site. Click **Reveal Config Vars**. There should be no set ``DATABASE_URL`` or ``REDIS_URL`` values here — if there are check you are on the right app and that the add-ons were removed as instructed earlier. If they are not set, then add in those values, with ``DATABASE_URL`` on the left, and that Postgres URL from earlier on the right. Do the same for ``REDIS_URL`` and the Redis URL. Then restart the app using the link under **More** in the top right.
id_id: Di sini, buat salinan nilai ``DATABASE_URL`` dan ``REDIS_URL``. Jadinya akan terlihat seperti ``postgres://`` atau ``redis://`` diikuti dengan serangkaian angka dan karakter. Setelah ada, buka tab *Pengaturan* di dasbor Heroku untuk situs tab *mirror* anda. Klik **Tampilkan Vars Konfig**. Seharusnya tidak ada nilai ``DATABASE_URL`` atau ``REDIS_URL`` di sini - jika ada, pemeriksaan anda berada di aplikasi yang benar dan add-on telah dihapus seperti yang diinstruksikan sebelumnya. Jika tidak diatur, tambahkan nilai tersebut, dengan ``DATABASE_URL`` di sebelah kiri, dan URL Postgres dari sebelumnya di sebelah kanan. Lakukan hal yang sama untuk ``REDIS_URL`` dan URL Redis. Kemudian mulai ulang aplikasi menggunakan tautan di bawah **Lainnya** di kanan atas.

source: Once you visit the mirror site it should be setup just like the original one, with changes made to one site also affecting the other as if they were just a single site.
id_id: Setelah mengunjungi situs mirrornya, maka akan disiapkan seperti yang asli, dengan perubahan yang dilakukan pada satu situs, juga memengaruhi situs lainnya seakan-akan situs hanya satu situs.

source: Estimated Costs
id_id: Estimasi Biaya

source: As a quick and rough benchmark, here is a list of typical prices you would encounter if scaling to meet the performance needs of a high-team-count high-traffic tournament at the approximate scale of an Australs (~100 teams) or above. This is a probably an overly-conservative estimate in that it is based on tournaments run on the ``2.1`` version of Tabbycat. Versions ``2.2`` and above should perform dramatically better and thus have less need to scale using Standard and Performance dynos.
id_id: Sebagai patokan cepat dan kasar, berikut adalah daftar harga biasa yang akan anda temui jika penskalaan untuk memenuhi kebutuhan kinerja turnamen lalu lintas-tinggi dengan jumlah-tim-tinggi pada skala perkiraan Australia (~100 tim) atau lebih tinggi. Ini mungkin perkiraan yang terlalu konservatif karena didasarkan pada turnamen yang dijalankan pada Tabbycat versi ``2.1``. Versi ``2.2`` dan yang lebih baru mesti bekerja jauh lebih baik dan oleh karena itu tidak perlu melakukan penskalaan menggunakan standar dan kinerja dynos.

source: 1x ``Hobby Basic Postgres Plan`` ($9/month) run all day for 14 days = ~$4
id_id: 1x ``Rencana Hobi Postgres Dasar`` ($9/bulan) berjalan sepanjang hari selama 14 hari = ~$4

source: A tournament of this size will require an upgraded database tier for the time when you are adding new data; i.e. during registration and rounds. Once the tab is released (and no further data changes needed) however you can downgrade it back to the ``Hobby Dev`` tier.
id_id: Turnamen sebesar ini akan membutuhkan tingkat database yang telah ditingkatkan pada saat anda menambahkan data baru; yaitu selama pendaftaran dan putaran. Setelah tabulasi dilepaskan (dan tidak diperlukan perubahan data lebih lanjut), Anda dapat menurunkannya kembali ke tingkat ``Hobi Dev``.

source: 1x ``Hobby Dyno`` ($7/month each) run all day for 7 days = ~$2
id_id: 1x ``Hobi Dyno`` (masing-masing $7/bulan) berjalan sepanjang hari selama 7 hari = ~$2

source: As recommended, 1 hobby dyno should be run as a baseline in order to see the metrics dashboard; but this can be downgraded a day or so after the tab has been released and traffic is sparse.
id_id: Seperti yang direkomendasikan, 1 hobi dyno harus dijalankan sebagai baseline untuk melihat metrik dasbor; tapi ini dapat diturunkan satu atau dua hari setelah tabulasi dilepaskan dan lalu lintas menjadi jarang.

source: 3x ``Standard 1X Dyno`` ($25/month each) run 10 hours a day for 4 days = ~$4
id_id: 3x ``Standard 1X Dyno`` (masing-masing $25/bulan) berjalan 10 jam sehari selama 4 hari = ~$4

source: This higher quantity of dynos should only be necessary during traffic spikes (i.e. draw releases, immediately after round advances, and tab release) but unless you want to be constantly turning things on/off its usually easier just to upgrade them at the start of each day of in-rounds (or when the tab is published) and downgrade them at the end of each day. As mentioned earlier, you should occasionally check the *Dyno Load* in the Metrics area and adjust the number of dynos as needed.
id_id: Jumlah dino yang lebih tinggi ini seharusnya hanya diperlukan selama lonjakan lalu lintas (seperti rilis undian, segera setelah kemajuan ronde, dan rilis tabulasi) kecuali jika anda ingin terus-menerus menyalakan/mematikan sesuatu, biasanya lebih mudah hanya untuk memutakhirkannya di awal tiap hari dalam-ronde (atau saat tabulasi dipublikasikan) kemudian menurunkan versinya di akhir tiap hari. Seperti yang disebutkan sebelumnya, anda harus sesekali memeriksa *Beban Dyno* di area Metrik dan menyesuaikan jumlah dino sesuai kebutuhan.

source: ``Autoscaled Performance M Dynos`` ($250/month each) average of 5 run for 1 hour = ~$2
id_id: ``Autoscaled Performance M Dynos`` (masing-masing $250/bulan) rata-rata 5 kali berjalan selama 1 jam = ~$2

source: For just round 1 it is a good idea to upgrade to the ``Performance M`` tier so you can enable auto-scaling and thus have the site automatically adjust the number of dynos to the amount of traffic it's getting (rather than having to guess the number of dynos needed ahead of time). Doing so ensures that the first round runs smoothly and means that you can then review the Metrics graphs to see what your 'peak' load looks like and resume using whatever quantity of ``Standard 1X Dyno`` will accommodate this peak load in future rounds.
id_id: Untuk ronde 1 saja, ide yang baik untuk meningkatkan ke tingkat ``Peforma M`` sehingga anda dapat mengaktifkan penyekalaan-otomatis dan dengan demikian membuat situs secara otomatis menyesuaikan jumlah dynos dengan jumlah lalu lintas yang didapatnya (daripada harus menebak jumlah dino yang dibutuhkan sebelumnya). Melakukannya akan menjamin bahwa ronde pertama berjalan dengan lancar dan berarti anda kemudian dapat meninjau graf Metrik untuk melihat seperti apa beban 'puncak' yang terlihat dan melanjutkan menggunakan jumlah ``Standar 1X Dyno`` yang akan mengakomodasi beban puncak ini di ronde mendatang.
