Repository: tara-45/tabby8
Catalog: docs/locale/*/LC_MESSAGES/guide/scaling.po
Languages: id_id

source: Scaling & Performance on Heroku
id_id: Penyekalaan & Performa pada Heroku

source: If you expect your Tabbycat site to gain lots of traffic — either because it has lots of participants or will be followed by lots of people online — there are a number of strategies to ensure that it will remain fast despite this attention. This is typically only necessary for very large tournaments that will display information on the public-facing version of your Tabbycat site; and even then only minor amounts of 'scaling' are needed at particular moments. However, if your site does become slow you want to know what to do and how to do it ahead of time in order to prevent disruptions.
id_id: Jika kamu mengharapkan situs Tabbycat anda mendapatkan banyak kunjungan -- baik karena memiliki banyak partisipan ataupun akan diikuti oleh banyak orang secara daring -- ada banyak strategi untuk memastikan bahwa situs akan tetap cepat meskipun terdapat perhatian ini. Hal ini biasanya hanya perlu untuk turnamen yang sangat besar yang akan menampilkan informasi pada versi situs publik Tabbycat anda; bahkan hanya sejumlah kecil dari 'scaling' yang dibutuhkan pada saat-saat tertentu. Meskipun demikian, jika situsmu menjadi lambat, kamu mau tau apa yang harus dilakukan dan bagaimana melakukannya untuk mencegah gangguan.

source: By default, a Tabbycat installation runs on Heroku's free tier. This is a resource-constrained environment and improving performance will typically require paying for higher levels of Heroku services. These services are billed on a per-minute (not monthly) basis, meaning that if you make use of any upgrades mentioned below, you will only be billed for the actual duration used — i.e. if an upgrade is listed at $100/month, but you only use it for 4 hours, the final bill will be around $0.50. As such you can make use of high-performing resources just when they are needed, without needing to pay the full monthly price to maintain the resource indefinitely.
id_id: Secara bawaan, sebuah instalasi Tabbycat beroperasi pada tingkatan gratis pada Heroku. Ini adalah sebuah lingkungan dengan sumber daya yang terbatas dan peningkatan performa biasanya akan membutuhkan layanan Heroku dengan level lebih tinggi. Layanan-layanan ini ditagih setiap menit (bukan setiap bulan), yang artinya jika kamu menggunakan peningkatan apapun yang disebutkan di bawah ini, kau hanya akan ditagih berdasarkan durasi yang sebenarnya digunakan -- misalkan terdapat sebuah peningkatan dengan harga $100/bulan, tetapi kamu hanya menggunakannya selama 4 jam, tagihan akhirnya akan berkisar $0.50. Karena itu, kamu bisa memanfaatkan sumber-sumber dengan performasi tinggi hanya saat dibutuhkan, tanpa harus membayar harga bulanan penuh untuk mempertahankan sumber tanpa batas.

source: This page was largely written before a number of improvements in the ``2.2`` release of Tabbycat that have significantly increased traffic capacity. Its recommendations may be overly cautious given these improvements.
id_id: Laman ini sebagian besar ditulis sebelum sejumlah perbaikan dalam rilis ``2.2`` dari Tabbycat yang telah meningkatkan kapasitas lalu lintas secara signifikan. Rekomendasinya mungkin terlalu berhati-hati mengingat peningkatan ini.

source: Scaling for performance reasons is a separate issue to that of `upgrading the database capacity <install-heroku#upgrading-your-database-size>`_ of your tab which just provides the ability to store data. That said, typically only tournaments that are large enough to need an upgraded database will be the ones that ever need to consider scaling for performance anyway.
id_id: Penyekalaan untuk alasan performa adalah isu berbeda dari `meningkatkan kapasitas basisdata <install-heroku#upgrading-your-database-size>`_ dari tabulasi anda yang hanya menyediakan kemampuan untuk menyimpan data. Meskipun demikian, biasanya hanya turnamen yang cukup besar memerlukan basis data yang telah ditingkatkan yang akan menjadi sesuatu yang perlu pertimbang penyekalaan untuk performa.

source: Introduction to Scaling
id_id: Pengantar untuk Penyekalaan

source: Heroku's primary resource is that of a 'dyno'. Each dyno can be thought of as running a copy of Tabbycat. Following the 'many hands make light work' principle, running a greater number of dynos will generally improve the ability of your site to serve lots of pages simultaneously because traffic is divided up amongst all of the available dynos. In normal circumstances most Tabbycat pages on the public site are served by Heroku in under a second; however they can take noticeably longer than that when the quantity of incoming traffic exceeds the capacity of the existing dyno(s) to serve it. In such cases the delay accrues because the excess page loads need to first wait for an available dyno in addition to the standard wait for a page to be processed and transferred to the user.
id_id: Sumber daya utama Heroku adalah 'dyno'. Setiap dyno dapat dianggap menjalankan salinan Tabbycat. Mengikuti prinsip 'banyak tangan membuat pekerjaan ringan', menjalankan lebih banyak dynos umumnya akan meningkatkan kemampuan situs Anda untuk menyajikan banyak laman secara bersamaan karena lalu lintas dibagi di antara semua dyno yang tersedia. Dalam keadaan normal, sebagian besar laman Tabbycat di situs publik dilayani oleh Heroku dalam waktu kurang dari satu detik; namun mereka bisa memakan waktu lebih lama dari itu ketika jumlah lalu lintas masuk melebihi kapasitas dyno yang ada untuk melayaninya. Dalam kasus seperti itu, penundaan bertambah karena kelebihan pemuatan halaman harus terlebih dahulu menunggu dyno yang tersedia selain penantian standar untuk halaman diproses dan ditransfer ke pengguna.

source: Thus scaling is almost always a process of increasing *throughput* in order to decrease the chance that any page load needs to wait in order to be served by a dyno. On the flip side, having extra dynos or upgraded dynos won't make Tabbycat itself run any faster in general — they are essentially wasted unless there is sufficient large amounts of traffic that a single dyno cannot serve all of it without creating a queue.
id_id: Jadi penyekalaan hampir selalu merupakan proses peningkatan *hasil* untuk mengurangi kemungkinan pemuatan halaman apa pun perlu menunggu untuk dilayani oleh dyno. Di sisi lain, memiliki dyno ekstra atau dynos yang telah ditingkatkan tidak akan membuat Tabbycat itu sendiri berjalan lebih cepat secara umum - mereka pada dasarnya sia-sia kecuali ada lalu lintas dalam jumlah yang cukup besar sehingga satu dyno tidak dapat melayani semuanya tanpa membuat sebuah antrian.

source: Dynos can be scaled by adding more dynos ('horizontally') or by adding upgraded dynos ('vertically'). In general, horizontal scaling should be the first and most effective strategy — the problem traffic causes is due to *concurrency* or lots of people loading lots of pages all at once. The traffic on Tabbycat sites typically fluctuates a lot, with moments of high intensity clustering around draw releases, round advances, and the final tab release. As such you generally only need to scale your dynos for very short periods of time.
id_id: Dynos dapat diskalakan dengan menambahkan lebih banyak dynos (secara horizontal) atau dengan menambahkan dynos yang ditingkatkan (secara vertikal). Secara umum, penyekalaan horizontal harus menjadi strategi pertama dan paling efektif -- masalah lalu lintas disebabkan karena *konkurensi* atau banyak orang memuat banyak halaman sekaligus. Lalu lintas di situs Tabbycat biasanya sangat berfluktuasi, dengan momen pengelompokan intensitas tinggi di sekitar rilis undian, ronde lanjut, dan rilis tabulasi terakhir. Karena itu, anda hanya perlu men-skala dynos anda untuk waktu yang sangat singkat.

source: In order to increase the number of dynos you first need to be using at least the **Standard 1X** level of dyno. Once set the Heroku Dashboard will show you a slider that can be used to increase the dyno count. While dynos higher than the **Standard 1X** level may help serve pages a tiny bit faster, having *more* dynos is far more effective than having *upgraded* dynos. Upgrading beyond **Standard 1X** is generally only required if you need additional memory (as described below) or want to use auto-scaling (also described below).
id_id: Untuk meningkatkan jumlah dyno, pertama-tama anda harus menggunakan setidaknya tingkat dyno **Standar 1X**. Setelah diatur, Dasbor Heroku akan menampilkan penggeser yang dapat digunakan untuk meningkatkan jumlah dyno. Meskipun dynos yang lebih tinggi dari level **Standar 1X** dapat membantu menampilkan laman sedikit lebih cepat, memiliki *lebih banyak* dynos jauh lebih efektif daripada memiliki dyno yang *ditingkatkan*. Meningkatkan lebih dari **Standar 1X** umumnya hanya dibutuhkan jika anda memerlukan memori tambahan (seperti yang dijelaskan di bawah) atau ingin menggunakan penskalaan otomatis (juga dijelaskan di bawah).

source: There should be no need to increase the number of 'worker' dynos. While 'web' dynos are responsible for serving traffic, the worker only handles a few rare tasks such as serving email and creating allocations.
id_id: Seharusnya tidak perlu menambah jumlah dino 'worker'. Meskipun dyno 'web' bertanggung jawab untuk melayani lalu lintas, dyno 'worker' hanya menangani beberapa tugas langka seperti melayani email dan membuat alokasi.

source: At large tournaments you should always upgrade your existing '**Free**' dyno to a '**Hobby**'-level dyno. This upgrade is crucial as it will enable a "Metrics" tab on your Heroku dashboard that provides statistics which are crucial to understanding how your site is performing and how to improve said performance. If you are at all unsure about how your site will perform it is a good idea to do this pre-emptively and keep an eye on these metrics over the course of the tournament.
id_id: Pada turnamen besar anda mesti selalu meningkatkan dyno '**Gratis**' anda yang telah ada ke dyno level-'**Hobi**'. Peningkatan ini krusial karena akan memungkinkan sebuah tabulasi "Metrik" pada dasbor Heroku anda yang menyediakan statistik yang penting untuk mengerti cara situs anda bekerja dan bagaimana cara meningkatkan performanya. Bila anda belum yakin mengenai bagaimana situs anda akan berjalan sebaiknya melakukan ini terlebih dahulu dan memperhatikan mertrik ini selama turnamen berlangsung.

source: If pages are not loading it could be due to two things: your site being overloaded with traffic, or a bug in Tabbycat itself. Generally, if you see a generic or Heroku-branded 'application error' page that means it is the former problem, whereas a Tabbycat-branded page indicates the latter.
id_id: Bila halaman tidak memuat itu mungkin dikarenakan dua hal: situs anda dipenuhi dengan lalu lintas, atau sebuah bug dalam Tabbycat itu sendiri. Umumnya, bila anda melihat halaman 'kesalahan aplikasi' biasa atau yang bermerek Heroku, itu berarti masalah sebelumnya, sedangkan halaman bermerek Heroku berarti yang terakhir.

source: Scaling Dynos
id_id: Penyekalaan Dynos

source: Once you have upgraded your dyno to the **Hobby** level, the metrics tab provides a number of graphs that can be used to help identify how your site is performing. The first graph, **Events** provides an overview of any problems that are occurring:
id_id: Setelah anda meningkatkan dyno ke tingkat **Hobi**, tabulasi metrik menyediakan sejumlah graf yang dapat digunakan untuk membantu mengidentifikasi bagaimana peforma situs anda. Graf pertama, **Kejadian** memberikan gambaran umum tentang masalah apa pun yang terjadi:

source: Red marks, or those labelled *Critical* typically indicate some sort of problem. H13 errors are a good measure of the amount of pages failing to load during heavy traffic, however they can be triggered under normal conditions — you want to check how many are occurring within a given time period and ensure its more than a handful.
id_id: Tanda merah, atau yang berlabel *Kritis* biasanya menunjukkan semacam masalah. Kesalahan H13 ialah ukuran baik dari jumlah halaman yang gagal memuat selama lalu lintas yang padat, namun itu dapat memicu pada kondisi normal - anda perlu memeriksa seberapa banyak yang terjadi dalam jangka waktu tertentu dan memastikannya lebih dari segelintir.

source: Response Time & Throughput
id_id: Waktu Respon & Hasil

source: The response time is the amount of time it takes a dyno to load a page and serve it to your users. Smaller response times are thus good, and long response times (over fifteen seconds) indicate that a site is struggling to serve its content due to a large amount of queueing.
id_id: Waktu respons adalah jumlah waktu yang dibutuhkan sebuah dyno untuk memuat halaman dan menyajikannya kepada pengguna anda. Dengan demikian, waktu respons yang lebih kecil berarti baik, dan waktu respons yang lama (lebih dari lima belas detik) menunjukkan bahwa situs kesulitan menyajikan kontennya karena banyaknya antrian.

source: Heroku dynos have a maximum response time of 30 seconds, at which point they will stop serving the request. To users this appears as an error page or as a page that never loads. Thus if you see the graph is at or approaching 30 seconds at any point you need to try and diagnose what is causing this and add more resources to reduce the response time.
id_id: Heroku dynos punya waktu respons maksimum 30 detik, pada saat itu mereka akan berhenti melayani permintaan. Bagi pengguna, ini akan terlihat sebagai halaman kesalahan atau sebagai halaman yang tidak pernah memuat. Sehingga, jika anda melihat graf berada pada atau mendekati 30 detik pada titik tertentu, anda perlu mencoba dan mendiagnosis penyebabnya dan menambahkan lebih banyak sumber untuk mengurangi waktu respons.

source: You can toggle the percentiles in this graph. Problems are much more severe if it affects the 50th percentile which represents a site that is probably not loading for the majority of its users. There are also a couple of Tabbycat functions (like automatic adjudicator allocation) that naturally take 10-20 seconds which means that the maximum or 99th percentile metrics are not very reflective of general traffic.
id_id: Anda dapat mengubah persentil di grafik ini. Masalah akan lebih parah jika memengaruhi persentil ke-50 yang mewakili situs yang mungkin tidak memuat sebagian besar penggunanya. Ada juga beberapa fungsi Tabbycat (seperti alokasi juri otomatis) yang tentunya membutuhkan waktu 10-20 detik yang berarti metrik persentil maksimum atau ke-99 tidak terlalu mencerminkan lalu lintas umum.

source: Closely related to this is the **Throughput** graph (further down) which shows how many pages your site is serving per second. Normally this is not particularly interesting, however note that the red part of the bar graph shows the amount of failed page requests. Like the **Response Time** graph, this can indicate issues with the site — normally this red portion should be well below 1rps (and ideally 0rps). If it is above 0.5 it represents a site that is producing a significant number of failed page loads.
id_id: Hal yang paling terkait dengan ini ialah graf **Hasil** (lebih ke bawah) yang menunjukkan berapa banyak situs anda menayangkan halaman per detiknya. Biasanya ini tidak menarik, namun perhatikan bahwa bagian merah dari batang graf menunjukkan jumlah permintaan halaman yang gagal. Seperti graf **Waktu Respons**, ini dapat menandakan masalah pada situs tersebut - biasanya bagian merah ini harus jauh di bawah 1ppd (dan idealnya 0ppd). Jika nilainya di atas 0,5, ini menunjukkan situs yang menghasilkan sejumlah besar pemuatan halaman yang gagal.

source: You can verify if pages are not being served to users by checking the **Events** graph and looking for H12 errors, although occasionally they are not reported properly. A large amount of H13 errors can also be a cause for concern.
id_id: Anda dapat memverifikasi apakah halaman tidak ditampilkan pada pengguna dengan memeriksa graf **Kejadian** dan mencari kesalahan H12, meskipun terkadang tidak dilaporkan dengan benar. Sejumlah besar kesalahan H13 juga bisa menjadi perhatian.

source: Dyno Load
id_id: Pemuatan Dyno

source: This graph shows how well your dynos are being utilised. It is scaled relative to the total number of dynos you are running (or have run previously). So if you have 10 dynos and the bar graph is near the '10' this shows that each dyno is being utilised 100% (either on average over a 1-minute period or as the maximum use over a 1-minute period).
id_id: Graf ini menunjukkan seberapa baik dynos Anda digunakan. Ini diskalakan relatif terhadap jumlah total dynos yang anda jalankan (atau telah dijalankan sebelumnya). Jadi, jika anda memiliki 10 dynos dan graf batang mendekati '10', ini menunjukkan bahwa setiap dyno sedang digunakan 100% (baik rata-rata selama periode 1 menit atau sebagai penggunaan maksimum selama periode 1 menit).

source: If this bar graph is hitting the top it will usually mean that a site that is slow or failing to load pages — if each dyno is busy it can't serve a new page until it is finished. This issue can often compound, with more traffic coming in than it is possible to serve and clear.
id_id: Bila graf batang ini mencapai bagian atas, biasanya itu berarti situsnya lambat atau gagal memuat halaman - jika setiap dyno sibuk, dyno tidak dapat menampilkan halaman baru sampai selesai. Masalah ini sering kali menjadi rumit, dengan banyak lalu lintas yang masuk daripada yang dapat dilayani dan dibersihkan.

source: If your average, rather than maximum, dyno load is approaching the upper limit of however many dynos you are running now (remember the y-axis will often exceed however many dynos you are currently running) that is a very good sign that you should increase the quantity of dynos being run. Continue adding dynos and evaluate how this effects load so that the bar is not hitting its limit.
id_id: Jika rata-rata anda, daripda maksimum, pemuatan dyno mendekati batas atas berapapun banyak dynos yang anda jalankan sekarang (ingat sumbu y akan sering melebihi seberapa banyak dynos yang anda jalankan saat ini) itu pertanda baik bahwa anda harus meningkatkan jumlah dynos yang dijalankan. Terus tambahkan dynos dan evaluasi bagaimana efek ini dimuat agar batangnya tidak mencapai batasnya.

source: If you are consistently needing to scale things (or having previously had issues and are expecting a very heavy burst of traffic) it may be worth upgrading to the **Performance-M** dyno type, which will then allow you to enable the *Auto-scaling* feature. This will automatically add dynos as needed to cope with traffic, and remove them when they become unnecessary. This is very effective; however, note that this dyno-type is $250/month per dyno and will self-add dynos (within an upper limit you can specify). While this is not a huge price on a per hour/minute basis (even running 10 for an hour is only $4) you definitely want to ensure you keep a close eye on it and turn it off when it is not necessary. Note that it also tends to be quite aggressive in how many dynos it 'thinks' you need — you may want to increase the default response time threshold to prevent it scaling so quickly.
id_id: Jika anda secara konsisten butuh penyekalaan (atau sebelumnya pernah mengalami masalah dan mengharapkan banyak lonjakan lalu lintas) mungkin ada baiknya untuk meningkatkan ke tipe dyno **Performa-M**, yang akan memungkinkan anda untuk mengaktifkan fitur *Penyekalaan otomatis*. Ini secara otomatis akan menambahkan dynos yang diperlukan untuk mengurus lalu lintas, dan menghapusnya saat tidak diperlukan. Ini sangat efektif; namun, perhatikan bahwa tipe dyno ini adalah $250/bulan per dyno dan akan menambahkan sendiri dynos (dalam batas atas yang dapat anda tentukan). Meskipun ini bukan harga yang besar untuk tiap jam/menit (bahkan menjalankan 10 untuk sejam hanya $4) anda pasti ingin memastikan anda terus mengawasinya dan mematikan saat tidak diperlukan. Perhatikan bahwa itu juga cenderung cukup agresif dalam berapa banyak dynos yang 'menurut' dynos itu sendiri akan anda butuhkan - Anda mungkin ingin meningkatkan ambang waktu respon bawaan untuk mencegahnya menskalakan dengan begitu cepat.

source: Memory Usage
id_id: Penggunaan Memori

source: It is very rare that Tabbycat sites will hit the memory limits of the Free or Hobby level dynos — its almost always hovering around 256MB of the (standard dyno) limit of 512MB. However, if the graph is approaching the dashed line you may want to first restart the dynos (in the *More* dropdown in the upper-right) and see if that resolves it.
id_id: Situs Tabbycat sangat jarang mencapai batas memori dari level dynos Gratis atau Hobi - hampir selalu di sekitar 256MB dari batas (dyno standar) 512MB. Namun, jika grafik mendekati garis putus-putus, anda mungkin ingin memulai ulang dynos terlebih dahulu (di dropdown *Lainnya* di kanan-atas) dan lihat apakah itu menyelesaikannya.

source: You can also confirm that memory limits are causing the app to fail by checking for the presence of R14 errors in the Events chart. If your site continues to come very close to that memory limit you will want to upgrade your dynos to the higher level dynos which have increased memory.
id_id: Anda juga dapat mengonfirmasi bila batas memori yang menyebabkan aplikasi gagal dengan memeriksa adanya kesalahan R14 di bagan Peristiwa. Jika situs anda terus mendekati batas memori tersebut, anda akan ingin mengupgrade dynos anda ke dynos tingkat yang lebih tinggi yang mempunyai memori yang telah ditambahkan.

source: Alerts
id_id: Peringatan

source: If the site is really struggling to perform its usually relatively obvious. However, if you want to be pre-warned of this, or just ensure things are as fast as possible, you can use the "Configure Alerts" feature on the Metrics page to receive emails when things are getting slow. We would recommend creating a Response Time Threshold warning of ``15000ms`` and a Response Requests Percentage Threshold of ``5%``.
id_id: Jika situs tersebut kesulitan beroperasi, biasanya akan cukup jelas. Namun, jika anda ingin diperingatkan sebelumnya, atau hanya memastikan semuanya secepat mungkin, anda dapat menggunakan fitur "Konfigurasi Peringatan" di halaman Metrik untuk menerima email ketika segala sesuatunya menjadi lambat. Kami akan merekomendasikan untuk membuat peringatan Ambang Batas Waktu Respons ``15000ms`` dan Ambang Batas Persentase Permintaan Respons ``5%``.

source: Understanding Caching
id_id: Memahami Caching
