Repository: tara-45/tabby8
Catalog: docs/locale/*/LC_MESSAGES/guide/upgrading.po
Languages: id_id

source: Upgrading Tabbycat
id_id: Meningkatkan Tabbycat

source: Generally only want to upgrade copies of tab sites that are used on an ongoing basis for multiple tournaments, or if there is a bugfix release between when you setup your site and when the tournament is running.
id_id: Umumnya hanya ingin meningkatkan salinan situs tab yang digunakan secara berkelanjutan untuk beberapa turnamen, atau jika ada rilis perbaikan bug antara saat anda mengatur situs dan saat turnamen berjalan.

source: Going from any version of Tabbycat 1 to any version of Tabbycat 2 won't work with the below instructions â€” check out the CHANGELOG for the 2.0 version for details of how to perform this upgrade.
id_id: Beralih dari versi apa pun dari Tabbycat 1 ke versi apa pun dari Tabbycat 2 tidak akan berfungsi dengan petunjuk di bawah ini -- lihat CHANGELOG untuk versi 2.0 untuk detail tentang cara melakukan peningkatan ini.

source: Upgrading a Local Copy
id_id: Meningkatkan Salinan Lokal

source: Assuming you haven't made any changes to the Tabbycat code, upgrading a locally installed copy should just be a matter of `downloading the latest source code <https://github.com/TabbycatDebate/tabbycat/releases/latest>`_ and replacing the existing files with the new ones. If you used git to download these files initially you can just pull down the latest copy of the master branch to do this.
id_id: Dengan asumsi anda belum membuat perubahan apa pun pada kode Tabbycat, memutakhirkan salinan yang diinstal secara lokal seharusnya hanya masalah `mengunduh kode sumber terbaru <https://github.com/TabbycatDebate/tabbycat/releases/latest>` _ dan mengganti berkas yang ada dengan yang baru. Jika anda menggunakan git untuk mengunduh berkas-berkas ini pada awalnya, anda dapat menarik salinan terbaru dari cabang master untuk melakukannya.

source: You would then repeat the "Install Tabbycat" instructions for your original installation method.
id_id: Anda kemudian akan mengulangi petunjuk "Instal Tabbycat" untuk metode penginstalan asli anda.

source: Upgrading on Heroku
id_id: Meningkatkan di Heroku

source: The easiest way to upgrade a Heroku site is to create an account on Github and then to `'fork' <https://help.github.com/articles/fork-a-repo/>`_ the `Tabbycat repository <https://github.com/TabbycatDebate/tabbycat>`_.
id_id: Cara termudah untuk meningkatkan situs Heroku adalah dengan membuat akun di Github dan kemudian ke `'fork' <https://help.github.com/articles/fork-a-repo/>`_ `Repositori Tabbycat nya <https://github.com/TabbycatDebate/tabbycat>`_.

source: Once you have done this you can login to your Heroku Dashboard, go to your app, and then navigate to the Deploy tab. In this tab, adjacent to *Deployment method* select the GitHub option. This will bring up a new 'Connect to GitHub' section where you can search for 'Tabbycat' to find the copy of the repository you made earlier and connect it.
id_id: Setelah anda melakukan ini, anda dapat masuk ke Dasbor Heroku anda, pergi ke aplikasi anda, dan kemudian arahkan ke tab Penyebaran. Di tab ini, di sebelah *Metode penyebaran* pilih opsi GitHub. Ini akan memunculkan bagian 'Hubungkan ke GitHub' baru di mana anda dapat mencari 'Tabbycat' untuk menemukan salinan repositori yang anda buat sebelumnya dan menghubungkannya.

source: Once connected a new *Manual deploy* section will appear. Make sure you select the *master* branch (not develop) and then click *Deploy Branch*. This will then show the app deploying and notify you when it has finished; which may take several minutes.
id_id: Setelah terhubung, bagian *Penyebaran Manual* baru akan muncul. Pastikan anda memilih cabang *master* (bukan develop) lalu klik *Sebarkan Cabang*. Ini kemudian akan menunjukkan penerapan aplikasi dan memberi tahu anda ketika telah selesai; yang mungkin membutuhkan waktu beberapa menit.
