Repository: tara-45/tabby8
Catalog: tabbycat/notifications/locale/*/LC_MESSAGES/django.po
Languages: it

source: Notifications
it: Notifiche

source: Recipient email address
it: Indirizzo email di destinazione

source: Test email from %(host)s
it: Email di prova da %(host)s

source: Congratulations! If you're reading this message, your email backend on %(host)s looks all good to go!
it: Congratulazioni! Se stai leggendo questo messaggio, il tuo email backend su %(host)s sembra andare bene!

source: Subject
it: Oggetto

source: Message
it: Messaggio

source: recipient
it: destinatario

source: method
it: metodo

source: context
it: contesto

source: notification
it: notifica

source: timestamp
it: data e ora

source: sent message
it: messaggio inviato

source: sent messages
it: messaggi inviati

source: team points
it: punti squadra

source: ballot confirmed
it: ballot confermato

source: feedback URL
it: URL feedback

source: landing page URL
it: URL pagina di destinazione

source: adjudicator draw released
it: sorteggio giudice rilasciato

source: team registration
it: registrazione del team

source: adjudicator registration
it: registrazione giudice

source: motion(s) released
it: mozione/i rilasciata/e

source: team draw released
it: sorteggio della squadra rilasciato

source: custom message
it: messaggio personalizzato

source: event
it: evento

source: tournament
it: torneo

source: subject template
it: modello oggetto

source: body template
it: modello corpo

source: bulk notification
it: notifica di massa

source: bulk notifications
it: notifiche di massa

source: Processed
it: Elaborato

source: Dropped
it: Saltato

source: Deferred
it: Rinviato

source: Delivered
it: Consegnato

source: Bounced
it: Rimbalzato

source: Opened
it: Aperto

source: Clicked
it: Cliccato

source: Unsubscribed
it: Iscrizione annullata

source: Marked as spam
it: Segnata come Spam

source: Unsubscribed from group
it: Disiscritto dal gruppo

source: Resubscribed to group
it: Sottoscritto nuovamente al gruppo

source: email message
it: messaggio email

source: email status
it: stato mail

source: email statuses
it: stato mail

source: You have not specified a reply-to address. This means that participants may not reply to the message if they have questions. Please set one in the <a href="%(notifications_options_url)s">Notifications section of the preferences</a>.
it: Non hai specificato un indirizzo di risposta. Ciò significa che i partecipanti non potranno rispondere al messaggio se hanno domande. Si prega di impostarne uno nella sezione <a href="%(notifications_options_url)s">Preferenze di notifiche</a>.

source: The webhook URL for use in SendGrid is <a href="%(notifications_webhook_url)s">%(notifications_webhook_url)s</a>. Please point the HTTP POST URL in <a href="https://app.sendgrid.com/settings/mail_settings">SendGrid</a> to that.
it: L'URL di webhook da usare in SendGrid è <a href="%(notifications_webhook_url)s">%(notifications_webhook_url)s</a>. Si prega di indirizzare l'URL HTTP POST in <a href="https://app.sendgrid.com/settings/mail_settings">SendGrid</a>.

source: Send Message(s)
it: Invia messaggi(o)

source: Emails can be sent by Tabbycat for a variety of purposes. Emails are sent when specific preferences are enabled (i.e. enabling Ballot Receipts) or through actions available on specific pages (i.e. the Draw Display page for matchups; or the Participants page for team registration). This page shows the status of previously-sent emails.
it: Le email possono essere inviate da Tabbycat per molti motivi. Le email vengono inviate quando vengono abilitate le apposite preferenze (es. abilitando la ricezione del ballot) oppure attraverso azioni disponibili su pagine specifiche (es. la pagina di visualizzazione sorteggio per gli abbinamenti; oppure la pagina dei partecipanti per la registrazione del team). Questa pagina mostra lo stato delle email precedentemente inviate.

source: Email Statuses
it: Stato mail

source: Send Test Email
it: Invia email di prova

source: Send Custom Email
it: Invia Email Personalizzata

# page title
source: Send Test Email
it: Invia email di prova

source: You can use this form to send a test email, to check that your email backend settings are working, before you try to send email notifications to participants.
it: È possibile utilizzare questo modulo per inviare una e-mail di prova, per controllare che le impostazioni del backend e-mail funzionino, prima di provare a inviare notifiche via mail ai partecipanti.

source: The email will be sent from: <strong>%(default_from_email)s</strong>. If this doesn't look right, change the <code>DEFAULT_FROM_EMAIL</code> config var in Heroku (or environment variable).
it: L'email verrà inviata da: <strong>%(default_from_email)s</strong>. Se questo non sembra corretto, cambiare la variabile <code>DEFAULT_FROM_EMAIL</code> in Heroku (o la variabile d'ambiente).

source: Go back to the site home page
it: Torna alla pagina iniziale

source: the chair
it: giudice arbitro

source: the only
it: l'unico

source: a panellist
it: un giudice

source: a trainee
it: un tirocinante

source: TBA
it: Da annunciare

source: <li>%(side)s: %(team)s (%(points)d points with %(speaks)s total speaks)
it: <li>%(side)s: %(team)s (%(points)d punti con %(speaks)s speaker totali)

source: <li>%(side)s: %(team)s (%(points)s - %(speaks)s total speaks)
it: <li>%(side)s: %(team)s (%(points)s - %(speaks)s speech totali)

source: Win
it: Vittoria

source: Loss
it: Sconfitta

source: The email (SMTP) server returned an error sending the test email: [SMTP code %(code)d] %(error)s
it: Il server di posta elettronica (SMTP) ha restituito un errore inviando l'email di prova: [codice SMTP %(code)d] %(error)s

source: Hint: If the error is about sender identity verification in SendGrid, and you've already completed the steps in SendGrid, it may be that you need to update the DEFAULT_FROM_EMAIL config var in Heroku to match your verified sender identity.
it: Suggerimento: se l'errore riguarda la verifica dell'identità del mittente in SendGrid, e hai già completato la procedura in SendGrid, potrebbe essere necessario aggiornare la variabile di config DEFAULT_FROM_EMAIL in Heroku per corrispondere all'identità verificata del mittente.

source: There was an error sending the test email: %(error)s
it: Si è verificato un errore durante l'invio dell'email di prova: %(error)s

source: A test email has been sent to %(recipient)s.
it: Un'email di prova è stata inviata a %(recipient)s.

source: N/A
it: N/D

source: Not known
it: Sconosciuto

source: Timeline
it: Sequenza

source: Participant
it: Partecipante

source: Status
it: Stato

source: Time
it: Ora

source: Email Participants
it: Email Partecipanti

source: %(email_count)s email has been queued for sending.
it: %(email_count)s email è stata accodata per l'invio.

source: No emails were sent — likely because no recipients were selected.
it: Nessuna email è stata inviata, probabilmente perché non è stato selezionato nessun destinatario.

source: Send Email
it: Invia email

source: Not Provided
it: Non fornito

source: Role
it: Ruolo

source: Adjudicator
it: Giudice

source: Speakers
it: Speaker

source: Adjudicators
it: GiudicI
