Repository: tara-45/tabby8
Catalog: tabbycat/locale/*/LC_MESSAGES/djangojs.po
Languages: id, tr

source: Scan Using Camera
id: Pindai Menggunakan Kamera
tr: Kamera Kullanarak Tara

source: Stop Camera Scan
id: Hentikan Pindaian Kamera
tr: Kamera Taramasını Durdur

source: Turn On Sounds
id: Nyalakan Suara
tr: Sesleri Aç

source: %1 checked in %2: %3
id: %1 men-cek in %2: %3
tr: %1 %2'ye giriş yaptı: %3

source: All
id: Semua
tr: Tüm

source: By %1
id: Oleh %1
tr: %1'e göre

source: No matching rooms found.
id: Ruangan yang cocok tidak ditemukan.
tr: Eşleşen oda bulunamadı.

source: No matching people found.
id: Orang yang cocok tidak ditemukan.
tr: Eşleşen kişi bulunamadı.

source: This page will live-update with new check-ins as they occur although the initial list may be up to a minute old.
id: Laman ini akan terbarui secara live dengan cek-in baru saat terjadi walaupun daftar inisial akan berumur satu menit.
tr: Bu sayfa, ilk liste en fazla bir dakika gecikmeli olsa da, gerçekleştikleri anda yeni girişlerle canlı olarak güncellenecektir.

source: <strong>✓</strong> All
id: <strong>✓</strong> Semua
tr: <strong>✓</strong> Tümü

source: <strong>☓</strong> All
id: <strong>☓</strong> Semua
tr: <strong>☓</strong> Tümü

source: Click to check-in manually
id: Klik untuk cek-in secara manual
tr: Elle giriş yapmak için tıklayın

source: saving...
id: menyimpan...
tr: kaydediliyor...

source: This person does not have a check-in identifier so they can't be checked in
id: Orang ini tidak memiliki pengidentifikasi cek-in sehingga ybs tidak dapat di cek-in
tr: Bu kişinin bir giriş tanımlayıcısı yok, bu nedenle giriş yapamıyor

source: If you want to view this page without the sidebar (i.e. for displaying to an auditorium) you can use the assistant version.
id: Jika Anda ingin melihat laman ini tanpa papantepi (misalkan, untuk menampilkan di auditorium), Anda bisa menggunakan versi asisten.
tr: Bu sayfayı kenar çubuğu olmadan görüntülemek istiyorsanız (yani bir oditoryumda görüntülemek için) yardımcı sürümü kullanabilirsiniz.

source: Open the assistant version.
id: Buka versi asisten.
tr: Yardımcı sürümünü açın.

source: Click to undo a check-in
id: Klik untuk membatalkan sebuah cek-in
tr: Girişi geri almak için tıklayın

source: %1, a %2 of no institutional affiliation with identifier of %3
id: %1, sebuah %2 dari tanpa afiliasi institusional dengan pengidentifikasi %3
tr: %1, %3 tanımlayıcısı ile kurumsal bağlantısı olmayan %2'si

source: %1, a %2 of no institutional affiliation with no assigned identifier
id: %1, sebuah %2 dari tanpa afiliasi institusional dengan tanpa pengidentifikasi yang ditentukan
tr: %1, atanmış tanımlayıcısı olmayan kurumsal bir ilişkinin %2'si

source: %1, a %2 from %3 with identifier of %4
id: %1, sebuah %2 dari %3 dengan pengidentifikasi dari %4
tr: %1, %3'ten %4 tanımlayıcılı bir %2

source: %1, a %2 from %3 with no assigned identifier
id: %1, sebuah %2 dari %3 dengan tanpa pengidentifikasi ditentukan
tr: %1, atanmış tanımlayıcı olmadan %3'ten bir %2

source: %1 (Present; id=%2)
id: %1 (Hadir; id=%2)
tr: %1 (Mevcut; id=%2)

source: %1 (Absent; id=%2)
id: %1 (Absen; id=%2)
tr: %1 (Yok; id=%2)

source: %1, a team with speakers %2
id: %1, sebuah tim dengan pembicara %2
tr: %1, konuşmacılı bir ekip %2

source: %1, a %2
id: %1, sebuah %2
tr: %1, bir %2

source: Anonymous (due to team codes)
id: Anonim (karena kode tim)
tr: Anonim (takım kodları nedeniyle)

source: Independent
id: Independen
tr: Bağımsız

source: %1 (%2) with identifier of %3
id: %1 (%2) dengan penanda %3
tr: %1 (%2), %3 tanımlayıcısı ile

source: %1 (no category) with identifier of %2
id: %1 (tidak ada kategori) dengan pengenal dari %2
tr: %1 (kategori yok) ve %2 tanımlayıcısı

source: %1 (%2) with no assigned identifier
id: %1 (%2) tanpa pengenal yang ditetapkan
tr: %1 (%2) atanmış tanımlayıcı yok

source: %1 (no category) with no assigned identifier
id: %1 (tanpa kategori) tanpa pengenal yang ditetapkan
tr: %1 (kategori yok) atanmış tanımlayıcı yok

source: Uncategorised
id: Tidak terkategorisasi
tr: Kategorize edilmemiş

source: No Category
id: Tanpa Kategori
tr: Kategori Yok

source: Priority %1
id: Prioritas %1
tr: Öncelik %1

source: %1 %2 from %3
id: %1 %2 dari %3
tr: %1 %2'den %3

source: %1 %2 from %3 %4
id: %1 %2 dari %3 %4
tr: %1 %2'den %3 %4

source: %1 %2 from %3 on %4 (Chair)
id: %1 %2 dari %3 di %4 (Kursi)
tr: %1 %2'den %3'e %4 (Başkan)

source: %1 %2 from %3 on %4 (Panellist)
id: %1 %2 dari %3 di %4 (panelis)
tr: %1 %2'den %3'e kadar% 4 (Panelist)

source: %1 %2 from %3 on %4 (Trainee)
id: %1 %2 dari %3 di %4 (Peserta Pelatihan)
tr: %1 %2'den %3'e %4 (Acem,)

source: ID %1,
tr: Kimlik %1,

source: Room:
id: Ruangan:
tr: Oda:

source: Chair for Panel of %1
id: Kursi untuk panel %1
tr: %1 Paneli Başkanı

source: Solo Chair
id: Kursi Solo
tr: Tek Başkan

source: Panellist
id: Panelis
tr: Panelist

source: Trainee
id: Peserta pelatihan
tr: Acemi

source: Team
id: Tim
tr: Takım

source: Mark speeches %1 to %2; <strong>%3</strong>.
id: Tandai pidato %1 to %2; <strong>%3</strong>.
tr: Konuşmaları %1 ila %2 arasında puanlayın;<strong>%3</strong>.

source: Mark replies %1 to %2; <strong>%3</strong>.
id: Tandai balasan %1 ke %2; <strong>%3</strong>.
tr: Yanıtları %1 ile %2 arası puanlayın; <strong>%3</strong>.

source: Return ballots to %1.
id: Kembalikan surat suara ke %1.
tr: Ballotları %1'e döndürün.

source: The motion is <em>%1</em>
id: Pergerakannya adalah <em>%1</em>
tr: Önerge <em>%1</em'dir>

source: Debated
id: Diperdebatkan
tr: Tartışılan

source: Circle %1
id: Lingkaran %1
tr: %1 yuvarlak içine al

source: Aff Veto
tr: Hükumet Veto

source: Neg Veto
tr: Muhalefet Veto

source: tab entry
id: Tab entri
tr: tab girişi

source: tab check
id: Tab cek
tr: tab kontrolü

source: Unaffiliated
id: Tidak terafiliasi
tr: Bağımsız

source: no ½ marks
id: Tidak ada ½ tanda
tr: yarım puan yok

source: ½ marks are allowed
id: ½ tanda diperbolehkan
tr: yarım puan var

source: decimal marks are allowed
id: Tanda desimal diperbolehkan
tr: ondalık işaretlere izin verilir

source: Adjudicating with %1.
id: Mengadili dengan %1.
tr: %1 ile jüri görevinde

source: Did %1 deliver the adjudication?
id: Apakah %1 menyampaikan putusan tersebut?
tr: %1'i kararı verdi mi?

source: Yes
id: Ya
tr: Evet

source: No, I am submitting feedback on:
id: Tidak, saya menyerahkah umpan balik pada:
tr: Hayır, aşağıdakilerle ilgili geri bildirim gönderiyorum:

source: Unsure
id: Tidak yakin
tr: Emin değilim

source: No
id: Tidak
tr: Hayır

source: Which team won the debate:
id: Regu mana yang memenangkan perdebatan:
tr: Tartışmayı hangi takımın kazandığı:

source: By how many points did they win:
id: Dengan berapa nilai mereka menang:
tr: Kaç puanla kazandığı:

source: IMPORTANT: Check and explicitly note if a speaker gives multiple speeches
id: PENTING : Periksa dan catat secara eksplisit jika seorang pembicara memberikan banyak pidato
tr: ÖNEMLİ: Bir konuşmacının birden fazla konuşma yapıp yapmadığını kontrol edin ve açıkça not edin

source: Score:
id: Nilai:
tr: Puan:

source: Circle the last digit of the %1's score:
id: Lingkari angka terakhir dari nilai %1:
tr: %1'in puanının son basamağını daire içine alın:

source: Circle Rank:
id: Peringkat Lingkaran:
tr: Daire Sıralaması:

source: Total:
tr: Toplam:

source: Circle the last digit of the team's total:
id: Lingkarin angka terakhir dari total regu:
tr: Takımın toplamının son basamağını daire içine alın:

source: Find in Table
id: Temukan di Tabel
tr: Tabloda Bul

source: Set All Breaking as Available
id: Tetapkan Semua Kerusakan yang Tersedia
tr: Tüm Break'leri Kullanılabilir Olarak Ayarla

source: Set all the availabilities to exactly match what they were in the previous round.
id: Tetapkan semua ketersediaan agar sama persis dengan keadaan mereka di babak sebelumnya.
tr: Tüm kullanılabilirlikleri bir önceki turdakiyle tam olarak eşleşecek şekilde ayarla.

source: Match
id: Cocok
tr: Eşleştir

source: Set all availabilities to exactly match check-ins.
id: Tetapkan semua ketersediaan ke check-ins yang tepat.
tr: Tüm kullanılabilirlikleri girişlerle tam olarak eşleşecek şekilde ayarlayın.

source: Match Check-Ins
id: Check-Ins yang Tepat
tr: Girişlerle Eşleştir

source: Set people as available only if they have a check-in and are currently unavailable — i.e. it will not overwrite any existing availabilities.
id: Set orang sebagai tersedia hanya jika mereka memiliki check-in dan saat ini tidak tersedia - yaitu tidak akan menimpa ketersediaan yang ada.
tr: Kişileri yalnızca bir giriş işlemi varsa ve şu anda kullanılamıyorsa kullanılabilir olarak ayarlayın - yani mevcut kullanılabilirlikleri silmez.

source: Copy From Check-Ins
id: Salin dari Check in
tr: Girişlerdem Kopyala

source: Ballots Status
id: Status balot
tr: Ballotların Durumu

source: Latest Actions
id: Tindakan Terbaru
tr: Son Eylemler

source: No Actions Yet
id: Belum ada tindakan sama sekali
tr: Henüz İşlem Yok

source: Latest Results
id: Hasil terbaru
tr: Son Sonuçlar

source: No Confirmed Results Yet
id: Belum Ada Hasil Yang Dikonfirmasi
tr: Henüz Doğrulanmış Sonuç Yok

source: Speaker Demographics
id: Demografi Pembicara
tr: Konuşmacı Demografisi

source: No Gender Information
id: Tidak Ada Informasi Gender
tr: Cinsiyet Bilgisi Yok

source: No Speaker Categories Information
id: Tidak Ada Informasi Kategori Pembicara
tr: Konuşmacı Kategorisi Bilgisi Yok

source: Speaker Results
id: Hasil Pembicara
tr: Konuşmacı Sonuçları

source: speakers with gender data
id: pembicara dengan data gender
tr: cinsiyet verileri olan konuşmacılar

source: speaker scores total
id: total skor pembicara
tr: konuşmacı puanları toplamı

source: No Region Information
id: Tidak Ada Informasi Wilayah
tr: Bölge Bilgisi Yok

source: Adjudicator Demographics
id: Demografi Juri
tr: Jüri Demografisi

source: No Position Information
id: Tidak Ada Informasi Posisi
tr: Pozisyon bilgisi yok

source: Adjudicator Results
id: Hasil Juri
tr: Jüri Sonuçları

source: adjudicators with gender data
id: juri dengan data gender
tr: cinsiyet verilerine sahip jüriler

source: feedback scores total
id: total skor penilaian
tr: geri bildirim puanları toplamı

source: No Adjudicator Ratings Information
id: Tidak Ada Informasi Peringkat Juri
tr: Jüri Derecelendirme Bilgileri Yok

source: No Adjudicator-Adjudicator Feedback Information
id: Tidak Ada Informasi Nilai Juri - Juri
tr: Jüri-Jüri Geri Bildirim Bilgisi Yok

source: Checked-In
id: Sudah Cek-In
tr: Girişli

source: Not Checked-In
id: Tidak Check-In
tr: Giriş Yapılmadı

source: Ballot Check-Ins
id: Balot Check-In
tr: Ballot Girişi

source: Unknown
id: Tak diketahui
tr: Bilinmeyen

source: Unconfirmed
id: Tidak Dikonfirmasi
tr: Onaylanmamış

source: Confirmed
id: Terkonfirmasi
tr: Onaylanmış

source: Ballot Statuses
id: Status Balot
tr: Ballot Durumları

source: You cannot confirm this ballot because you entered it
id: Anda tidak bisa mengkonfirmasi balot ini karena Andam telah memasukan nya
tr: Bu ballotu girdiğiniz için onaylayamazsınız

source: Add Ballot
id: Tambah Balot
tr: Ballot ekle

source: Re-Edit
id: Edit kembali
tr: Yeniden Düzenle

source: Review
id: Ulasan
tr: İncele

source: No changes
id: Tidak ada perubahan
tr: Değişiklik yok

source: Return to Draw
id: Kembali Ke Pengundian
tr: Kuraya Dön

source: Auto-Prioritise
id: Prioritas Otomatis
tr: Otomatik Önceliklendirme

source: Auto-Allocate
id: Alokasi Otomatis
tr: Otomatik Tahsis

source: Gender
tr: Cinsiyet

source: Rank
id: Peringkat
tr: Sıralama

source: Region
id: Wilayah
tr: Bölge

source: Category
id: Kategori
tr: Kategori

source: The debate's bracket
id: Kelompok debat
tr: Bu maçın aşaması

source: The bracket range of the hypothetical debate
id: Kisaran braket dari debat hipotetis
tr: Varsayımsal maçın aşama aralığı

source: The total number of live break categories across all teams
id: Jumlah total kategori jeda langsung di semua tim
tr: Tüm takımlardaki mümkün break kategorilerinin toplam sayısı

source: The estimated total number of live break categories across all teams of the hypothetical debate
id: Perkiraan jumlah total kategori istirahat langsung di semua tim debat hipotetis
tr: Varsayımsal tartışmada tüm takımlardaki mümkün break kategorilerinin toplam sayısı

source: This debate's priority
id: Prioritas debat ini
tr: Bu maçın önceliği

source: No code name set
id: Tidak ada nama kode yang ditetapkan
tr: Kod adı ayarlanmadı
