Repository: tara-45/tabby8
Catalog: tabbycat/locale/*/LC_MESSAGES/django.po
Languages: id, tr

source: Please enter a new password (twice):
id: Silakan masukkan password baru (dua kali):
tr: Lütfen yeni parola girin (iki kez):

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
id: Tautan reset kata sandi tidak valid, mungkin karena telah digunakan sebelumnya. Silahkan meminta reset kata sandi baru.
tr: Parola sıfırlama bağlantısı, büyük olasılıkla zaten kullanılmış olması nedeniyle geçersizdi. Lütfen yeni bir parola sıfırlama isteğinde bulunun.

# page title
source: Password reset email sent
id: Email reset kata sandi dikirim
tr: Parola sıfırlama e-postası gönderildi

source: We've emailed you instructions for setting your password, if an account exists with the email address you entered. You should receive them shortly.
id: Kita telah mengirimkan email yang berisi instruksi bagaimana mengubah password anda, apabila ada akun dengan alamat email yang anda masukkan. Anda akan menerima email tersebut segera.
tr: Girdiğiniz e-posta adresiyle bir hesap varsa, parolanızı ayarlamayla ilgili talimatları size e-postayla gönderdik. Kısa sürede size aktarılacaktır.

source: If you don't receive an email, please make sure you've entered the address you registered with, and check your spam folder.
id: Apabila anda tidak menerima email, pastikan bahwa alamat yang anda masukkan benar, dan cek folder spam anda.
tr: E-posta ulaşmazsa, lütfen kaydolduğunuz adresi girdiğinizden emin olun ve spam klasörünüzü kontrol edin.

source: Hi, %(user)s!
id: Hai, %(user)s!
tr: Merhaba, %(user)s!

source: Someone asked for a password reset for the email address %(email)s on the Tabbycat site at %(protocol)s://%(domain)s.
id: Seseorang meminta reset kata sandi untuk email %(email)s pada situs Tabbycat %(protocol)s://%(domain)s.
tr: Birisi Tabbycat sitesindeki %(protocol)s://%(domain)s adresindeki %(email)s e-posta adresi için parola sıfırlama istedi.

source: If this was you, follow the link below to reset your password:
id: Apabila ini anda, silahkan ikuti tautan berikut untuk reset password anda:
tr: Bu sizseniz, parolanızı sıfırlamak için aşağıdaki bağlantıyı izleyin:

source: If this wasn't you, that probably means someone else typed your email address into the password reset form on the Tabbycat site at %(protocol)s://%(domain)s.
id: Apabila ini bukan anda, berarti orang lain memasukkan alamat email anda ke laman reset password di situs Tabbycat %(protocol)s://%(domain)s.
tr: Bu siz değilseniz, bu muhtemelen başka birinin e-posta adresinizi %(protocol)s://%(domain)s adresindeki Tabbycat sitesindeki parola sıfırlama formuna yazdığı anlamına gelir.

source: Enter your email address below, and we'll email you a password reset link.
id: Masukkan alamat e-mail Anda di bawah, dan kami akan mengirimkan Anda tautan untuk reset password.
tr: Aşağıya e-posta adresinizi girin, size bir parola sıfırlama bağlantısı e-postayla gönderelim.

source: Please enter a valid email address.
id: Mohon memasukkan alamat e-mail yang valid.
tr: Lütfen geçerli bir e-posta adresi girin.

# button
source: Reset my password
id: Reset password saya
tr: Parolamı sıfırla

source: Back to the login page
id: Kembali ke halaman login
tr: Oturum açma sayfasına geri dön

source: Password reset on Tabbycat site at %(domain)s
id: Reset password pada situs Tabbycat di %(domain)s
tr: Parola sıfırlama konumu Tabbycat sitesinde: %(domain)s

source: Hi, %(user)s — you just logged in!
id: Hi, %(user)s — Anda baru saja masuk!
tr: Merhaba, %(user)s — az önce oturum açtınız!

source: Welcome! You just logged in!
id: Selamat datang! Anda baru saja masuk!
tr: Hoş geldin! Oturum açtınız!

source: Users with staff status can view and edit the Edit Database area. This is potentially dangerous and should be reserved for the actual tab director(s).
id: Pengguna dengan status staf dapat melihat dan menyunting pada area Sunting Basisdata. Ini bisa berbahaya dan disisihkan untuk direktur tabulasi yang sesungguhnya.
tr: Çalışan durumuna sahip kullanıcılar Veritabanını Düzenle alanını görüntüleyebilir ve düzenleyebilir. Bu tehlikeli olabilir ve puanlama yönetmenleri hariç kullanılmamalıdır.

source: Superusers have full access all areas of Tabbycat necessary to run a tournament. Users who are not superusers are still able to perform data entry tasks such as adding results and feedback but can't access confidential areas such as the Breaks and Feedback sections. Chief adjudicators and their deputies are generally given superuser status if they know what they are doing.
id: Superuser memiliki akses penuh ke semua area dari Tabbycat yang dibutuhkan untuk menjalankan turnamen. Pengguna yang bukan merupakan superuser masih dapat melakukan pekerjaan memasukkan data seperti menambahkan hasil dan umpan balik tetapi tidak dapat mengakses area konfidensial seperti seksi Break dan Umpan balik. Ketua juri dan deputi mereka biasanya diberikan status superuser jika mereka tahu apa yang mereka lakukan.
tr: Süper kullanıcılar, Tabbycat'in bir turnuva düzenlemek için gerekli olan tüm alanlarına tam erişime sahiptir. Süper kullanıcı olmayan kullanıcılar, sonuç ve geri bildirim ekleme gibi veri girişi görevlerini gerçekleştirmeye devam edebilir, ancak Aralar ve Geri Bildirim bölümleri gibi gizli alanlara erişemez. Baş jüri ve yardımcılarına, ne yaptıklarını biliyorlarsa, genellikle süper kullanıcı statüsü verilir.

source: <strong>Warning:</strong> You shouldn't delete users from the database once they've done something, because the database logs actions taken by those users, and deleting the users also deletes the related logs. If you wish to deactivate a user account, go back to edit the user, click on the “Permissions” tab, unchecked the “Active” box, and save the user.
id: <strong>Perhatian:</strong> Anda tidak semestinya menghapus pengguna dari basisdata setelah mereka melakukan sesuatu, karena basisdata mencatat aksi-aksi yang dilakukan oleh pengguna tersebut, dan menghapus penggunanya berarti menghapus catatannya juga. Jika Anda ingin mendeaktivasi akun pengguna, kembali untuk menyuntin penggunanya, klik pada tab "Hak akses", hapus cek pada kotak "Aktif", dan simpan penggunanya.
tr: <strong>Uyarı:</strong> Bir şey yaptıktan sonra kullanıcıları veritabanından silmemelisiniz, çünkü veritabanı bu kullanıcılar tarafından gerçekleştirilen eylemleri günlüğe kaydeder ve kullanıcıları silmek ilgili günlükleri de siler. Bir kullanıcı hesabını devre dışı bırakmak istiyorsanız, kullanıcıyı düzenlemek için geri dönün, "İzinler" sekmesine tıklayın, "Etkin" kutusunun işaretini kaldırın ve kullanıcıyı kaydedin.

source: Sign-Up
id: Mendaftar
tr: Kayıt Ol

# page title
source: Create a New Administrator Account
id: Membuat Sebuah Akun Administrator Baru
tr: Yeni Yönetici Hesabı Oluşturma

# page title
source: Create a New Assistant Account
id: Membukan Sebuah Akun Asisten Baru
tr: Yeni Asistan Hesabı Oluşturma

source: Create Account
id: Buat Akun
tr: Hesap Oluştur

source: You have successfully created a new administrator account.
id: Anda telah berhasil membuat sebuah akun administrator baru.
tr: Başarıyla yeni bir yönetici hesabı oluşturdunuz.

source: You have successfully created a new assistant account.
id: Anda telah berhasil membuat sebuah akun asisten baru.
tr: Başarıyla yeni bir asistan hesabı oluşturdunuz.

source: Whoops! It looks like someone's already created the first user account. Please log in.
id: Ups! Sepertinya seseorang telah membuat akun pengguna pertama. Silahkan masuk.
tr: Birisi ilk kullanıcı hesabını zaten oluşturmuş gibi görünüyor. Lütfen oturum açın.

source: Welcome! You've created an account for %s.
id: Selamat datang! Anda telah membuat akun untuk %s.
tr: Hoş geldin! %s için bir hesap oluşturdunuz.
