Repository: tara-45/tabby8
Catalog: tabbycat/locale/*/LC_MESSAGES/django.po
Languages: id, tr

source: Application Programming Interface
tr: Uygulama Programlama Arayüzü

source: Type
tr: Tür

source: Checkin time
tr: Giriş zamanı

source: Check-Ins
id: Cek-In
tr: Girişler

source: Sent checkin identifier doesn't exist
id: Pengenal cek-in yang terkirim tidak ada
tr: Gönderilen giriş tanımlayıcısı mevcut değil

source: Checkins
id: Cek-in
tr: Giriş işlemleri

source: No checkin identifiers exist for sent barcodes
id: Tidak ada pengenal cek-in untuk barcode yang dikirim
tr: Gönderilen barkodlar için giriş tanımlayıcısı yok

source: The barcode must contain exactly six digits.
id: Barcode harus memiliki tepat enam dijit.
tr: Barkod tam altı basamaktan oluşmalıdır.

source: barcode
tr: barkod

source: <Not the child instance>
id: <Bukan instansiasi anak>
tr: <Alt örnek değil>

source: person
id: orang
tr: kişi

source: person identifier
id: pengenal orang
tr: kişi tanımlayıcı

source: person identifiers
id: pengenal orang
tr: kişi tanımlayıcıları

source: debate
id: debat
tr: maç

source: debate identifier
id: pengenal deba
tr: maç tanımlayıcısı

source: debate identifiers
id: pengenal deba
tr: maç tanımlayıcıları

source: room identifier
id: pengenal ruangan
tr: oda tanımlayıcı

source: room identifiers
id: pengenal ruangan
tr: oda tanımlayıcıları

source: identifier
id: pengenal
tr: Tanımlayıcı

source: check-in time
id: waktu cek-in
tr: giriş saati

source: tournament
id: turnamen
tr: turnuva

source: check-in event
id: kejadian cek-in
tr: giriş etkinliği

source: check-in events
id: kejadian cek-in
tr: giriş etkinlikleri

source: With identifiers
id: Dengan pengenal
tr: Tanımlayıcılarla

source: View as barcodes
id: Lihat sebagai barcode
tr: Barkod olarak görüntüle

source: Generate missing identifiers
id: Bangkitkan pengenal yang hilang
tr: Eksik tanımlayıcıları oluştur

source: Generate all identifiers
id: Bangkitkan semua pengenal
tr: Tüm tanımlayıcıları oluştur

source: There are no identifiers available to view. An admin will need to generate them.
id: Tidak ada pengenal yang tersedia untuk dilihat. Seorang admin perlu membangkitkannya.
tr: Görüntülenebilecek tanımlayıcı yok. Bir yöneticinin bunları oluşturması gerekli.

source: Each of the barcodes below is also an image file that can be downloaded individually. If you want to download them all at once try using a 'bulk downloader' extension/plugin for your browser, such as <a href="https://chrome.google.com/webstore/detail/svg-export/naeaaedieihlkmdajjefioajbbdbdjgp?hl=en-GB">this one (for Chrome)</a>. To download them as a list you can go to Check-Ins section of the Edit Database area and copy/paste from the relevant table.
tr: Aşağıdaki barkodların her biri aynı zamanda ayrı ayrı indirilebilen bir görüntü dosyasıdır. Hepsini bir kerede indirmek istiyorsanız, tarayıcınız için <a href="https://chrome.google.com/webstore/detail/svg-export/naeaaedieihlkmdajjefioajbbdbdjgp?hl=en-GB">bunun gibi (Chrome için)</a> bir toplu indirici uzantısı/eklentisi kullanmayı deneyin. Bunları liste olarak indirmek için Veritabanını Düzenle alanının giriş bölümüne gidebilir ve ilgili tablodan kopyalayıp yapıştırabilirsiniz.

source: You can use Ctrl+P for printing or saving the barcodes PDF. Be sure to set the appropriate <strong>page orientation</strong>, to turn off <strong>headers/footers</strong> and turn on <strong>background graphics</strong>. Works best in Chrome.
id: Anda bisa menggunakan Ctrl+P untuk mencetak atau menyimpan PDF barcode. Jangan lupa untuk mengatur <strong>orientasi halaman</strong> yang sesuai, mematikan <strong>header/footer</strong>, dan menyalakan <strong>gambar latar belakang</strong>. Bekerja paling baik di Chrome.
tr: Barkodlar PDF olarak yazdırmak veya kaydetmek için Ctrl+P'yi kullanabilirsiniz. <strong>üstbilgiler/altbilgileri</strong> kapatmayı, doğru <strong>sayfa yönünü kullanmayı</strong> ve <strong>arkaplan görsellerini</strong> açmayı unutmayın. En iyi Chrome'da çalışır.

source: To scan an identifier type the number below (it will auto-submit). You can also use a barcode scanner (configured to work as a keyboard) or scan from a webcam or phone camera using the button below.
id: Untuk memindai sebuah penanda ketikkan angka di bawah (akan otomatis terkirim). Anda juga bisa menggunakan pemindai barcode (terkonfigurasi untuk bekerja sebagai keyboard) atau pindah dari webcam atau kamera ponsel dengan menggunakan tombol di bawah.
tr: Bir tanımlayıcıyı taramak için aşağıdaki numarayı yazın (Otomatik gönderilir). Ayrıca bir barkod tarayıcı (klavye olarak çalışacak şekilde ayarladıysa) kullanabilir veya aşağıdaki düğmeyi kullanarak bir webcam veya telefon kamerasından tarama yapabilirsiniz.

source: Not checked in (barcode %(barcode)s)
id: Tidak tercek-in (barcode %(barcode)s)
tr: Giriş yapılmadı (barkod %(barcode)s)

source: Not checked in; no barcode assigned
id: Tidak tercek-in; tidak ada barcode yang dipasangkan
tr: Giriş yapılmadı; barkod atanmamış

source: checked in at %(time)s
id: cek-in pada %(time)s
tr: Giriş zamamı: %(time)s

source: %(speaker)s checked in at %(time)s.
id: %(speaker)s cek-in pada %(time)s.
tr: %(speaker)s giriş zamanı %(time)s.

source: %(speaker)s is missing.
id: %(speaker)s tidak ada.
tr: %(speaker)s eksik.

source: Scan Identifiers
id: Pindah penanda
tr: Tanımlayıcıları Tara

source: People's Check-In Statuses
id: Status Cek-in Orang-Orang
tr: Kişilerin Giriş Durumları

source: Rooms' Check-In Statuses
id: Status Cek-In Ruangan-Ruangan
tr: Odaların Giriş Durumları

source: Make Identifiers
id: Buat Penanda
tr: Tanımlayıcılar Oluştur

source: Speakers
id: Pembicara
tr: Konuşmacılar

source: Adjudicators
id: Juri
tr: Jüriler

source: Rooms
id: Ruangan
tr: Odalar

source: Generated identifiers for %s
id: Penanda untuk %s dibangkitkan
tr: %s için tanımlayıcılar oluşturuldu

source: Identifiers
id: Penanda
tr: Tanımlayıcı

source: Could not check you in as you do not have an identifying code — your tab director may need to make you an identifier.
id: Tidak dapat melakukan cek-in untuk Anda karena Anda tidak memiliki kode penanda — direktur tabulasi Anda mungkin perlu membuatkan Anda sebuah penanda.
tr: Tanımlayıcı kodunuz olmadığı için giriş yapılamadı — tab yöneticinizin sizi bir tanımlayıcı yapması gerekebilir.

source: You have revoked your check-in.
id: Anda telah membatalkan cek-in Anda.
tr: Giriş işleminizi iptal ettiniz.

source: Whoops! Looks like your check-in was already revoked.
id: Ups! Sepertinya cek-in Anda sudah dibatalkan sebelumnya.
tr: Giriş işleminiz zaten iptal edilmiş.

source: Whoops! Looks like you're already checked in.
id: Ups! Sepertinya Anda sudah cek-in sebelumnya.
tr: Zaten giriş yapmışsınız.

source: You are now checked in.
id: Anda sekarang tercek-in.
tr: Artık giriş yaptınız.

source: Bengali
tr: Bengal Dili

source: Indonesian
id: Bahasa Indonesia
tr: Endonezya dili

source: Simplified Chinese
id: Mandarin yang Disederhanakan
tr: Basitleştirilmiş Çince

source: Translation
id: Terjemahan
tr: Çeviri

source: You need to delete the above objects first.
id: Anda perlu menghapus objek-objek di atas terlebih dahulu.
tr: Önce yukarıdaki nesneleri silmeniz gerekir.

source: This style of info card announces critical information. <a href="">Link</a>.
id: Kartu informasi seperti ini mengumumkan informasi penting. <a href="">Link</a>.
tr: Bu bilgi kartı stili kritik bilgileri bildirir. <a href="">Link</a>.

source: This style of info card announces general <a href="">information</a>.
id: Kartu informasi seperti ini mengumumkan <a href="">informasi</a> umum.
tr: Bu bilgi kartı stili genel <a href="">information</a> bildirir.

# page title
source: Form Title
id: Judul Formulir
tr: Form Başlığı

source: Sub Title Title
id: Subjudul Judul
tr: Alt Başlık Başlığı

# button
source: Log In
id: Masuk
tr: Oturum Aç

# button
source: I forgot my password
id: Saya lupa password saya
tr: Parolamı unuttum

source: The tab for %(tournament)s runs on Tabbycat, a source-available tab system for a variety of parliamentary debating formats
id: Tabulasi untuk %(tournament)s berjalan di atas Tabbycat, sebuah sistem tabulasi kode-terbuka untuk berbagai macam format debat parlementer
tr: %(tournament)s için tab, çeşitli parlamenter tartışma biçimleri için kullanılabilen açık kaynaklı bir tab sistemi Tabbycat kullanıyor.

source: This tab runs on Tabbycat, a source-available tab system for a variety of parliamentary debating formats
id: Tabulasi ini berjalan di atas Tabbycat, sebuah sistem tabulasi kode-terbuka untuk berbagai macam format debat parlementer
tr: Bu tab, çeşitli parlamenter tartışma biçimleri için kullanılabilen açık kaynaklı bir tab sistemi Tabbycat ikullanıyor.

source: Whoops! There was an error with one or more fields.
id: Ups! Sepertinya ada kesalahan pada satu atau lebih kolom.
tr: Bir veya daha fazla alanda hata oluştu.

source: Save and Add More
id: Simpan dan Tambahkan Lagi
tr: Kaydet ve Daha Fazla Ekle

source: Permission Denied (403)
id: Akses Tidak Diijinkan (403)
tr: Erişim Red Edildi (403)

source: This assistant page isn't enabled for this tournament. <a href="%(url)s">Back to the assistant home page.</a>
id: Asisten halaman ini tidak dinyalakan untuk turnamen ini. <a href="%(url)s">Kembali ke beranda halaman asisten.</a>
tr: Bu asistan sayfası bu turnuva için etkinleştirilmemiştir. <a href="%(url)s">Asistan ana sayfasina geri dön.</a>

source: You're currently using %(nrows)s row in your database. If you haven't already upgraded your Heroku database to a paid tier, it's limited to a maximum of 10,000 rows. As you're close to this limit, you should <strong>not create new tournaments</strong> on this site unless and until you've <a href="https://devcenter.heroku.com/articles/upgrading-heroku-postgres-databases">upgraded your database</a> to a paid tier.
id: Saat ini Anda menggunakan %(nrows)s baris di dalam basisdata Anda. Jika Anda belum meningkatkan basisdata Heroku Anda ke tingkat berbayar, ini akan dibatasi oleh 10.000 baris. Karena Anda dekat dengan batas ini, Anda sebaiknya <strong>tidak membuat turnamen baru</strong> pada situs ini kecuali dan sampai Anda <a href="https://devcenter.heroku.com/articles/upgrading-heroku-postgres-databases">meningkatkan basisdata Anda</a> ke tingkat berbayar.
tr: Şu anda veritabanınızda %(nrows) satır kullanıyorsunuz. Heroku veritabanınızı henüz ücretli bir seviyeye yükseltmediyseniz, en fazla 10.000 satı kullanabilirsiniz. Bu sınıra yakın olduğunuz için, <a href="https://devcenter.heroku.com/articles/upgrading-heroku-postgres-databases">veritabanınızı ücretli bir seviyeye yükseltmediğiniz sürece</a> yeni turnuvalar <strong>oluşturmamalısınız.<strong>

source: It looks like you're using the old SendGrid config vars on Heroku, <code>SENDGRID_USERNAME</code> and <code>SENDGRID_PASSWORD</code>. These are now deprecated (as of version 2.6), and will stop working in a future version of Tabbycat. Please change your config vars to use <code>SENDGRID_API_KEY</code> instead. For more information, please see <a href="https://tabbycat.readthedocs.io/en/stable/features/notifications.html#configuring-an-email-provider"> our documentation on this topic</a>.
id: Sepertinya anda menggunakan konfigurasi lama dari SendGrid config vars pada Heroku, <code>SENDGRID_USERNAME</code> dan <code>SENDGRID_PASSWORD</code>. Konfigurasi tersebut sudah tidak digunakan lagi (semenjak versi 2.6), dan akan berhenti digunakan untuk versi-versi terbaru Tabbycat. Mohon ubah config vars menjadi <code>SENDGRID_API_KEY</code>. Untuk informasi lebih lanjutkan, silahkan membaca <ahref="https://tabbycat.readthedocs.io/en/stable/features/notifications.html#configuring-an-email-provider"> untuk dokumentasi dari kami mengenai topik ini.
tr: Eski Heroku SendGrid config değişkenlerini (<code>SENDGRID_USERNAME</code> ve <code>SENDGRID_PASSWORD</code>.) kullanıyorsunuz gibi duruyor. Bunlar artık kullanımdan kaldırılmıştır (sürüm 2.6'dan itibaren) ve Tabbycat'in gelecekteki bir sürümünde çalışmayı durduracaktır. Lütfen yapılandırma değişkenlerinizi bunun yerine <code>SENDGRID_API_KEY</code> kullanacak şekilde değiştirin. Daha fazla bilgi için lütfen <a href="https://tabbycat.readthedocs.io/en/stable/features/notifications.html#configuring-an-email-provider"> bu linke bakın.</a>.

source: Whoops! This page isn't enabled for this tournament. <a href="%(url)s">Back to the tournament home page.</a>
id: Ups! Halaman ini tidak dinyalakan untuk turnamen ini. <a href="%(url)s">Kembali ke halaman beranda turnamen.</a>
tr: Bu sayfa bu turnuva için etkinleştirilmemiştir. <a href="%(url)s">Turnuva ana sayfasına geri dön.</a>

source: Whoops! This page isn't enabled for this tournament. <a href="%(url)s">Back to the home page.</a>
id: Ups! Halaman ini tidak dinyalakan untuk turnamen ini. <a href="%(url)s">Kembali ke halaman beranda.</a>
tr: Bu sayfa bu turnuva için etkinleştirilmemiştir. <a href="%(url)s">Ana sayfaya geri dön.</a>

source: %(tournament)s runs on Tabbycat %(tabbycat_version)s (%(tabbycat_codename)s)
id: %(tournament)s berjalan di atas Tabbycat %(tabbycat_version)s (%(tabbycat_codename)s)
tr: %(tournament)s Tabbycat %(tabbycat_version)s (%(tabbycat_codename)s) kullanıyor.

source: This site runs on Tabbycat %(tabbycat_version)s (%(tabbycat_codename)s)
id: Situs ini berjalan di atas %(tabbycat_version)s (%(tabbycat_codename)s)
tr: Bu site Tabbycat %(tabbycat_version)s (%(tabbycat_codename)s) kullanıyor.

source: Tabbycat is a source-available project developed by volunteers, and is free to use for tabbing non-profit, non-fundraising tournaments.
id: Tabbycat adalah proyek kode-terbuka yang dibangun oleh relawan, dan gratis digunakan untuk tabulasi turnamen non-profit dan bukan bersifat penggalangan dana.
tr: Tabbycat, gönüllüler tarafından geliştirilmiş ve açık kaynak bir projedir ve kar amacı gütmeyen, bağış toplama amaçı olmayan turnuvalada kullanımı ücretsizdir.

source: For a tournament of this size, we suggest <a href="https://opencollective.com/tabbycat/contribute/licensing-29466/checkout?amount=%(amount)s">a donation of <strong>$%(amount)s</strong></a>.
id: Untuk turnamen seukuran ini, kami menyarankan<a href="https://opencollective.com/tabbycat/contribute/licensing-29466/checkout?amount=%(amount)s"> donasi sebesar <strong>$%(amount)s</strong></a>.
tr: Bu büyüklükte bir turnuva için <a href="https://opencollective.com/tabbycat/contribute/licensing-29466/checkout?amount=%(amount)s"> <strong>$%(amount)s</strong> kadar bir bağış yapmanızı öneriyoruz.</a>.

source: Learn more about donating.
id: Pelajari lebih lanjut tentang berdonasi.
tr: Bağış yapma hakkında daha fazla bilgi edinin.

source: <a href="https://opencollective.com/tabbycat">Donations to Tabbycat from individuals or organisations</a> are much appreciated.
id: <a href="https://opencollective.com/tabbycat">Donasi untuk Tabbycat dari individu atau organisasi</a> sangat dihargai.
tr: <a href="https://opencollective.com/tabbycat"> Bireylerden veya kurumlardan Tabbycat'e yapılan bağışlar</a> çok takdir edilmektedir.

source: Still timing debates with the stopwatch app?
id: Masih mengukur waktu debat dengan aplikasi stopwatch?
tr: Hala kronometre ile mi zaman tutuyorsunuz?

source: Using an app designed for debate timekeeping makes speaking and adjudicating easier! Check out <a href="https://itunes.apple.com/app/apple-store/id1156065589?pt=814172&ct=Tabbycat%%20Installs&mt=8">Timekept</a> (iPhone/iPad) or <a href="https://play.google.com/store/apps/details?id=net.czlee.debatekeeper&referrer=utm_source%%3Dtabbycat%%26utm_medium%%3Dfooter">Debatekeeper</a> (Android).
id: Menggunakan aplikasi yang didesain untuk mengukur waktu debat membuat berbicara dan menjurikan lebih mudah! Cek <a href="https://itunes.apple.com/app/apple-store/id1156065589?pt=814172&ct=Tabbycat%%20Installs&mt=8">Timekept</a> (iPhone/iPad) or <a href="https://play.google.com/store/apps/details?id=net.czlee.debatekeeper&referrer=utm_source%%3Dtabbycat%%26utm_medium%%3Dfooter">Debatekeeper</a> (Android).
tr: Tartışma zaman işleyişi için tasarlanmış bir uygulama kullanmak, konuşmayı ve karar vermeyi kolaylaştırır! href="https://itunes.apple.com/app/apple-store/id1156065589?pt=814172&ct=Tabbycat%%20Installs&mt=8">Timekept</a> (iPhone/iPad) veya <a href="https://play.google.com/store/apps/details?id=net.czlee.debatekeeper&referrer=utm_source%%3Dtabbycat%%26utm_medium%%3Dfooter">Debatekeeper</a> (Android).

source: Our Organisation
id: Organisasi Kami
tr: Kurumumuz

source: Tabbycat is supported by the <a href="https://tabbycat-debate.org/">Tabbycat Debate Association</a>, a non-profit for advancing open debate technology.
tr: Tabbycat, açık kaynaklı tartışma teknolojisini ilerletmek için kar amacı gütmeyen bir kuruluş olan <a href="https://tabbycat-debate.org/">Tabbycat Tartışma Derneği</a> tarafından desteklenmektedir.

source: Language
id: Bahasa
tr: Dil

source: Documentation
id: Dokumentasi
tr: Belgeler

source: Support
id: Dukungan
tr: Destek

source: Set Up A Copy
id: Buat Duplikatnya
tr: Kopyasını Yap

source: Change Language
id: Ubah Bahasa
tr: Dili Değiştir

source: Use this language
id: Gunakan bahasa ini
tr: Bu dili kullan

source: Tabbycat Logo
id: Logo Tabbycat
tr: Tabbycat Logosu

source: Site Home
id: Beranda Situs
tr: Site Ana Sayfası

source: New Tournament
id: Turnamen Baru
tr: Yeni Turnuva

source: Edit Database
id: Sunting Basisdata
tr: Veritabanını Düzenle

source: Admin Area
id: Area Admin
tr: Yönetici Alanı

source: Assistant Area
id: Area Asisten
tr: Asistan Alanı

source: Public Area
id: Area Publik
tr: Genel Alan

source: Overview
id: Tinjauan
tr: Genel bakış

source: Setup
id: Siapkan
tr: Kurulum

source: Configuration
id: Konfigurasi
tr: Ayarlama

source: Import Data
id: Impor Data
tr: İçe Veri Aktar

source: Participants
id: Partisipan
tr: Katılımcılar

source: Private URLs
id: URL Privat
tr: Özel URL'ler

source: Emails
id: Email
tr: E-postalar

source: Preformed Panels
id: Rancangan Panel
tr: Önceden kurulmuş paneller

source: Export XML
id: Ekspor XML
tr: Dışa XML Aktar

source: Sides
id: Sisi
tr: Taraflar

source: People's Status
id: Status Orang
tr: Kişilerin Durumu

source: Rooms' Status
id: Status Ruangan
tr: Odaların Durumu

source: Feedback
id: Penilaian Juri
tr: Geri bildirim

source: Latest
id: Terbaru
tr: Sonuncu

source: Important
id: Penting
tr: Önemli

source: Comments
id: Komentar
tr: Yorumlar

source: Find by Source
id: Temukan berdasarkan Sumber
tr: Kaynağa Göre Bul

source: Find by Target
id: Temukan berdasarkan Target
tr: Hedefe Göre Bul

source: Unsubmitted
id: Belum Diterima
tr: Gönderilmemiş

source: Add Feedback
id: Tambahkan Penilaian
tr: Geri bildirim ekle

source: Bulk Update
id: Pembaruan Sekaligus
tr: Toplu Güncelleme

source: Standings
id: Urutan
tr: Sıralamalar

source: All Teams
id: Semua Tim
tr: Tüm Takımlar

source: Teams
id: Tim
tr: Takımlar

source: %(category)s Teams
id: %(category)s Tim
tr: %(category)s Takımlar

source: All Speakers
id: Semua Pembicara
tr: Tüm Konuşmacılar

source: %(category)s Speakers
id: Pembicara kategori %(category)s
tr: %(category)s Konuşmacılar

source: Replies
id: Tanggapan
tr: Yanıtlar

source: Motions
id: Mosi
tr: Önergeler

source: Diversity
id: Keberagaman
tr: Çeşitlilik

source: Breaks
id: Break
tr: Breakler

source: Adjudicators'
id: Milik Juri
tr: Jürilerin

source: Edit Categories
id: Sunting Kategori
tr: Kategorileri Düzenle

source: Edit Eligibility
id: Sunting Kelayakan
tr: Uygunluğu Düzenle

source: Log Out
id: Keluar
tr: Oturumu Kapat

source: Enter Results
id: Masukkan Hasil
tr: Sonuç Gir

source: Enter Feedback
id: Berikan Penilaian
tr: Geri Bildirim Girin

source: Participants List
id: Daftar Partisipan
tr: Katılımcı Listesi

source: Institutions
id: Institusi
tr: Kurumlar

source: Code Names
id: Nama Terkode
tr: Kod İsimler

source: View Identifiers
id: Lihat Pengenal
tr: Tanımlayıcıları Görüntüle

source: Display/Print Draw
id: Tampilkan/Cetak Draw
tr: Kurayı Göster/Yazdır

source: Team Tab
id: Tabulasi Tim
tr: Takım Tabı

source: Speaker Tab
id: Tabulasi Individu
tr: Konuşmacı Tabı

source: Replies Tab
id: Tabulasi Penyimpul
tr: Özet Tabı

source: Adjudicator Tab
id: Tabulasi Juri
tr: Jüri Tabı

source: Motions Tab
id: Tabulasi Mosi
tr: Önerge Tabı

source: By round
id: Oleh ronde
tr: Tura göre

source: Globally
id: Secara global
tr: Evrensel

source: Draws
id: Draw
tr: Kuralar

source: No Draws Available
id: Tidak Ada Draw yang Tersedia
tr: Kura Yok

source: Draw for %(round)s
id: Draw untuk %(round)s
tr: %(round)s için kura

source: Current Draws
id: Draw saat ini
tr: Şuanki Kuralar

source: Results
id: Hasil
tr: Sonuçlar

source: Feedback Progress
id: Progres Penilaian Juri
tr: Geri Bildirim Durumu

source: Enter Ballot
id: Masukkan Lembar Penjurian
tr: Ballot Gir

source: Availability
id: Ketersediaan
tr: Uygunluk

source: Draw
tr: Kura

source: Display
id: Tampilan
tr: Göster

source: Administrator area for <strong>%(tournament)s</strong>
id: Area Administrator untuk <strong>%(tournament)s</strong>
tr: <strong>%(tournament)s</strong> için yönetici alanı

source: Assistant area for <strong>%(tournament)s</strong>
id: Area Asisten untuk <strong>%(tournament)s</strong>
tr: <strong>%(tournament)s</strong> için asistan alanı

source: Public area for <strong>%(tournament)s</strong>
id: Area Publik untuk <strong>%(tournament)s</strong>
tr: <strong>%(tournament)s</strong> için ortak alan

source: Login
id: Masuk
tr: Oturum Aç

source: Goodbye
id: Selamat tinggal
tr: Hoşçakalın

source: You have been logged out. <a href="%(login_url)s">Log in again?</a>
id: Anda telah keluar. <a href="%(login_url)s">Masuk lagi?</a>
tr: Oturumunuz kapatıldı. <a href="%(login_url)s">Tekrar oturum aç?</a>

# page title
source: Login
id: Masuk
tr: Oturum Aç

# page title
source: Log in to Tabbycat
id: Masuk ke Tabbycat
tr: Tabbycat'te oturum aç.

source: Your username and password didn't match.
id: Nama pengguna dan kata sandi tidak cocok.
tr: Kullanıcı adınız veya parolanız yanlış.

source: Your account doesn't have access to this page. To proceed, please log in with an account that has access.
id: Akun anda tidak memiliki akses ke laman ini. Silahkan masuk dengan akun yang memiliki akses untuk melanjutkan.
tr: Hesabınızın bu sayfaya erişimi yok. Devam etmek için lütfen erişimi olan bir hesapla oturum açın.

source: Please log in to see this page.
id: Silakan masuk untuk melihat laman ini.
tr: Bu sayfayı görmek için lütfen oturum açın.

# page title
source: Password changed
id: Kata sandi diganti
tr: Parola değiştirildi

source: Your password has been changed.
id: Kata sandi anda telah diubah.
tr: Parolanız değiştirildi.

source: Go to the home page
id: Balik ke laman awal
tr: Ana sayfaya git

# page title
source: Password Change
id: Pengubahan Kata Sandi
tr: Parola Değiştirme

source: The API token will allow you to authorize external applications to access the site as staff.
id: API Token akan memberikan aplikasi eksternal otorisasi untuk mengakses situs sebagai staf.
tr: API Tokeni, harici uygulamaları siteye personel olarak erişmeleri için yetkilendirmenize olanak tanır.

source: Please enter your old password, then enter a new one.
id: Masukkan kata sandi lama dan baru anda.
tr: Lütfen eski parolanızı girin, ardından yeni bir parola girin.

# button
source: Change my password
id: Ubah kata sandi saya
tr: Parolamı değiştir

source: Cancel and go back to the site home page
id: Batalkan dan kembali ke laman awal
tr: İptal et ve site ana sayfasına geri dön

source: Your password has been reset.
id: Kata sandi Anda telah di reset.
tr: Parolanız sıfırlandı.

source: Go to the login page
id: Balik ke laman login
tr: Oturum açma sayfasına git

# page title
source: Password Reset Confirmation
id: Konfirmasi Reset Kata Sandi
tr: Parola Sıfırlama Onayı

# page title
source: Password Reset
id: Reset Kata Sandi
tr: Parola Sıfırlama
