Repository: tara-45/tabby8
Catalog: tabbycat/adjallocation/locale/*/LC_MESSAGES/django.po
Languages: id, it, ja, tr, vi

source: There are no available adjudicators. Ensure there are adjudicators who have been marked as available for this round before auto-allocating.
id: Tidak ada juri yang tersedia. Pastikan bahwa ada juri yang telah ditandai kehadirannya untuk menjuri ronde ini sebelum melakukan alokasi otomatis.
it: Non ci sono giudici disponibili. Assicurati che ci siano giudici che sono stati contrassegnati come disponibili per questo round prima dell'auto-assegnazione.
ja: ジャッジ可能な人がいません。自動アロケーションをする前に、ジャッジ可能とマークされている人がいることを確認してください。
tr: Uygun jüri bulunmamaktadır. Otomatik atamadan önce bu tur için uygun olarak işaretlenmiş jüriler olduğundan emin olun.
vi: Hiện tại không có giám khảo nào sẵn sàng. Hãy chắc chắn rằng có giám khảo được đánh dấu sẵn sàng trong vòng này trước khi phân bổ tự động.

source: %(count)s score is larger than the maximum permitted adjudicator score (%(score).1f).
id: %(count)s nilai yang diberikan melewati batas maksimum skor juri yang diizinkan (%(score).1f).
it: Il punteggio %(count)s è più grande del punteggio massimo di giudizio consentito (%(score).1f).
ja: %(count)sスコアがジャッジにつけられる最高点を超えています(%(score).1f)
tr: %(count)'un puanı, izin verilen maksimum jüri puanından (%(score).1f) büyük.
vi: %(count)s điểm lớn hớn điểm cho phép của giám khảo (%(score).1f).

source: %(count)s score is smaller than the minimum permitted adjudicator score (%(score).1f).
id: %(count)s nilai yang diberikan lebih kecil dibanding minimum skor juri yang diijinkan (%(score).1f).
it: Il punteggio %(count)s è più piccolo del punteggio minimo di giudizio consentito (%(score).1f).
ja: %(count)sスコアがジャッジにつけられる最低点を超えています(%(score).1f)
tr: %(count)'un puanı, izin verilen minimum jüri puanından (%(score).1f) küçük.
vi: %(count)s điểm nhỏ hơn điểm cho phép của giám khảo (%(score).1f).

source: There are no adjudicators eligible to be a chair or panellist. Try changing the "Minimum feedback score required to be allocated as chair or panellist" setting to something lower than at least some adjudicators' current scores, and try again.
id: Tidak ada juri yang memiliki nilai yang cukup untuk dapat menjadi ketua panel atau panelis. Coba ubah "nilai minimum untuk dialokasikan menjadi ketua panel atau panelis" menjadi lebih rendah dari skor beberapa juri, dan coba lagi.
it: Non ci sono giudici idonei a essere presidente o membro del panel. Prova a modificare l'impostazione "Punteggio minimo di feedback richiesto per essere assegnato come presidente o membro del panel" almeno ad un punteggio inferiore a quello di alcuni giudici e riprova.
ja: チェア又はパネルに割り当てられるジャッジがいません。 設定から「チェア又はパネルに配置するのに必要なスコアの最低値」を引き下げ、現在のジャッジのスコアより最低限下回るように変更してから、もう一度お試しください。
tr: Başkan veya panelist olmaya uygun jüri yok. "Başkan veya panelist olmak için minimum geri bildirim puanı" ayarını, bazı jürilerin mevcut puanlarından daha düşük bir değerle değiştirin ve yeniden deneyin.
vi: Không có giám khảo nào hợp lệ để làm giám khảo chính hay giám khảo phụ. Hãy thử chỉnh "điểm phản hồi thấp nhất để được phân bổ làm giám khảo chính hoặc giám khảo phụ" xuống thấp hơn điểm của một số giám khảo hiện tại, rồi quay lại.

source: There are no debates for this round. Maybe you haven't created a draw yet?
id: Tidak ada debat untuk ronde ini. Mungkin anda belum membuat draw?
it: Non ci sono dibattiti in questo round. Forse non hai ancora creato un sorteggio?
ja: このラウンドにはディベーターがいません。まだ対戦表を作っていませんか？
tr: Bu tur için herhangi bir maç yok. Belki de henüz bir kura oluşturmadınız?
vi: Hiện tại chưa có trận debate nào trong vòng này. Có thể tại vì bạn chưa tạo bảng đấu?

source: There are %(debate_count)s debates but only %(adj_count)s voting adjudicators.
id: Ada %(debate_count)s debat yang terjadi namun hanya %(adj_count)s yang dapat menjadi ketua panel/panelis.
it: Ci sono %(debate_count)s dibattiti ma solo %(adj_count)s giudici votanti.
ja: %(debate_count)s 試合ありますが、 投票可能なジャッジが%(adj_count)s人しかいません。
tr: %(debate_count) maç var, ancak sadece %(adj_count) oy veren jüri var.
vi: Có %(debate_count)s trận tranh biện nhưng chỉ có %(adj_count)s giám khảo có khả năng bầu.

source: There are %(panel_debates)s panel debates but only %(panellists)s available panellists (less than %(needed)s).
id: Ada %(panel_debates)s debat berpanel namun hanya %(panellists)s panelis yang tersedia (kurang dari %(needed)s).
it: Ci sono %(panel_debates)s giurie di dibattiti ma solo %(panellists)s giudici disponibili (meno di %(needed)s).
ja: %(panel_debates)s つのパネル部屋がありますが、 %(panellists)s 人のパネル( %(needed)s 以下)しかいません。
tr: %(panel_debates) panel maçı var, ancak yalnızca %(panellists) mevcut panelistleri vardır (less than %(needed)s).
vi: Hiện tại có %(panel_debates)s bàn giám khảo nhưng chỉ có %(panellists)s giám khảo phụ sẵn sàng (ít hơn %(needed)s).

source: There are %(debates_count)s debates but only %(voting_count)s voting adjudicators.
id: Ada %(debates_count)s debat yang terjadi namun hanya %(voting_count)s yang dapat menjadi ketua panel/panelis.
it: Ci sono %(debates_count)s dibattiti ma solo %(voting_count)s giudici votanti.
ja: %(debates_count)s 人のディベーターがいますが、%(voting_count)s 人のジャッジしか投票できません。
tr: %(debate_count) maç var, ancak sadece %(voting_count) oy veren jüri var.
vi: Có %(debates_count)s trận tranh biện nhưng chỉ có %(voting_count)s giám khảo có khả năng bầu.

source: Adjudicator Allocation
id: Alokasi juri
it: Assegnazione del giudice
ja: ジャッジ配置
tr: Jüri Tahsisi
vi: Phân bổ giám khảo

source: Draw is already released, unrelease draw to redo auto-allocations.
id: Draw telah dirilis. Batalkan rilis untuk melakukan alokasi otomatis kembali.
it: Il sorteggio è già stato rilasciato, annullare il sorteggio per rifare le allocazioni automatice.
ja: 対戦表が既に公開されてしまっています。ジャッジの自動配置を再度行う場合は一度対戦表を非公開に戻してください。
tr: Kura zaten yayınlanmıştır, otomatik tahsisleri yeniden yapmak için kurayı yayından kaldırın.
vi: Bảng đấu đã được công bố, hủy công bố bảng đấu để tự động phân bổ lại.

source: Draw is not confirmed, confirm draw to run auto-allocations.
id: Draw belum dikonfirmasi. Konfirmasi draw untuk melakukan alokasi otomatis.
it: Il sorteggio non è confermato, conferma il sorteggio per eseguire allocazioni automatice.
ja: 対戦表が確定されていません。ジャッジの自動配置を行うために対戦表を確定させてください。
tr: Kura onaylanmadı, otomatik tahsisleri çalıştırmak için kurayı onaylayın.
vi: Bảng đấu chưa được xác nhận, xác nhận bảng đấu để tự động phân bổ.

source: There are no preformed panels available to allocate.
id: Tidak ada rancangan panel yang tersedia untuk dialokasikan.
it: Non è disponibile nessuna giuria preformata da assegnare.
ja: 配置できるジャッジが用意されていません。
tr: Tahsis edilebilecek önceden kurulmuş panel yok.
vi: Hiện tại không có bàn giám khảo được chỉ định trước nào sẵn sàng để phân bổ.

source: Successfully auto-allocated preformed panels to debates.
id: Sukses melakukan alokasi rancangan panel otomatis kepada debat.
it: Giurie preformate auto-assegnate con successo ai dibattiti.
ja: 事前に用意されたパネルジャッジをディベートに自動で配置することに成功しました。
tr: Önceden kurulmuş paneller maçlara başarıyla otomatik olarak tahsis edildi.
vi: Đã tự động phân bổ thành công bàn giám khảo cho các trận tranh biện.

source: Successfully auto-allocated adjudicators to debates. However, there was a warning:
id: Sukses melakukan alokasi juri secara otomatis. Namun, ada %(count)d peringatan:
it: Giudici auto-assegnati ai dibattiti con successo. Comunque, c'è un avviso:
ja: ディベートにジャッジを自動で割り当てることに成功しました。以下の警告があります（ %(count)d 個）。
tr: Jüriler maçlara başarıyla otomatik olarak tahsis edildi. Ancak, bir uyarı var:
vi: Tự động phân bổ các giám khảo cho các trận tranh biện thành công. Tuy nhiên, có %(count)d cảnh báo:

source: Successfully auto-allocated adjudicators to debates.
id: Sukses melakukan alokasi juri otomatis kepada debat.
it: Giurie preformate auto-assegnate con successo ai dibattiti.
ja: ジャッジを自動で配置することに成功しました。
tr: Jüriler maçlara başarıyla otomatik olarak tahsis edildi.
vi: Tự động phân bổ các giám khảo cho các trận tranh biện thành công.

source: There aren't any panels to fill. Create panels first.
id: Tidak ada panel untuk mengisi. Buat panel terlebih dahulu.
it: Non ci sono giurie da riempire. Crea prima delle giurie.
ja: パネルがいません。まずパネルを作成してください。
tr: Doldurulacak panel yok. Önce panel oluşturun.
vi: Hiện tại không có bàn giám khảo nào để điền. Tạo các bàn giám khảo trước.

source: Successfully auto-allocated adjudicators to preformed panels. However, there was a warning:
id: Sukses melakukan alokasi juri kepada rancangan panel. Namun, ada %(count)d peringatan:
it: Giudici auto-assegnati ai dibattiti con successo. Comunque, c'è un avviso:
ja: 事前設定したパネルににジャッジを自動で割り当てることに成功しました。以下の警告があります（ %(count)d 個）。
tr: Jüriler panellere başarıyla otomatik olarak tahsis edildi. Ancak, bir uyarı var:
vi: Đã tự động phân bổ các giám khảo cho các trận tranh biện thành công. Tuy nhiên, có %(count)d cảnh báo:

source: Successfully auto-allocated adjudicators to preformed panels.
id: Sukses melakukan alokasi juri otomatis kepada rancangan panel.
it: Giudici auto-assegnati con successo alle giurie preformate.
ja: ジャッジを自動で事前に用意されたパネルの枠に配置することに成功しました。
tr: Jüriler panellere başarıyla otomatik olarak tahsis edildi.
vi: Đã tự động phân bổ giám khảo cho các bàn giám khảo thành công.

source: You have no break category set as 'is general' so debate importances can't be calculated.
id: Anda tidak memiliki kategori break yang diset sebagai "umum" sehinga tingkat kepentingan debat tidak dapat dikalkulasi
it: Non hai nessuna categoria di interruzione impostata come 'è generale', quindi le importanze del dibattito non possono essere calcolate.
ja: 「一般」として設定されたブレイクカテゴリーがないため、ディベートの重要度を計算できません。
tr: 'Genel' olarak ayarlanmış bir break kategoriniz olmadığından maç önemleri hesaplanamıyor.

source: Succesfully auto-prioritised debates.
id: Sukses melakukan prioritasisasi debat secara otomatis.
it: Dibattiti prioritarizzati in automatico con successo.
ja: ディベートの優先度の自動設定に成功しました。
tr: Maçlar otomatik önceliklendirildi.
vi: Đã tự động ưu tiên các trận tranh biện thành công.

source: You have no break category set as 'is general' so panel importances can't be calculated.
id: Anda tidak memiliki kategori break yang diset sebagai "umum" sehinga tingkat kepentingan panel tidak dapat dikalkulasi.
it: Non hai nessuna categoria di interruzione impostata come 'è generale', quindi le importanze del dibattito non possono essere calcolate.
ja: 「一般」として設定されたブレイクカテゴリーがないため、パネルの重要度を計算できません。
tr: 'Genel' olarak ayarlanmış bir break kategoriniz olmadığından panel önemleri hesaplanamıyor.

source: Succesfully auto-prioritised preformed panels.
id: Sukses melakukan prioritasisasi rancangan panel secara otomatis.
it: Giurie preformate prioritarizzate in automatico con successo.
ja: 用意されたパネル枠の優先度の自動設定に成功しました。
tr: Önceden kurulmuş paneller otomatik önceliklendirildi.
vi: Đã tự động ưu tiên các bàn giám khảo thành công.

source: Since this is the first round, the preformed panels aren't annotated with brackets and liveness.
id: Karena ini ronde pertama, rancangan panel tidak dilabeli dengan bracket dan liveness.
it: Poiché questo è il primo round, i pannelli preformati non sono annotati con gruppi e partecipazione.
ja: これが初戦のため、用意されたパネル枠には勝ち点や生存度で注釈をつけることができません。
tr: Bu ilk tur olduğundan, önceden kurulmuş panellerin aşama ve break ihtimali gösterilmiyor.

source: The previous round's draw doesn't exist, so preformed panels can't be annotated with brackets and liveness.
id: Draw ronde sebelumnya tidak ada, maka rancangan panel tidak dapat dilabeli dengan bracket dan liveness.
it: Il sorteggio del round precedente non esiste, quindi i pannelli preformati non possono essere annotati da gruppi e partecipazione.
ja: 1つ前の試合は対戦表がまだないため、用意されたパネル枠には勝ち点や生存度で注釈をつけることができません。
tr: Önceki turun kurası yok, bu nedenle önceden kurulmuş panellerin aşama ve break ihtimali gösterilemiyor.

source: Succesfully created new preformed panels for this round.
id: Sukses membuat rancangan panel baru untuk ronde ini.
it: Create con successo nuove giurie preformate per questo round.
ja: このラウンドに新しくパネル枠を作ることに成功しました。
tr: Bu tur için yeni önceden kurulmuş paneller oluşturuldu.
vi: Đã tạo thành công bàn giám khảo cho vòng này.

source: chair
id: ketua panel
it: arbitro
ja: チェア
tr: başkan
vi: giám khảo chính

source: panellist
id: panelis
it: giudice
ja: パネル
tr: panelist
vi: giám khảo phụ

source: trainee
it: coach
ja: トレイニー
tr: acemi
vi: giám khảo thực tập

source: debate
id: debat
it: dibattito
ja: ディベート
tr: maç
vi: trận tranh biện

source: adjudicator
id: juri debat
it: giudice
ja: ジャッジ
tr: jüri
vi: giám khảo

source: type
id: tipe
it: tipo
ja: タイプ
tr: tür
vi: loại

source: available?
id: hadir?
it: disponibile?
ja: 有効ですか？
tr: uygun mu?
vi: sẵn sàng?

source: debate adjudicator
id: juri debat
it: giudice del dibattito
ja: ディベートのジャッジ
tr: Maç jürisi
vi: giám khảo tranh biện

source: debate adjudicators
id: juri debat
it: giudici del dibattito
ja: ディベートのジャッジ
tr: Maç jürileri
vi: các giám khảo tranh biện

source: team
id: tim
it: squadra
ja: チーム
tr: takım
vi: đội

source: adjudicator-team conflict
id: konflik juri dengan tim
it: giudice-squadra conflitto
ja: ジャッジ・チーム間コンフリクト
tr: jüri-takım conflicti
vi: xung đột giữa giám khảo và đội

source: adjudicator-team conflicts
id: konflik juri dengan tim
it: giudice-squadra conflitti
ja: ジャッジ・チーム間コンフリクト
tr: jüri-takım conflictleri
vi: xung đột giữa giám khảo và đội

source: adjudicator 1
id: juri 1
it: giudice 1
ja: ジャッジ１
tr: jüri 1
vi: giám khảo 1

source: adjudicator 2
id: juri 2
it: giudice 2
ja: ジャッジ２
tr: jüri 2
vi: giám khảo 2

source: adjudicator-adjudicator conflict
id: konflik juri dengan juri
it: giudice-giudice conflitto
ja: ジャッジ間コンフリクト
tr: jüri-jüri conflicti
vi: xung đột giữa các giám khảo

source: adjudicator-adjudicator conflicts
id: konflik juri dengan juri
it: giudice-giudice conflitti
ja: ジャッジ間コンフリクト
tr: jüri-jüri conflictleri
vi: xung đột giữa các giám khảo

source: institution
id: institusi
it: istituzione
ja: インスティチューション
tr: kurum
vi: tổ chức

source: adjudicator-institution conflict
id: konflik juri dengan institusi
it: giudice-istituzione conflitto
ja: ジャッジ・インスティチューション間のコンフリクト
tr: jüri-kurum conflicti
vi: xung đột giữa giám khảo và tổ chức

source: adjudicator-institution conflicts
id: konflik juri dengan institusi
it: giudice-istituzione conflitti
ja: ジャッジ・インスティチューション間のコンフリクト
tr: jüri-kurum conflictileri
vi: xung đột giữa giám khảo và tổ chức

source: team-institution conflict
id: konflik tim dengan institusi
it: squadra-istituzione conflitto
ja: チーム・大学（または団体）間のコンフリクト
tr: takım-kurum conflicti
vi: xung đột giữa đội và tổ chức

source: team-institution conflicts
id: konflik tim dengan institusi
it: squadra-istituzione conflitti
ja: チーム・大学（または団体）間のコンフリクト
tr: takım-kurum conflictileri
vi: xung đột giữa đội và tổ chức

source: round
id: ronde
ja: ラウンド
tr: tur
vi: vòng

source: importance
id: tingkat kepentingan
it: importanza
ja: 重要度
tr: önem
vi: mức độ quan trọng

source: minimum bracket
id: bracket minimum
it: raggruppamento minimo
ja: 勝ち点が同数のグループの最低数
tr: minimum aşama
vi: bảng dưới

source: Estimate of the lowest bracket for which this panel might be
id: Estimasi bracket terendah panel ini akan berada
it: Stima del raggruppamento più basso nella quale dovrebbe trovarsi questa giuria
ja: このパネルが割り当てられると想定されるブラケットの最低値
tr: Bu panelin mümkün en düşük aşamasının tahmini

source: maximum bracket
id: bracket maksimum
it: raggruppamento massimo
ja: 勝ち点が同数のグループの最大数
tr: maksimum aşama
vi: bảng trên

source: Estimate of the highest bracket for which this panel might be
id: Estimasi bracket tertinggi panel ini akan berada
it: Stima del raggruppamento più alto nella quale dovrebbe trovarsi questa giuria
ja: このパネルが割り当てられると想定されるブラケットの最高値
tr: Bu panelin mümkün en yüksek aşamasının tahmini

source: room rank
id: peringkat ruangan
it: grado stanza
ja: 部屋の順位
tr: oda sıralaması
vi: xếp hạng phòng

source: Sequential number of panel, not used in any algorithms
id: Angka terurut panel, tidak digunakan dalam algoritma manapun
it: Numero sequenziale della giuria, non viene usato in nessun algoritmo
ja: どのアルゴリズムでも使用されていないパネルの通し番号
tr: Sıralı panel sayısı, hiçbir algoritmada kullanılmaz
vi: Số thứ tự của bàn giám khảo không được dùng trong bất cứ thuật toán nào

source: liveness
it: attività
ja: 生存度
tr: break ihtimali
vi: khả năng bước tiếp

source: Number of categories this room is expected to be live for
id: Jumlah kategori ruangan ini diperkirakan masih live
it: Numero di categorie per cui questa stanza dovrebbe essere usata
ja: この部屋で生存が予想されるカテゴリー数
tr: Bu odanın break ihtimali olması beklenen kategori sayısı

source: preformed panel
id: rancangan panel
it: giuria preformata
ja: 事前設定されたパネル
tr: önceden kurulmuş panel
vi: bàn giám khảo chỉ định

source: preformed panels
id: rancangan panel
it: giurie preformate
ja: 事前設定されたパネル
tr: önceden kurulmuş paneller
vi: bàn giám khảo được chỉ định trước

source: panel
it: giuria
ja: パネル
vi: bàn giám khảo

source: preformed panel adjudicator
id: juri dalam rancangan panel
it: giudice della giuria preformata
ja: 事前設定されたパネルジャッジ
tr: önceden kurulmuş panel jürisi
vi: giám khảo của bàn giám khảo được chỉ định trước

source: preformed panel adjudicators
id: juri dalam rancangan panel
it: giudici della giuria preformata
ja: 事前設定されたパネルジャッジ
tr: önceden kurulmuş panel jürileri
vi: giám khảo của bàn giám khảo được chỉ định trước

source: There are no preformed panels to use. Have you allocated preformed panels for this round? If not, try just auto-allocating adjudicators instead.
id: Tidak ada rancangan panel untuk digunakan. Apakah anda telah menciptakan rancangan panel untuk ronde ini? Apabila belum, coba melakukan alokasi juri otomatis.
it: Non ci sono giurie preformate da usare. Hai assegnato delle giurie preformate per questo round? In caso contrario, prova ad allocare solo i giudici automatici.
ja: 使用できる事前設定されたパネルはいません。このラウンドに事前設定したパネルを配置済みですか？もし配置が済んでいなければ、代わりにジャッジの自動配置をお試しください。
tr: Kullanılacak önceden kurulmuş panel yok. Bu tur için önceden kurulmuş panel tahsis ettiniz mi? Etmediyseniz, bunun yerine yalnızca otomatik jüri tahsis etmeyi deneyin.
vi: Hiện tại không có bàn giám khảo nào được chỉ định trước để dùng. Bạn đã phân bổ bàn giám khảo đươc chỉ định trước cho vòng này chưa? Nếu chưa, hãy thử phân bổ giám khảo tự động.

source: Preformed Panels
id: Rancangan Panel
it: Giurie preformate
ja: 事前設定されたパネル
tr: Önceden kurulmuş paneller
vi: Bàn giám khảo chỉ định

source: A preformed panel is a defined group of adjudicators that is specified for a round before its draw has been generated. You can then manually or automatically apply these panels during the normal adjudicator allocation process. This can make allocations faster or allow you to create more considered panels of adjudicators.
id: Rancangan panel adalah sekumpulan juri yang telah dikhususkan untuk sebuah ronde sebelum draw dibuat. Anda dapat secara manual atau otomatis menggunakan kumpulan panel tersebut dalam proses alokasi juri seperti biasa. Ini dapat mempercepat proses alokasi atau menciptakan panel juri dengan pertimbangan tertentu.
it: Una giuria preformata è un gruppo definito di giudici che è specificato per un round prima che venga generato il sorteggio. È quindi possibile applicare manualmente o automaticamente questi pannelli durante il normale processo di assegnazione giudici. Questo può rendere le assegnazioni più veloci oppure consente di creare insiemi di giudici più ragionevoli.
ja: 「事前設定されたパネル」はドロー生成前にラウンドに割り当てられたジャッジグループと定義されています。これらのパネルは通常のジャッジアロケーション作業の間に、自動もしくは手動で適用できます。より早くアロケーションを行うことができ、または配慮の行き届いたパネル配置を実現できます。
tr: Önceden kurulmuş panel, kura oluşturulmadan önce bir tur için belirtilen tanımlanmış bir jüri grubudur. Daha sonra normal jüri tahsis işlemi sırasında bu panelleri manuel veya otomatik olarak kullanabilirsiniz. Bu, tahsisleri daha hızlı hale getirebilir veya daha iyi hazırlanmış hakem panelleri oluşturmanıza olanak tanır.
vi: Một bàn giám khảo được chỉ định trước là một nhóm các giám khảo được chỉ định chấm một vòng trước khi bảng đấu được tạo. Bạn có thể chọn bàn giám khảo bằng tay hoặc tự động trong quá trình phân bố giám khảo. Việc này có thể khiến việc phân bổ nhanh hơn hoặc khiến bạn cân nhắc hơn trong việc phân bổ giám khảo.

source: Note that only adjudicators who have been marked as 'available' for that round will be able to be allocated for that round, so you may need to set their availability in advance.
id: Perhatikan bahwa hanya juri yang telah ditandai sebagai 'hadir' untuk sebuah ronde yang dapat dialokasikan terhadap ronde tersebut, sehingga anda mungkin ingin mencentang kehadiran mereka sebelum ronde.
it: Si noti che solo i giudici che sono stati contrassegnati come 'disponibili' per quel round potranno essere assegnati nel round, quindi potrebbe essere necessario impostare prima la loro disponibilità.
ja: 「参加可能」と表示されているジャッジのみがそのラウンドに割り当てられているか確認してください。 事前にジャッジの参加可否を設定する必要がある場合があります。
tr: Yalnızca o tur için "kullanılabilir" olarak işaretlenmiş jürilerin bir tur için tahsis edilebileceğini unutmayın, bu nedenle müsaitlik durumlarını önceden ayarlamanız gerekebilir.
vi: Chú ý rằng chỉ có những giám khảo đã được đánh dấu 'sẵn sàng' cho vòng đó mới có thể được phân bổ cho vòng đó, nên bạn cần phải đánh dấu trước.

source: Edit Preformed Panels for %(round)s
id: Sunting Rancangan Panel untuk %(round)s
it: Modifica le giurie preformate per %(round)s
ja: %(round)sの事前設定されたパネルを編集する
tr: %(round)s için önceden kurulmuş panelleri düzenle
vi: Chỉnh sửa bàn giám khảo cho vòng %(round)s

source: Conflict: <strong>%(adjudicator)s</strong> & <strong>%(team)s</strong> (personal)
id: Konflik: <strong>%(adjudicator)s</strong> & <strong>%(team)s</strong> (personal)
it: Conflitto: <strong>%(adjudicator)s</strong> & <strong>%(team)s</strong> (personale)
ja: コンフリクト：<strong>%(adjudicator)s</strong>・<strong>%(team)s</strong>間（個人）
vi: Xung đột: <strong>%(adjudicator)s</strong> & <strong>%(team)s</strong> (cá nhân)

source: Conflict: <strong>%(adjudicator)s</strong> & <strong>%(team)s</strong> via institution <strong>%(institution)s</strong>
id: Konflik: <strong>%(adjudicator)s</strong> & <strong>%(team)s</strong> via institusi <strong>%(institution)s</strong>
it: Conflitto: <strong>%(adjudicator)s</strong> & <strong>%(team)s</strong> per istituzione <strong>%(institution)s</strong>
ja: コンフリクト：<strong>%(adjudicator)s</strong>・<strong>%(team)s</strong>（<strong>%(institution)s</strong>・大学/団体）
vi: Xung đột: <strong>%(adjudicator)s</strong> & <strong>%(team)s</strong> với tổ chức <strong>%(institution)s</strong>

source: Conflict: <strong>%(adjudicator1)s</strong> & <strong>%(adjudicator2)s</strong> (personal)
id: Konflik: <strong>%(adjudicator1)s</strong> & <strong>%(adjudicator2)s</strong> (personal)
it: Conflitto: <strong>%(adjudicator1)s</strong> & <strong>%(adjudicator2)s</strong> (personale)
ja: コンフリクト：<strong>%(adjudicator1)s</strong>・<strong>%(adjudicator2)s</strong>（個人）
vi: Xung đột: <strong>%(adjudicator1)s</strong> & <strong>%(adjudicator2)s</strong> (cá nhân)

source: Conflict: <strong>%(adjudicator1)s</strong> & <strong>%(adjudicator2)s</strong> via institution <strong>%(institution)s</strong>
id: Konflik: <strong>%(adjudicator1)s</strong> & <strong>%(adjudicator2)s</strong> via institusi <strong>%(institution)s</strong>
it: Conflitto: <strong>%(adjudicator1)s</strong> & <strong>%(adjudicator2)s</strong> per istituzione <strong>%(institution)s</strong>
ja: コンフリクト：<strong>%(adjudicator1)s</strong>・<strong>%(adjudicator2)s</strong>（<strong>%(institution)s</strong>・大学/団体）
vi: Xung đột: <strong>%(adjudicator1)s</strong> & <strong>%(adjudicator2)s</strong> với tổ chức <strong>%(institution)s</strong>

source: Male
id: Pria
it: Uomo
ja: 男性
tr: Erkek
vi: Nam

source: Female
id: Wanita
it: Donna
ja: 女性
tr: Kadın
vi: Nữ

source: Other
id: Lainnya
it: Altro
ja: その他
tr: Diğer
vi: Khác

source: Unknown
id: Tak diketahui
it: Sconosciuto
ja: 不明
tr: Bilinmeyen
vi: Không xác định
