Repository: tara-45/tabby8
Catalog: tabbycat/adjallocation/locale/*/LC_MESSAGES/django.po
Languages: id, it, ja, tr, vi

source: Edit Allocation
id: Sunting Alokasi
it: Modifica assegnazione
ja: アロケーションを編集する
tr: Tahsisi Düzenle
vi: Chỉnh sửa phân bổ

source: Edit Panels
id: Sunting Panel
it: Modifica giurie
ja: パネルを編集する
tr: Panelleri Düzenle
vi: Chỉnh sửa bàn giám khảo

source: Return to Panels Overview
id: Kembali ke Tinjauan Panel
it: Ritorna alla panormaica giurie
ja: パネルの概要に戻る
tr: Panellere Genel Bakış sayfasına geri dön
vi: Quay trở lại tổng quan bảng giám khảo

source: Adjudicator-Team Conflicts
id: Konflik Juri dengan Tim
it: Conflitti Giudice-Squadra
ja: ジャッジ・チーム間コンフリクト
tr: jüri-takım conflictleri
vi: Xung đột giữa giám khảo và đội

source: Save Adjudicator-Team Conflicts
id: Simpan Konflik Juri dengan Tim
it: Salva i conflitti Giudice-Squadra
ja: ジャッジ・チーム間のコンフリクトを保存する
tr: jüri-takım conflictlerini kaydet
vi: Lưu xung đột giữa giám khảo và đội

source: Saved %(count)d adjudicator-team conflict.
id: Menyimpan %(count)d konflik juri dengan tim.
it: Salvato %(count)d conflitto giudice-squadra.
ja: %(count)d件のジャッジ・チーム間コンフリクトが保存されました。
tr: %(count)d jüri-takım conflicti kaydedildi
vi: Đã lưu %(count)d xung đột giữa giám khảo và đội.

source: Deleted %(count)d adjudicator-team conflict.
id: Menghapus %(count)d konflik juri dengan tim.
it: Cancellato %(count)d conflitto giudice-squadra.
ja: %(count)d件のジャッジ・チーム間コンフリクトが削除されました。
tr: %(count)d jüri-takım conflicti silindi
vi: Đã xóa %(count)d xung đột giữa giám khảo và đội.

source: No changes were made to adjudicator-team conflicts.
id: Tidak ada suntingan yang dibuat terhadap konflik juri dengan tim.
it: Non sono state apportate modifiche ai conflitti giudici-squadre.
ja: ジャッジ・チーム間のコンフリクトに変更された点はありません。
tr: Jüri-takım conflictlerinde herhangi bir değişiklik yapılmamıştır.
vi: Không có thay đổi nào được thực hiện với xung đột giữa giám khảo và đội.

source: Adjudicator-Adjudicator Conflicts
id: Konflik Juri dengan Juri
it: Conflitti Giudice-Giudice
ja: ジャッジ間コンフリクト
tr: jüri-jüri conflictleri
vi: Xung đột giữa các giám khảo

source: Save Adjudicator-Adjudicator Conflicts
id: Menyimpan Konflik Juri dengan Juri
it: Salva conflitti Giudice-Giudice
ja: ジャッジ間コンフリクトを保存する
tr: jüri-jüri conflictlerini kaydet
vi: Lưu xung đột giữa các giám khảo

source: Saved %(count)d adjudicator-adjudicator conflict.
id: Menyimpan %(count)d konflik juri dengan juri.
it: Salvato %(count)d conflitto giudice-giudice.
ja: %(count)d件のジャッジ間コンフリクトを保存されました。
tr: %(count)d jüri-jüri conflicti kaydedildi.
vi: Đã lưu %(count)d xung đột giữa các giám khảo.

source: Deleted %(count)d adjudicator-adjudicator conflict.
id: Menghapus %(count)d konflik juri dengan juri.
it: Cancellato %(count)d conflitto giudice-giudice.
ja: %(count)d件のジャッジ間コンフリクトを削除されました。
tr: %(count)d jüri-jüri conflicti silindi.
vi: Đã xóa %(count)d xung đột giữa các giám khảo.

source: No changes were made to adjudicator-adjudicator conflicts.
id: Tidak ada suntingan yang dibuat terhadap konflik juri dengan juri.
it: Non sono state apportate modifiche ai conflitti giudici-giudici.
ja: ジャッジ間コンフリクトに変更された点はありません。
tr: Jüri-jüri conflictlerinde herhangi bir değişiklik yapılmamıştır.
vi: Không có thay đổi nào được thực hiện với xung đột giữa các giám khảo.

source: Adjudicator-Institution Conflicts
id: Konflik Juri dengan Institusi
it: Conflitti giudice-istituto
ja: ジャッジ・インスティチューション間のコンフリクト
tr: jüri-kurum conflictileri
vi: Xung đột giữa giám khảo và tổ chức

source: Save Adjudicator-Institution Conflicts
id: Menyimpan Konflik Juri dengan Institusi
it: Salva conflitti giudice-istituzione
ja: ジャッジ・インスティチューション間のコンフリクトを保存する
tr: jüri-kurum conflictilerini kaydet
vi: Lưu xung đột giữa giám khảo và tổ chức

source: Saved %(count)d adjudicator-institution conflict.
id: Menyimpan %(count)d konflik juri dengan institusi.
it: Salvato %(count)d conflitto giudice-istituzione.
ja: %(count)d件のジャッジ・インスティチューション間のコンフリクトが保存されました。
tr: %(count)d jüri-kurum conflicti kaydedildi.
vi: Đã lưu %(count)d xung đột giữa giám khảo và tổ chức.

source: Deleted %(count)d adjudicator-institution conflict.
id: Menghapus %(count)d konflik juri dengan institusi.
it: Eliminato %(count)d conflitto giudice-istituzione.
ja: %(count)d件のジャッジ・インスティチューション間のコンフリクトが削除されました。
tr: %(count)d jüri-kurum conflicti silindi.
vi: Đã xóa %(count)d xung đột giữa giám khảo và tổ chức.

source: No changes were made to adjudicator-institution conflicts.
id: Tidak ada suntingan yang dibuat terhadap konflik juri dengan institusi.
it: Non sono state apportate modifiche ai conflitti giudici-istituzioni.
ja: ジャッジ・インスティチューション間のコンフリクトに変更された点はありません。
tr: jüri-kurum conflictlerinde herhangi bir değişiklik yapılmamıştır.
vi: Không có thay đổi nào được thực hiện với xung đột giữa giám khảo và tổ chức.

source: Team-Institution Conflicts
id: Konflik Tim dengan Institusi
it: Conflitti squadra-istituzione
ja: チーム・大学（または団体）間のコンフリクト
tr: takım-kurum conflictileri
vi: Xung đột giữa đội và tổ chức

source: Save Team-Institution Conflicts
id: Menyimpan Konflik Tim dengan Institusi
it: Salva conflitti team-istituto
ja: チーム・大学（または団体）間のコンフリクトを保存する
tr: takım-kurum conflictileri Kaydetme
vi: Lưu xung đột giữa đội và tổ chức

source: Saved %(count)d team-institution conflict.
id: Menyimpan %(count)d konflik tim dengan institusi.
it: Salvato %(count)d conflitto team-istituzione.
ja: %(count)d個のチーム・大学（または団体）間のコンフリクトを保存しました。
tr: %(count)d takım-kurum conflicti kaydedildi.
vi: Đã lưu %(count)d xung đột giữa đội và tổ chức.

source: Deleted %(count)d team-institution conflict.
id: Menyimpan %(count)d konflik tim dengan institusi.
it: Cancellato %(count)d conflitto team-istituzione.
ja: %(count)d個のチーム・大学（または団体）間のコンフリクトを削除しました。
tr: %(count)d takım-kurum conflicti silindi.
vi: Đã xóa %(count)d xung đột giữa đội và tổ chức.

source: No changes were made to team-institution conflicts.
id: Tidak ada suntingan yang dibuat terhadap konflik tim dengan institusi.
it: Non sono state apportate modifiche ai conflitti giudici-istituzioni.
ja: チーム・大学（または団体）間のコンフリクトに変更はありません。
tr: ekip-kurum conflictlerinde herhangi bir değişiklik yapılmamıştır.
vi: Không có thay đổi nào được thực hiện với xung đột giữa đội và tổ chức.
